{"series": {"feedUrl": "http://feeds.feedburner.com/girlbossradio", "genres": ["Business", "Podcasts"], "title": "Girlboss Radio with Sophia Amoruso", "country": "USA", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "type": "series", "id": 1041122387}, "episodes": [{"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1482285540, "title": "Amel Monsur, Executive Creative Director Vice Media", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Amel Monsur is the Executive Creative Director at VICE, the world's leading youth media brand and content creation studio. At VICE, Amel has led project and content development across i-D &amp; Noisey, VICE's fashion cultural and music channels, as well a variety of branded campaigns that live off-channel. Amel's background is at the intersection of fashion, music and news, and she previously served as the Creative Director for Prince -- yes Prince! On the podcast, Amel discusses her early days working for Target, what it's like to be a creative working for a superior creative like Prince, and why creating content with a purpose is important these days.", "duration": "2994", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2520599467.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1481734800, "title": "Danielle Weisberg & Carly Zakin, Co-founders theSkimm", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "This week, we have not one, but two guests on Girlboss Radio - Carly Zakin and Danielle Weisberg, the Co-founders of theSkimm! TheSkimm started a daily newsletter, giving its readers all the news and info to start the day. It's since grown into an 'audience company' that has a circulation of over 4 million active readers including fans such as Oprah and Hoda Kotb. Carly and Danielle met studying abroad together in college and several years later they both found themselves working at NBC News. They became fast friends, roommates, and eventually co-founders. On the podcast, the Sophia, Carly, and Danielle discuss how the co-founders met, how Danielle and Carly engage with their Skimmbassadors, and how they've learned to manage their growing team over the years.<br /><br /><br /><br /><br /><br /><br />", "duration": "2841", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8463334736.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1479963600, "title": "Tracey Cunningham, Celebrity Hair Colorist & Owner Méche", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "You many not know Tracey, but you definitely know her work. She’s colored the famous locks of Jennifer Lopez, Lily Aldridge, Khloe Kardashian, and our very own Sophia Amoruso. She got her start working for none other than Bette Midler who put her through beauty school! Afterwards Tracey quickly rose through the ranks at the best salons in LA - Art Luna, Sally Hershberger, Byron &amp; Tracey among others. In 2012, she and stylist Neil Weisberg teamed up to combine the best of styling and coloring in the business with Méche. On the podcast, Tracey reminisces about styling Bette's hair while combing through cookbooks, how she knew she could be a great colorist, and how beauty regimens like coloring might fix short-term problems but maybe not the longterm ones in your life.", "duration": "2986", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9127261583.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1479358800, "title": "Alyssa Mastromonaco, COO Vice Media", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "From her early days bagging groceries, Alyssa Mastromonaco realized she had a gift for logistics. That gift led her all the way to the White House where she served as President Obama’s Deputy Chief of Staff. If you wanted to talk to President Obama, you had to go through Alyssa first. She left politics in 2014, and now works as the Chief Operating Officer of Vice Media. On this week’s episode, Sophia and Alyssa discuss Alyssa’s early days interning for Bernie Sanders, what good leadership means, and Alyssa’s hilarious misadventures in Buckingham Palace and on Marine One.", "duration": "2432", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP5504636015.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1478754000, "title": "Alli Webb, Founder Drybar", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Alli Webb's career has had numerous incarnations. She’s worked in public relations and she’s been a professional hairstylist. But it wasn’t until 2008, when Alli really found her passion. She started a side business called Straight-at-Home, which provided in-home blowouts on a referral basis in LA. When her business and popularity quickly outgrew her one-woman show, she expanded and opened a brick and mortar called Drybar. Drybar is based on the simple concept of focusing on one thing and being the best at it: blowouts. They now have 67 locations across the country. And her new book, <em>Good Hair for All</em>, tells you how you can achieve a great blowout at home. On the podcast Sophia and Alli talk about Alli's early days working at salons, leaving and returning to the workforce to found Drybar, and the inherent trust of working with family.<br /><br /><br />", "duration": "2274", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8337868467.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1478145600, "title": "Anne Fulenwider, Editor-in-Chief Marie Claire", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Anne Fulenwider is a tour de force in the publishing world. After graduating from Harvard University, she moved to New York and learned the ins and outs of journalism under the tutelage of George Plimpton at <em>The Paris Review</em>. And she continued to work alongside the greats including Graydon Carter at <em>Vanity Fair</em> and Joanna Coles at <em>Marie Claire</em>. In 2011, Anne left Marie Claire to become the Editor-in-Chief of <em>Brides</em> where she completely rebranded the magazine to expand its reader base, but she couldn’t stay away from <em>Marie Claire</em> for long. She returned to the magazine as their Editor-in-Chief where she continues to push the brand to speak to today’s modern woman with its in depth reporting, fashion guides, and entertaining and informative features. On the episode Anne tells us how she puts together a magazine every month, how simply raising your hand can get you the job your want, and why networking is useful even if the word itself can feel disingenuous.&nbsp;<br /><br /><br /><br /><br />", "duration": "2808", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP5889497078.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1477540800, "title": "Brit Morin, Founder & CEO Brit + Co", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Before Brit Morin could light that creative spark in all of us, she had to find that creativity within <em>herself</em>. After working for Google for four years, she left her stellar job working under Marissa Mayer to start her own company. But first, she decided to give herself a 6-month break. And those six months were, as Brit describes it, some of the most transformative months of her life. She enrolled in classes at a creative space for makers, and she abandoned the laptop screen for laser cutters, 3D printers, and clay. That experience ultimately inspired her to found Brit + Co, a new media and commerce company that enables creativity through inspirational content, online classes and do-it-yourself kits. The company now has partnerships with brands such as Target, and Brit is a regular DIY and lifestyle contributor to the Today show. On the podcast, Brit discusses her six month sabbatical after Google, how leadership roles can become political, and why everyone is a creative.", "duration": "2985", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8847654422.mp3?updated=1477547268", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1476936000, "title": "Anne-Marie Slaughter, President & CEO New America", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "When Dr. Anne-Marie Slaughter was asked to serve as the first female Director of Policy Planning for the U.S. State Department, it was her dream come true. She left her tenured position at Princeton’s Woodrow Wilson School of Public and International Affairs and commuted weekly from Princeton to Washington D.C. to work under then Secretary of State and current presidential nominee Hillary Clinton. But between the grueling hours, a rigid work schedule, and raising two teenage sons back in New Jersey, Anne-Marie was struggling. As much as this was a dream job, she knew her family needed her at home. She ultimately left the State Department after two years to return to a full workload at Princeton.&nbsp;<br /><br />Anne-Marie wrote about the difficulty of women achieving work-life balance in her widely read 2012&nbsp;<em>Atlantic</em>&nbsp;article “Why Women Still Can’t Have it All”, which became one of the magazine’s most read articles in its history. She continued this conversation with her book&nbsp;<em>Unfinished Business: Women, Men, Work, and Family</em>, which is now out in paperback. Anne-Marie is now the President and CEO of New America. On the podcast Anne-Marie tells us about her first job in academia at age 30, what's changed since she published her&nbsp;<em>Atlantic</em>&nbsp;article and how to foster equity and balance from the policy level to our relationships.", "duration": "3325", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7574710674.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1476331200, "title": "Jessica Bennett, New York Times Contributing Writer & Author Feminist Fight Club", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Journalist Jessica Bennett and her friends were all creatives striving for professional success in New York City. But some subtle (and not so subtle) bouts of sexism in the workplace were getting in the way of their hustle. So they sought refuge by creating a feminist fight club - a group of New York women in creative fields who meet once a month to share advice, vent, and support each other through their careers. Jessica’s penned her difficult workplace experiences, hilarious tips, and other useful advice for women in the workplace in her new book&nbsp;<em>Feminist Fight Club.</em><br />Jessica is an award-winning journalist and critic who writes on gender issues, sexuality and culture. She is a feature writer and columnist at&nbsp;<em>The New York Times</em>&nbsp;and her work has also appeared in Newsweek, where she began her career as a staff writer. On the podcast, Jessica discusses her early days as a crime beat reporter, who a bropropriator is, and why women should support other women.", "duration": "3124", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9943711702.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1475726400, "title": "Yesi Ortiz, Radio Host Power 106", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Yesi Ortiz has been called 'The Voice of LA' and man, does she know how to use that voice. Her dream was to work at Los Angeles' Power 106 radio station, and after enrolling in broadcasting school, she worked at all costs to make her dream come true -- that meant commuting from Long Beach to Las Vegas, taking a radio job in Mexico, and fighting big egos along the way. In 2006, through sheer talent and drive, Yesi realized her goal, and she's now Power 106's midday host. But what makes Yesi even more of a Girlboss is what she's accomplished outside of work. Off the air, Yesi is a single mother to her six children. She adopted them from their biological mother, Yesi’s sister, when she was just 25 years old. On the podcast, Yesi discusses developing a work ethic at her uncle's supermarket, how she suddenly became a single mother to her six children, and how work can be a haven.", "duration": "2406", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9047942341.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1475121600, "title": "Yuna, Musician", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Musician Yuna was already an accomplished singer and songwriter in her home country of Malaysia when she moved to Los Angeles six years ago. She always had her sights set on making it in the music world in the United States, which meant having to restart her career from scratch. Yuna worked hard, stayed true to her values, and lived by her mantra 'undersell and overperform.' Now, she's selling out venues around the world and collaborating with greats like Pharrell and Usher. On the podcast, Sophia and Yuna talk about forgoing career expectations, the subjectivity of sexiness, and her newest album&nbsp;<em>Chapters</em>.", "duration": "2629", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9953937466.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1474516800, "title": "Grace Bonney, Founder Design*Sponge", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "When Grace Bonney moved to Williamsburg in 2003, she noticed a DIY design culture in Brooklyn that wasn't being covered in design magazines. So she covered it herself with Design*Sponge, a blog which originally highlighted the creative design aesthetic we now know as&nbsp;<em>Brooklyn chic</em>. Since its founding in 2004, Design*Sponge has transformed into an expansive lifestyle website, which&nbsp;<em>The New York Times</em>&nbsp;called the “Martha Stewart Living for the Millennials.” On the podcast Sophia and Grace discuss finding your crowd, managing employees remotely, and Grace's new book&nbsp;<em>In the Company of Women</em>.", "duration": "2597", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP4300393648.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1473912000, "title": "Geena Rocero, Model & Transgender Activist", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Model and Transgender activist Geena Rocero understands the power of speaking your truth and taking control of your narrative. At 17 years old, Geena immigrated from the Philippines to the U.S. to pursue a modeling career. Over the next 12 years, she modeled for brands like Target, Rimmel, Cover Girl, Marriott Hotels and Macy’s, but she didn’t feel like the people around her knew her full story. So when Geena turned 30, she courageously ‘came out’ at her TED talk as trans to bring more visibility to the transgender community. Since then, Geena co-founded GenderProud, an advocacy and media production company that produces media to elevate justice and equality for the transgender community. On the podcast, Geena discusses her first job as a transgender beauty queen, seeing the 'F' on her driver's license for the first time, and the challenges facing the transgender workforce today.", "duration": "2554", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7174174345.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1473307200, "title": "Melissa Biggs-Bradley, Founder & CEO Indagare", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "If life is all about the journey, then Melissa Biggs Bradley is doing things right. The founder and CEO of the boutique travel agency and website Indagare has traveled to over 100 countries, six continents, and can rattle off hotel recommendations at the drop of a hat. Prior to Indagare, Melissa worked at Town &amp; Country magazine for 12 years and launched Town &amp; Country Travel which was nominated for a National Magazine Award for General Excellence by the American Society of Magazine Editors (ASME). On the podcast, Melissa recounts her long childhood plane rides to Australia, gives us some trips for traveling on the cheap, and tells us about her incredible #girlbossmoment.", "duration": "2524", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9398556437.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1472702400, "title": "Cassandra Grey, Founder and CEO Violet Grey", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Hollywood glamour can seem unattainable, but Cassandra Grey puts that glitz within reach with Violet Grey. The luxury beauty company curates the top makeup products in one space. Every product on their website and in their gorgeous Melrose store is rigorously vetted by their prestigious Violet Code, a group of magazine editors, makeup artists and designers who rank their favorite brands. Sophia and Cassandra discuss Cassandra's hippie days in Asheville, North Carolina, the challenges of merging content and commerce, and the brilliant marketing strategies of Beanie Babies.", "duration": "2061", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP6182123022.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1472443200, "title": "Girlboss Radio Talks Love, Friendships and Finances", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Money can be one of the hardest things to discuss with friends. That's exactly why Sophia talks to her good friend Alexi Wasser on this week's special episode of Girlboss Radio. The two of them tackle some of our biggest questions when it comes to finances. They go deep about finances when it comes to feminism and relationships, and they even open up about their own money struggles with each other.&nbsp;<br />This episode of Girlboss Radio is in partnership with Prudential. Prudential solves investment, insurance and retirement challenges, helping individuals, organizations and communities reach their goals. Sophia is teaming up with Prudential and their 4.01K Race for Retirement, which is on September 17th at the Rose Bowl in Los Angeles.", "duration": "1504", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP4260217498.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1472097600, "title": "Tyler Haney, Founder and CEO Outdoor Voices", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Tyler Haney has always been #DoingThings. The founder and CEO of Outdoor Voices was always an athlete, but the neon, black, and mesh apparel on the market, along with its competitive mentality, stopped resonating with her. Tyler realized what inspired her to stay active was completely different; she enjoyed a balanced, fun, and freeing approach to exercise. So she created Outdoor Voices, an active lifestyle brand that believes in freeing fitness from performance, and embracing activity with ease, humor, and delight. On this week’s episode Tyler tells Sophia about building a makeshift office from a bunkbed, traveling with her dad to a textile and mill convention in Utah, and the importance of building communities through activity.", "duration": "1861", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7988569646.mp3?updated=1472084727", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1471891020, "title": "Finance & the City with Farnoosh Torabi", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "City living ain't cheap. Rent is high, happy hours add up, and many of us have tons of student loans. How can we even begin to save when we're already in so much debt? On this week's special episode of Girlboss Radio in partnership with Prudential, we brought in an expert who has lived twenty-something city struggles. Farnoosh Torabi is the host of the CNBC show&nbsp;<em>Follow the Leader,&nbsp;</em>her award-winning&nbsp;<em>So Money&nbsp;</em>podcast, and the Finance columnist for&nbsp;<em>O Magazine</em>. Sophia and Farnoosh talk about getting out of $30,000 of debt, the beauty of 401Ks and how anyone can save.&nbsp;", "duration": "1803", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9389028960.mp3?updated=1471963853", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1471492800, "title": "Roya Rastegar, Director of Programming Los Angeles Film Festival", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Sometimes our careers take us places we never thought they could. That's certainly true for Roya Rastegar, who began her career on Wall Street and realized shortly after, she needed a radical change. She applied and was accepted into UC Santa Cruz's PhD program where she studied the history of consciousness under civil rights activist and famed academic Angela Davis. From there she used her studies to curate independent films and now works as the Director of Programming at the Los Angeles Film Festival. On this week's podcast, Sophia and Roya talk about the anxieties and joys of being an outsider, how to make small and large changes in your life, and why representation on and off screen is essential.", "duration": "2927", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2112156645.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1471282956, "title": "Girlboss Radio: What We Learned From Our Parents", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "So many of us adopt our financial habits from our parents. Did they teach us how to save? Or are we saving because they didn't at all? And where are they now when it comes to retirement? Many baby boomers refuse to retire - either it's not an option or they can't see themselves leaving the workforce. We wanted to hear from someone who's on the other end of things -- who's lived a full life filled with financial ups and downs. Someone who can dispense wise words about saving and maybe how she'd do things differently. So on this special episode of Girlboss Radio, Sophia invites the original momboss to the podcast: her mother Dena.&nbsp;<br />This episode of Girlboss Radio is in partnership with Prudential. Prudential solves investment, insurance and retirement challenges, helping individuals, organizations and communities reach their goals. Sophia is teaming up with Prudential and their 4.01K Race for Retirement, which is on September 17th at the Rose Bowl in Los Angeles. You can register for the race at run401k.com.&nbsp;", "duration": "1653", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2013490389.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1470888000, "title": "Jessica Williams, Comedian and Former The Daily Show correspondent", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "A very dope queen joins us on this week's podcast: Jessica Williams. At 22 years old, Jessica became the youngest correspondent and first on&nbsp;<em>The Daily Show,&nbsp;</em>and her hilarious and insightful segments on gender and race made her a necessary voice on the show. Since leaving the&nbsp;<em>The Daily Show</em>&nbsp;earlier this summer, Jessica has been busy co-hosting her podcast&nbsp;<em>2 Dope Queens&nbsp;</em>with Phoebe Robinson and creating her own sitcom for Comedy Central. On the episode, Sophia and Jessica discuss auditioning for Jon Stewart, the pressure of being the first in any field, and bathroom tips.", "duration": "2405", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9458382723.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1470283200, "title": "Suzy Batiz, Founder & CEO Poo~Pourri", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Suzy Batiz is the queen of the crapper. Fed up with the lack of natural bathroom odor solutions, Suzy combined her knowledge of essential oils and entrepreneurial passion and formulated Poo~Pourri as the first natural, truly effective solution to a universal problem: poop happens, and it stinks! Since 2007, 17 million bottles of Poo-Pourri have sold and annual sales now top $30 million. On this week's episode, Suzy discusses how her childhood fostered a maker mentality, how she survived two bankruptcies, and the viral video that put Poo~Pourri on the map.", "duration": "1908", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9670150498.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1469678400, "title": "Sara Christensen, Angel Investor & Advisor", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Sara Christensen has experienced all sides of the business world. In 2000, she<br />predicted the rise of the juice craze when she co-founded Liquiteria, the first<br />micro pressed juicery in New York City. After starting a successful brand<br />herself, Sara wanted to help others grow their businesses, so she became an<br />angel investor and venture capitalist. Most recently Sara served as the<br />Managing Director of The Raptor Group, where she invested in companies like<br />Uber, Airbnb, Snapchat, Spotify and more. On this week's episode, Sophia and<br />Sara discuss walking away from Liquiteria, why investing in female-founded<br />companies is important, and Sara's tips for pitching venture capitalists.", "duration": "2773", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7529454543.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1469073600, "title": "Julie Greenbaum, Co-Founder and Chief Revenue Officer Fuck Cancer", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "At just 19-years old, Julie created Fuck Cancer with the goal of creating an organization to honor her mother’s legacy who lost her battle with ovarian cancer. Starting as a 350-person party in Montreal, Fuck Cancer events quickly tripled in size, eventually spiraling into numerous events across North America as outlet for young people to connect and unite in the fight against cancer. Now Fuck Cancer has evolved into a movement dedicated to the prevention, early detection and communication of cancer. On the episode, Sophia and Julie discuss merging with the other Canada-based Fuck Cancer organization, competing with causes for funding, and carrying on her mother’s ongoing legacy.", "duration": "2295", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP6856539670.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1468468800, "title": "Alyssa Mastromonaco, COO Vice Media & Former Deputy Chief of Staff to Obama", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "From her early days bagging groceries, Alyssa Mastromonaco realized she had a gift for logistics. That gift led her all the way to the White House where she served as President Obama’s Deputy Chief of Staff. If you wanted to talk to President Obama, you had to go through Alyssa first. She left politics in 2014, and now works as the Chief Operating Officer of Vice Media. On this week’s episode, Sophia and Alyssa discuss Alyssa’s early days interning for Bernie Sanders, what good leadership means, and Alyssa’s hilarious misadventures in Buckingham Palace and on Marine One.", "duration": "2448", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP3003112096.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1467864000, "title": "Claire Wineland, Founder Claire's Place Foundation", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "At 19 years old, Claire Wineland is by far our youngest guest on Girlboss Radio, but she may be the wisest. Claire has been living with Cystic Fibrosis her entire life and is the founder of Claire's Place Foundation, which provides grants to families affected by CF, offering both emotional and financial support. Claire’s unique inspirational model for people living with this disease has led her to be a TEDx Speaker and receive multiple awards including FoxTeen Choice Awards 2015, Gloria Barron Prize for Young Heroes, and winner of Los Angeles Business Journal’s “Small Nonprofit of the Year.\" On the episode, Sophia and Claire discuss Claire's positive outlook on life, starting an organization from a hospital bed, and Claire's whimsical funeral plans.", "duration": "2721", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9644486633.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1467259200, "title": "Payal Kadakia, Co-founder and CEO ClassPass", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Payal Kadakia is an artist in the C-suite and on the dance floor. As the Co-Founder and CEO of ClassPass, the membership program for fitness classes across gyms and studios, Payal has raised $84 million in venture capital and expanded the app services to 34 cities in four countries. She's also a professional dancer and the founder of the classical Indian and folk dance group, Sa, which has performed in such renowned spaces as Lincoln Center, Alvin Ailey, and more. On this week's episode Sophia and Payal discuss how creativity and business and inform one another, how to fail fast, and getting stuck in the 'I love my work' game.", "duration": "2735", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1940825817.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1466654400, "title": "GloZell Green, Youtube Star and Author", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "GloZell Green is a Youtube sensation who has well over 8 million subscribers across platforms and has reached up to 48 million views for a single video. She’s interviewed the likes of President Obama and Presidential candidate Hillary Clinton all while wearing her signature green lipstick. Her new book<em>&nbsp;Is You Okay?</em>&nbsp;traces her journey from pursuing theater in Florida to her first Youtube upload in 2008, and much more. On the podcast, Sophia and GloZell discuss GloZell's early days blogging about&nbsp;<em>The Tonight Show</em>, being recognized at a CostCo, and why she's bringing reading back.", "duration": "3086", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1474474883.mp3?updated=1466807739", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1466049600, "title": "Melissa Ben-Ishay, Founder and Chief Product Officer Baked by Melissa", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "As Beyonce tells us, if life gives you lemons, make lemonade...or cupcakes. That's exactly what Melissa Ben-Ishay did when she was fired from her advertising job in 2008. She went home, baked 250 cupcakes, and began Baked by Melissa. Melissa's bite sized cupcake empire boasts 14 locations in the New York area and ships nationally. On the episode, Sophia and Melissa discuss the pros and cons of a family business, how Melissa grew her business out of her tiny Murray Hill apartment, and what 'Baked' by Melissa really means.", "duration": "2645", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8109276741.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1465444800, "title": "Kathryn Minshew, Co-founder & CEO The Muse", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Kathryn Minshew co-founded the wildly popular career development platform, The Muse. The website, which now garners six million users a month, is completely built from the user's perspective with behind-the-scenes looks at job opportunities, original career advice from experts, and access to career coaches to get personalized and private career help. Kathryn was named Forbes 30 Under 30 in 2011 and 2012. And she and her co-founders were on Inc. Magazine’s 2012 list of 15 Women to Watch in Tech. On this week's episode, Kathryn and Sophia talk about saving money to start your own business, the grueling days of pitching to investors, and what an ideal job candidate looks like.", "duration": "2733", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP4369367232.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1464840000, "title": "Emily Weiss, Founder & CEO Glossier Inc.", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Emily Weiss is your go-to lady for all things beauty related. In 2010 she started Into the Gloss, a website dedicated to beauty that explores the routines of inspiring women. Emily and her editors sit on the bathroom floors of everyone from Jenna Lyons to the #Girlboss herself, Sophia Amoruso, to talk products, career, and what beauty means to women today. In 2014, Emily expanded her beauty business with Glossier, a modern beauty products brand made by editors who 'get' what works and are inspired by what girls want in real life. On the episode, Sophia and Emily discuss when it's time to strike it on your own, how to present yourself to investors, and what beauty means today.", "duration": "2720", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7240803516.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1464235200, "title": "Whitney Wolfe, Founder & CEO Bumble", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Whitney Wolfe always makes the first move in her life. The Founder and CEO of Bumble created a dating app that turns social norms on its head where the woman must initiate the conversation. If she doesn't send a message in the next 24 hours, the connection disappears forever. Whitney's also a co-Founder of Tinder and served as their Vice President of Marketing. She left the job after filing a heavily reported sexual harassment lawsuit against the company, which she’s since settled. On the episode Sophia and Whitney discuss making female friends in the 21st century, the detrimental effects of bullying, and what's next for Bumble.", "duration": "2543", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2055240998.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1463630400, "title": "Rachel Shechtman, Founder & CEO, Story", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Rachel Shechtman comes from a long line of retailers in her family. But when she joined the family business, she did it her way with Story. Story is a retail space that has the point of view of a magazine, changes like a gallery, and sells things like a store. It's an incredibly inventive space that merges the worlds of commerce, content, and community. Rachel has been named Crain's NY 40 Under 40 List for 2015, Fortune's 40 Under 40 List for 2013, and on Fast Company's Most Creative People in Business. On the episode, Sophia and Rachel discuss Rachel's serendipitous first job at the Barefoot Contessa, creating a 2.0 community space with Story, and how to make yourself an adjective.&nbsp;", "duration": "3087", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8783584383.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1463030258, "title": "Beth Comstock, Vice Chair, GE", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Beth Comstock is literally reinventing the lightbulb. As the Vice Chair of General Electric, Beth runs everything from business innovation to lighting, sales, marketing and more at the 130 year old company. Previously Beth worked as GE’s Chief Marketing Officer and held positions at NBCUniversal as the President of Integrated Media. There she led the company’s digital efforts, namely co-founding Hulu.com. Beth’s been named one of the “World’s 100 Most Powerful Women” by Forbes and listed in Fortune’s Most Powerful Women.", "duration": "2940", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP5865101748.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1462420800, "title": "Miki Agrawal, Co-founder & CEO, THINX", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "For social entrepreneur Miki Agrawal, no business idea is taboo. She's capitalizing on everything that happens behind the bathroom door - starting with periods. As the Co-founder and CEO of THINX, Miki has developed and patented period-proof underwear that not only works, but is also fashionable. And for each pair of underwear purchased, the company will donate money toward the cost of one set of reusable pads for a Ugandan girl through Afripads. Miki's also launching ICON, underwear for women who experience incontinence and TUSHY, bidets that attach to your toilet to create an eco-friendly and hygienic bathroom experience. Prior to conquering the toilet, Miki founded Wild, the gluten free pizza restaurants located in Manhattan and Williamsburg. On the episode, Sophia and Miki discuss Miki's hilarious pitching method to investors, how a three-legged race with her twin sister led to the idea of THINX, and Miki's pants-dropping #Girlbossmoment.", "duration": "3063", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9503975685.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1461816000, "title": "Jenne Lombardo, Co-founder MADE Fashion Week, Founder & CEO The Terminal Presents", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Whether its fashion or business, Jenne Lombardo knows what's in and out of style. As the Co-founder of MADE Fashion Week, Jenne turned the fashion industry on its head by forgoing the established designers at its shows and supporting upstart designers like Proenza Schouler, Alexander Wang, and Joseph Altuzzara. She's also the Founder and CEO of The Terminal Presents, which resuscitates brands like Keds, W Hotels, and Playboy to cater to a modern, millennial audience. On the podcast, Sophia and Jenne discuss Jenne's early years in New York, collaborating with Lady Gaga at MAC, and working for the original Mr. Big.", "duration": "2733", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP5996889906.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1461211200, "title": "Ai-jen Poo, Director National Domestic Workers Alliance", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "If there was ever a woman to make the world a better place, Ai-jen Poo seems to fit the bill. As the Director of the National Domestic Workers Alliance, Ai-jen has worked tirelessly throughout her career on behalf of domestic workers in the U.S., informing them about their rights and providing them legal protections. In 2010 she helped pass the Domestic Workers Bill of Rights, historic legislation that extended basic labor protections to over 200,000 domestic workers in New York state. Ai-jen was a 2014 recipient of the prestigious MacArthur “Genius” Award for all of her efforts, and in 2012&nbsp;<em>Time</em>&nbsp;magazine named her one of the 100 most influential people in the world.", "duration": "3141", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2129130667.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1460606400, "title": "Jenn Hyman, Co-founder & CEO Rent the Runway", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Jenn Hyman spotted a trend. She saw companies like Netflix and Spotify putting our music and movies in the cloud and realized our closets were next. So in 2009, she and co-founder Jennifer Fleiss founded Rent the Runway, an online service that provides designer dress and accessory rentals. The company now boasts well over five million subscribers, and Jenn has been named&nbsp;<em>Fortune Magazine’s&nbsp;</em>“Most Powerful Women Entrepreneurs” and&nbsp;<em>Fast Company’s</em>&nbsp;“Most Influential Women in Technology.”<em>&nbsp;</em>On the episode Jenn and Sophia discuss what it means to be 'sweet' in the workplace, meeting with Diane von Furstenberg, and never taking 'no' for an answer.", "duration": "2813", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7309433821.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1460001600, "title": "Alexa von Tobel, Founder & CEO, LearnVest", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Alexa von Tobel is proud to say she's a business school drop-out. She left Harvard Business School to launch LearnVest - a financial planning advice website that helps you get smart with your money. And being a drop-out paid off. Since launching LearnVest in 2009, the company has raised well over $75 million and last year was acquired by Northwestern Mutual. On the episode, Sophia and Alexa discuss their similar career trajectories, starting LearnVest in sweatpants, and Alexa's awesome power brunch answer.", "duration": "2609", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP6439320686.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1459396800, "title": "Julia Landauer, NASCAR Racer", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "NASCAR Racer Julia Landauer literally lives life in the fast lane. At 14, she became the first and youngest female champion to win the legendary Skip Barber Racing Series. After graduating from Stanford University with a degree in Science, Technology and Society, Julia returned to the track for her first full season with NASCAR and was undoubtedly successful. She was the first woman to win a NASCAR track championship at the Motor Mile Speedway in Virginia. On the episode, Sophia and Julia talk STEM education, self-advocacy, and speeding tickets.", "duration": "2125", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP3823948294.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1458792000, "title": "Alexi Wasser, Actor-Writer-Comedian", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Alexi Wasser is the ultimate multi-hyphenate. She's an actor, writer, comedian, and podcaster, but all of her work carries that distinct Alexi Wasser touch. It's funny, vulnerable, and brutally honest. Her blog,&nbsp;<a href=\"http://www.imboycrazy.com/\">http://www.imboycrazy.com</a>&nbsp;, is Alexi's raw take on sex, love and dating. Alexi's new podcast, Love Alexi, gets personal about all things relationships, life, and more with her guests. On #GirlbossRadio, Sophia and Alexi discuss hustling your brand, putting in 10,000 hours, and crashing Will Smith's wedding.", "duration": "2567", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2581862965.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1458194400, "title": "Hannah Bronfman, DJ & Founder of HBFit.com", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Hannah Bronfman cannot be labeled. By day she runs her website HBFit.com, a health and beauty website, and by night, Hannah's a corporate DJ, playing at some of the chicest events in New York. Hannah's currently part of Adidas' new Sport 16 campaign, and she recently unveiled her new fashion and beauty web series,&nbsp;<em>Hannahgram</em>, with Popsugar. On the episode, Sophia and Hannah discuss Hannah's early dive bar DJ days at Bard College, creating a sticky brand like HBFit, and how to tighten and lift that butt.", "duration": "2863", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP3703024933.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1457586000, "title": "Sallie Krawcheck, Co-founder & CEO Ellevest, Former CEO Merrill Lynch Wealth Management", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Sallie Krawcheck knows how to take the bull by the horns. After all, she worked on Wall Street for most of her career starting as a research analyst at Salomon Brothers. She eventually became the CEO of Smith Barney, Citi Bank Wealth Management, and Merrill Lynch Wealth Management. Over the course of her impressive career in the finance world, Sallie witnessed rampant sexism and an overall disregard of women's investing needs. Now as the co-Founder and CEO of Ellevest, a digital investment platform by and for women, she's addressing these needs and what Sallie calls, the 'gender investing gap'. On the episode, Sophia and Sallie discuss Sallie's crazy first week at Salomon Brothers<em>,&nbsp;</em>her world record,<em>&nbsp;</em>and why women should invest.", "duration": "2907", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9253071680.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1456981200, "title": "Rachel Weiss, L'Oreal VP of Innovation and Entrepreneurship", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Rachel Weiss is a trailblazer in the beauty world. As L’Oreal’s VP of Innovation and Entrepreneurship, she is responsible for all of L’Oreal USA’s digital marketing and innovation strategy. She singlehandedly put L'Oreal at the forefront of tech when she founded L'Oreal's Women in Digital program, which mentors women working in digital roles that address the needs of the beauty industry. On this week's episode, Sophia and Rachel discuss Rachel's childhood one-woman band, surviving the internet bubble burst, and championing women in technology.", "duration": "2841", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1124074529.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1456376400, "title": "Christine Day, CEO Luvo & Former CEO Lululemon", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Christine Day is a perennial disrupter. Whether she's changing the way we work and consume coffee, as she did during her 20 year tenure at Starbucks, or making athletic wear beautiful and accessible for women at Lululemon, Christine understands where a market is underserved. Now she’s the CEO of Luvo, a company aiming to bring healthy and affordable foods to the frozen food aisle. On the episode, Sophia and Christine discuss Christine's first day at Starbucks, crying at the office, and working as CEO of Lululemon.", "duration": "3039", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP3571229879.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1455771600, "title": "Petra Cortright, Artist", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Petra Cortright is an artist for the digital age. She is renowned for her webcam self-portrait videos, which she uploads onto Youtube. Her work has gained serious recognition in the art world and has been featured in The New Museum, Rhizome, and the Venice Biennale. For the past two years Petra's collaborated with Stella McCartney on a series of video projects for her eponymous fashion line. On the podcast, Sophia and Petra discuss Petra's early competitive soccer days, collaborating with Stella, and loving internet trolls.<br />This episode of #GirlbossRadio is brought to you by Freshbooks. If you believe that living your best life includes being your own boss, then you've got to try FreshBooks. Go to Freshbooks.com/GIRLBOSS for your free 30-day trial. And by Club W. Club W is a revolutionary new wine club that sends you wine directly to your door. Go to Clubw.com/GIRBOSS to get 50% off your next order.", "duration": "2529", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7155719929.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1455166800, "title": "Amanda Bacon, Founder and Owner, Moon Juice", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Amanda Bacon grabs headlines, not only for her one-of-a-kind juices, but also for the celebrity clients who love what she makes. The founder and owner of the Los Angeles-based juice bar, Moon Juice, Amanda sees juice not just as nourishment, but as a tonic for improved beauty, balance, and overall well-being. Amanda shares her unconventional story of rising to the top, beginning with a job that isn’t usually equated with CEOs.<br /><br />This episode of #GirlbossRadio is brought to you by Freshbooks. If you believe that living your best life includes being your own boss, then you've got to try FreshBooks. Go to Freshbooks.com/GIRLBOSS for your free 30-day trial. And Squarespace. Start building your website today at Squarespace.com. Enter offer code GIRLBOSS at checkout to get 10% off! Squarespace — Build it Beautiful.", "duration": "2561", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9264287496.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1454619600, "title": "Moj Mahdara, CEO Beautycon", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Moj Mahdara is always on the forefront of all things digital. Her current project? Beautycon Media. Beautycon is the global community of content creators, celebrities, fans and brands that come together to celebrate all things fashion, beauty, and style of the Gen Z and Millennial lifestyle. Prior Beautycon, Moj started two other digital agencies, MMA and Made with Elastic. On this episode, Sophia and Moj discuss Moj's college radio station days, creating brilliant brand partnerships, and how today's Beautycon girls embody the Riot grrrl movement.<br /><br />http://www.girlboss.com/&nbsp; &nbsp;<br /><br />This episode of #GirlbossRadio is brought to you by Freshbooks. If you believe that living your best life includes being your own boss, then you've got to try FreshBooks. Go to Freshbooks.com/GIRLBOSS for your free 30-day trial. And Squarespace. Start building your website today at Squarespace.com. Enter offer code GIRLBOSS at checkout to get 10% off! Squarespace — Build it Beautiful.", "duration": "2453", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9107929348.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1453957260, "title": "Jessica Koslow, Chef and Owner Sqirl", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Jessica Koslow has the food world talking. Her restaurant Sqirl's inventive take on breakfast and lunch has customers lining up for her signature rice bowls and jams. The New York Times food columnist Mark Bittman calls her dishes \"downright revolutionary\". But Jessica's career hasn't been a straight path to the kitchen. On this episode, Sophia and Jessica discuss Jessica's competitive ice skating days, sending a cold e-mail to #girlboss and chef Anne Quatrano, and the exciting future of Sqirl.\nhttp://www.girlboss.com/\n \nThis episode of #GirlbossRadio is brought to you by Club W. Club W is a revolutionary new wine club that sends you wine directly to your door. Go to Clubw.com/GIRBOSS to get 50% off your next order. \nAnd Squarespace. Start building your website today at Squarespace.com. Enter offer code GIRLBOSS at checkout to get 10% off! Squarespace — Build it Beautiful.", "duration": "1826", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1415597460.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1453376776, "title": "Gregg Renfrew, CEO Beautycounter", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Gregg Renfrew is a serial entrepreneur. She was the CEO of the Wedding List, an online bridal registry company, which she sold to Martha Stewart Omnimedia in 2001. She's also consulted high end brands like Bergdorf Goodman and Intermix. In 2013, she launched her latest company, Beautycounter, a cosmetics line that creates safe, healthy and fashion forward beauty products. On the podcast, Sophia and Gregg discuss Gregg's early days at Xerox, her unexpected foray into politics, and Beautycounter's mission to better the world.\n \nToday’s show is brought to you by Freshbooks. If you believe that living your best life includes being your own boss, then you’ve got to try FreshBooks. Go to FreshBooks.com/girlboss for your free 30-day trial.\nToday's show is also brought to you by MeUndies. MeUndies makes the world’s most comfortable underwear that come in tons of styles. Head to MeUndies.com/GIRLBOSS to get free shipping and 20% off your first order.", "duration": "2531", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP3211194740.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1452747660, "title": "Christene Barberich, Global Editor-in-Chief & Co-Founder, Refinery29", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Christene Barberich is a media force. As the Co-Founder and Global Editor-in-Chief of Refinery29, Christene has grown the company from a niche website about New York boutique designers into a lifestyle brand that's expanding globally. Before founding at Refinery29, Christene held positions at The Daily, Gourmet Magazine, and The New Yorker. On this episode, Sophia and Christene discuss their parallel career trajectories, brand identity, and the late David Bowie.\nThis episode is brought to you by Squarespace. When you decide to sign up for Squarespace, make sure to use the offer code GIRLBOSS to get 10 percent off your first purchase.\nThis episode is also brought to you by FreshBooks. If you believe that living your best life includes being your own boss, then you've got to try FreshBooks. Go to Freshbooks.com/GIRLBOSS for your free 30-day trial.", "duration": "2882", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7253013421.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1452171711, "title": "Courtney Love, Musician & Actress", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Courtney Love is outspoken, unapologetic, and fierce. Her band Hole was nominated for multiple Grammys and their albums Live Through This and Celebrity Skin went platinum. She's also a Golden Globe nominated actress. Courtney's iconic style has influenced the likes of Givenchy, Yves Saint Laurent, and now, Nasty Gal. The two discussed working with Andy Warhol, the price of fame, and their new Courtney Love x Nasty Gal collaboration. \nToday's show is brought to you by Club W. Don't ever come home to a wine-free house again. Go to ClubW.com/Girlboss for 50 percent off your first over. ClubW.com/Girlboss\nToday's show is also brought to you by FreshBooks. FreshBooks makes creating and sending invoices, organizing your expenses, and tracking your hours the easiest part of your day. Go to Freshbooks.com/girlboss for your free 30-day trial.", "duration": "3375", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7588867539.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1450933260, "title": "#GirbossRadio Sophia and Liz Holiday Special", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "On this festive mini episode of #GirlbossRadio Sophia and Liz talk about  nose hair trimmers (among other things) and their #Girlbossmoment of the year!", "duration": "484", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7648633043.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1450357124, "title": "Bethany Cosentino, Singer & Songwriter, Best Coast", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Bethany Cosentino is the epitome of California cool. She's the front woman and songwriter for the hit band Best Coast, which released its acclaimed album California Nights in May.  The band will be hitting the road with Wavves and Cherry Glazerr for their Summer is Forever II tour in February. On this episode, Sophia and Bethany discuss Bethany's karaoke days in Pasadena, touring with Best Coast, and Little Caesars' pizza ads.", "duration": "2981", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7529234026.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1449723660, "title": "Sarah Wilkinson, Vice President of Design, Nasty Gal", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Sarah Wilkinson is Nasty Gal's VP of Design. She grew up in the UK, went to art school, and worked at ASOS for six years as its Head of Womenswear Design. On the episode, Sophia and Sarah celebrate Sarah's three year anniversary at Nasty Gal, swoon over living in Florence, and discuss bobblehats -- lots and lots of bobble hats.", "duration": "3014", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8512918496.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1449118860, "title": "Sloane Crosley, Author", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Sloane Crosley is a #Girlboss literary darling. She's the author of two personal essay collections, I Was Told There'd Be Cake and How Did You Get This Number. She’s written for The New York Times, New York Magazine, and The Wall Street Journal, and her work has been a finalist for the Thurber Prize of American Humor. She's recently released her first novel, The Clasp, a story about three friends and their madcap adventure to recover a lost, historic necklace.", "duration": "3180", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2376893649.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1448492247, "title": "Liz Goldwyn - Author, Director", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Liz Goldwyn is a jack of all trades and a master of all them. Her career ranges from working at Planned Parenthood at age 13, contributing to The New York Times Magazine, and curating Sotheby's fashion department. She is out with her second book, Sporting Guide, which delves into the world of prostitution in 19th century Los Angeles. Sophia and Liz discuss her book, sexuality, buttermilk beauty routines and more.", "duration": "1970", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1401008274.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1447956070, "title": "Kay Cannon - Screenwriter, Pitch Perfect & Pitch Perfect 2", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Kay Cannon is one of the funniest women working in Hollywood today. As a staff writer for 30 Rock and the screenwriter for both Pitch Perfect and Pitch Perfect 2, Kay has made kept us laughing in the theaters and in our homes. Sophia and Kay discuss working as a lady in comedy, having Tina Fey as a mentor, and the glory days at Macaroni Grill.", "duration": "2928", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP9351587670.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1447304460, "title": "Sheree Waterson, CEO Nasty Gal", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "This week, Sophia talks to a personal mentor: Sheree Waterson. Over the past 25 years, Sheree has conquered the retail world - starting as a holiday gift wrapper at Joseph Magnin Co. to rising to the CEO of Nasty Gal. Sheree talks candidly about her successes and challenges at Lululemon, shares her leadership tips, and gives us an inside look at scaling the magic of Nasty Gal.", "duration": "1896", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP7195060329.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1446699660, "title": "Madeline Poole, Nail Artist, Author, Global Color Ambassador at Sally Hansen", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Madeline Poole is a nail artist queen. She’s painted the famous nails of Miley Cyrus and Stella McCartney. Her tutorials have been featured on Vogue.com, TeenVogue.com, Refinery29, and IntoTheGloss. She’s the Global Color Ambassador for Sally Hansen, and she's the author ofNails, Nails, Nail!: 25 DIY Creative Nail Art Projects.\nThis episode of #girlboss radio is sponsored by Audible.com. Get a free audiobook of your choice at Audible.com/GIRLBOSS", "duration": "1476", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP8761499074.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1446091260, "title": "Grace Helbig, YouTube Personality, Comedian, Author", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "Grace Helbig is the digital #Girlboss of our dreams. Her hit Youtube channel It's Grace has over 2.5 million subscribers. She hosts the popular podcast Not Too Deep with Grace Helbig, and she's The New York Times bestselling author of Grace’s Guide: The Art of Pretending to Be a Grown-Up. Grace opens up about being a introvert on the web, her controversy with E!, and working as the CEO of her multifaceted brand.", "duration": "1374", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2817227740.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1445486460, "title": "Charlize Theron, Actress, Producer, Activist, Mother.", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "For our first episode, Sophia talks to the ultimate #Girlboss: Charlize Theron. You might know Charlize as an Academy Award winning actress who dazzles us playing strong, complex women on screen. But she's a #Girlboss in every way off screen too. Theron is a U.N. Messenger of Peace, the founder of the Charlize Theron Africa Outreach Project, and a mother of two. We talk to the actress about her career trajectory, the Hollywood gender pay gap, the importance of girlfriends in your life, and much more.", "duration": "1427", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP1456219751.mp3", "type": "episode", "tags": []}, {"seriesId": 1041122387, "seriesTitle": "Girlboss Radio with Sophia Amoruso", "pubDate": 1442520039, "title": "Introducing #girlboss radio", "author": "Sophia Amoruso / Panoply / Girl Boss / Nasty Gal", "summary": "On each episode, Nasty Gal founder and author of #Girlboss Sophia Amoruso interviews world-class girlbosses who have made their mark in creative, cultural, and business ventures to extract solid advice from the lessons they've learned along the way. Expect hilarious co-hosts and conversations you won't hear anywhere else. On this podcast Sophia hopes to humanize the known, champion the unknown, and, well, laugh a little about the absurdity that is life. Are you ready?", "duration": "63", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/a9/80/3b/a9803b5f-746c-c6b2-58e0-a6c43ea9eda5/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PP2571951895.mp3", "type": "episode", "tags": []}]}