{"series": {"feedUrl": "http://bobheilig.libsyn.com/rss", "genres": ["Careers", "Podcasts", "Business", "Education", "Health", "Training", "Self-Help"], "title": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "country": "USA", "author": "Bob Heilig: Online Entrepreneur, Author, Blogger", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "type": "series", "id": 1046138184}, "episodes": [{"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1488601152, "title": "50: 3 Strategies to Help You Become a World Class Presenter", "author": "", "summary": "<p>Welcome to episode 50! I definitely didn’t think we would make it this far but I am super grateful to have you here. Today we talk about public speaking. I know a lot of you have a fear of speaking in public but in order to be a great entrepreneur you must learn to be able to be a great communicator. Today I give you my top three tips to help you overcome your fear, become more confident, and become the world class speaker you are destined to become.</p> <p>Most everyone deals with the fear of public speaking and it is certainly one of my number one fears. I was always the student who never wanted to raise their hand in class and was never confident amongst my peers. I knew that in order to become a successful entrepreneur I had to get over this fear and become more comfortable with communicating.</p> <p>The first time I gave a public speech was at a hotel early on in my career to about 30 individuals. I remember opening the meeting in pure panic. I actually considered just leaving right on the spot. There was even a cup of water that I was holding and I was so nervous that I was shaking and spilling the water. When that meeting was over I couldn’t run out of that room fast enough.  I then made a commitment to myself that I would never embarrass myself like that ever again.</p> <p>Three strategies to overcome fear of public speaking:</p> <ol> <li>Record yourself giving a presentation to see, hear, and critique your mannerisms.</li> <li>Read aloud and practice putting emotion and life into the words</li> <li>Start modeling other people. Find other speakers whose style resonates with you and study them.</li> </ol> <p>It took years of implementing these three strategies before I actually became pretty good. In the book, <em>The War of Art</em>, it talks about how the things we fear the most, we were actually put on this earth to do. I want you to face your fear and recognize that the fear is an indicator for something you are destined to do. With these three tips you too can become a world class presenter!</p> <p>Quick reminder: I have a live training event coming up on April 7 – 9 that you should strongly consider. Be sure to check it out here: <a href=\"http://www.breakthroughacademylive.com/\" target=\"_blank\">www.BreakthroughAcademyLive.com</a> </p>", "duration": "22:44", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_50.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1487678400, "title": "49: Overcoming the Fear of Leadership", "author": "", "summary": "<p>In this episode we are talk about the fear of leadership. I hope this episode can give you some insight as to why you may be struggling in this area and how to overcome it!</p> <p>In my early days, I used to self-sabotage my business and my results. I never quite understood why I did this and now looking back, it is very clear. To be truthful, I actually didn’t believe I had what it took to be a leader. This was a vicious cycle that I was in for years that was extremely frustrating. The thought of having a large organization and being in charge of its direction scared me to death.</p> <p>To attack this problem, you need to do two things:</p> <ol> <li>Recognize that this fear is real and something that you will have to deal with.</li> <li>Then, acknowledge the resistance. Many times in our life the things we fear the most are the things we were put on this earth to do. If you are fearing this idea of becoming a leader than you were probably meant to lead!</li> </ol> <p>Stop letting fear control your business and pressing the snooze button on your dreams, goals, and passions. I want to challenge every one of you to stand up and be the leader you are supposed to be!</p> <p>Big announcement, I have the single most comprehensive training that I have ever done on the subject of live video that I will be doing this Wednesday night. Be sure to register for my next live training session here: BobHeilig.com/VideoTraining</p>", "duration": "12:58", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_49.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1487516163, "title": "48: Building a Massive Following on Social Media", "author": "", "summary": "<p>Today we are talking about how to build a massive following on social media. Hopefully by now, many of you are using Facebook and creating videos to build your following. Perhaps you are doing this but you are still struggling. This can be extremely frustrating! Most people get discouraged and quit at this point. However, you must remember that marketing takes time and it is hard work.</p> <p>In this episode I share the formula for how I built my social media following to where it is today. This took me over six months of creating content every day. Consistent application of this formula will bring the results you are looking for.</p> <p>Social Media Growth Formula:</p> <p>Attention + Trust = Growth of your following</p> <p>Attention has three parts:</p> <ol> <li>Be authentic and abstain from watering down your true self</li> <li>Be generous with your knowledge, information, and time</li> <li>Be consistent each and every day</li> </ol> <p>When you leverage these three items you gain attention which is followed by trust and thus your following grows. For you to gain a following you have to have the long game in mind. You must have a willingness to give and stick with it!</p> <p>I hope this episode give you a ton of value. Remember not to get discouraged and follow the formula!</p> <p>Be sure to register for my next live training session here: <a href=\"http://bobheilig.libsyn.com/BobHeilig.com/VideoTraining\">BobHeilig.com/VideoTraining</a></p>", "duration": "14:57", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_48.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1482942976, "title": "47: The Traditional Business Owner Mindset to Customer Acquisition", "author": "", "summary": "<p>In this episode we discuss customer acquisition through a traditional business owner’s mindset. I want to share with you a mindset that once adopted, can help you dramatically increase your customer base. Sometimes it is easy to lose focus on customer acquisition when tapping into your own personal network. Today’s episode highlights strategies to increase your effectiveness at reaching out to this network. After realizing these strategies you will be amazed at how much easier it is to acquire customers from within.</p> <p>Customers are the lifeblood of your company. Without customers there is no money and if you want your business to provide true freedom to you and your family, you need a lot of customers! If you have not made it a priority to acquire a lot of customers, that can start to reflect poorly on the rest of your team. If you can lead by example and grow your customer base then your team will follow your lead.</p> <p>Two Questions to think about:</p> <ol> <li>When you think about the people in your life, your family and friends, how many are using your products and services?</li> <li>Of the people not currently your customers, are they already using products or services that are similar to what you offer.</li> </ol> <p>For many of us, the people we know are already using the products and services that we are selling and often times these products are inferior. It is at this point that you must take the mentality of a traditional business owner. If friends and family are using similar products that are inferior is that okay to you? You should expect at the very least they give your products and services a try.</p> <p>A traditional business owner will:</p> <ol> <li>Draw a line in the sand. Expect their network to support their business.</li> <li>Share with people why they are in business and why it is important to them.</li> <li>Make a list of every person that has done a favor for them and ask them to return the favor and try their product or service.</li> <li>Ask their network to TRY their product or service, COMPARE it to the current version they use, and listen to their FEEDBACK.</li> </ol> <p> </p> <p>Now not everyone is going to like the product or service and that is okay, but in order to be successful and grow your business, it is necessary to have a strong mentality when you approach potential customers. Don’t go so far as to lose friendships and relationships over your business but it is important to let people you know how important your business is to you.</p>", "duration": "17:59", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_47.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1482514367, "title": "46: The Lesson of the Chinese Bamboo Tree", "author": "", "summary": "<p>In this episode we discuss the powerful lesson learned from the Chinese bamboo tree.</p> <p>Network marketers especially but in any business, we put so much pressure on days like Black Friday, Cyber Monday, and small business Saturday. Taking advantage of these days is great, but it is not going to make or break your business. It is much more the little things that you do every day that matter most.</p> <p>The Chinese bamboo tree is a perfect example of this principle. Once planted, this remarkable tree takes four years to break the ground. That is four years of consistent watering and fertilizing with no visual results. Only at this point does the tree begin to show growth when it shoots up to 90 feet into the sky within 6 weeks.</p> <p>My message today is that you have the patience and engage in consistent actions. Everyone has a bamboo tree. All you have to do is have faith to keep watering and fertilizing daily.</p>", "duration": "14:41", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_046.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1480568373, "title": "45: Increasing Your Productivity and Results Through Greater Focus", "author": "", "summary": "<p>In this episode we discuss the 80/20 rule of sales and marketing.</p> <p>This principle simply states that 80 percent of the effects come from 20 percent of the causes.</p> <p>One of the best books you can read is the 80/20 Rule of Sales and Marketing by Perry Marshal. In this book, Marshal discusses how this principle can essentially apply to anything in life.</p> <p>It is critical as a leader that when you build a team you don’t get pulled in too many directions. The larger the team, the more difficult it becomes to remain productive and you slip into management mode. Because of this, it is important to focus on the right activities and people that got your business to where it is in the first place</p> <p> 3 Takeaways from this episode: </p> <ol> <li>80% of your production will come from 20% of your people</li> <li>80% of your results will come from 20% of your activities</li> <li>80% of your time should be spent developing the relationships with the best 20% of people</li> </ol> <p>This episode is a recording from a Facebook Live training that I did over on my Your Virtual Upline Fan Page earlier this week. I wanted to share the message with you here, knowing that it's going to make a huge impact for you all.  Make sure you go to Facebook and \"Like\" my fan page if you haven't already.  I'm doing a live training every Monday - Friday at 8:00 am EST that you can join live, or see the recording.  Here's the link to my page:</p> <p><a href=\"http://www.facebook.com/YourVirtualUpline\" target=\"_blank\">www.Facebook.com/YourVirtualUpline</a></p>", "duration": "22:17", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_045.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1479537375, "title": "44: People Don't Join Companies, They Join People", "author": "", "summary": "<p>In this episode we discuss the concept:</p> <p>“People Don’t Join Companies, They Join People”</p> <p>One of the hardest lessons to learn is that people don’t join companies they join people. If you’re at a point in your business where you are struggling to attract recruits, it may be that your prospects don’t feel as though you have enough value to offer. This can be HARD to hear for some people.</p> <p>The question everyone must ask is why would someone join me? There are so many opportunities and because of this, you must learn to demonstrate your value as a partner. Once you start demonstrating value things start to turn!</p> <p>Two actionable takeaways from this episode:</p> <ol> <li>Instead of constantly selling people on how great your company is, start selling people on you. Start to DEMONSTRATE your value to others.</li> <li>Start PROACTIVLEY reaching out and ENGAGING with people that are in your network and show them you care.</li> </ol> <p>This episode is a recording from a Facebook Live training that I did over on my Your Virtual Upline Fan Page earlier this week. I wanted to share the message with you here, knowing that it's going to make a huge impact for you all.  Make sure you go to Facebook and \"Like\" my fan page if you haven't already.  I'm doing a live training every Monday - Friday at 8:00 am EST that you can join live, or see the recording.  Here's the link to my page:</p> <p><a href=\"http://www.facebook.com/YourVirtualUpline\" target=\"_blank\">www.Facebook.com/YourVirtualUpline</a></p>", "duration": "14:41", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_044.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1478793737, "title": "43: The Power of Vision", "author": "", "summary": "<p>In this episode we discuss the power of having a positive vision for your life.  A vision is a clear mental picture of what COULD be in your life, fueled by the conviction that it SHOULD be.  </p> <p>Most people struggle as entrepreneurs because they focus all their time and attention on their current circumstances and their past.  This is the reason why they get \"stuck\" and never have the motivation or drive to consistently take action towards their goals.</p> <p>When you can develop a crystal clear vision for where you want your life to be, and focus intently on it every day, it starts to act like a rubber band pulling you towards that desired outcome.  You start making different decisions each day and focus only on the things that will help you advance your life.  </p> <p>Having a vision makes you persistent.  Once you know exactly what you want and can \"see it\", then no matter what comes against you, you never give up.  In the episode today I share with you how you can start to develop that positive vision for your life and your business.  </p> <p>For many of you, this will be a critical first step to you turning your business around and creating the life that you know that you deserve.  </p>", "duration": "17:39", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_043.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1478357513, "title": "42: Success REQUIRES Struggle", "author": "", "summary": "<p>In this episode we discuss one of the not so well known secrets of success:</p> <p>\"Success REQUIRES struggle.\"</p> <p>One of the biggest reasons why most people are not achieving their goals in their life and their business, is they don't understand the relationship between success and failure.  The only way you can become massively successful in your life, is you have to also become a massive failure.</p> <p>Sounds kind of counter-intuitive, right?  Here's what successful people know, that most failures do not - the positive you get in your life is actually the BY PRODUCT of the negative.  You will be successful to the degree that you are willing and able to put up with all the bad, negative \"stuff\" that you encounter.</p> <p>Any goal you have in your life is a 2-sided coin.  On one side is what you want, and on the other side - in DIRECT PROPORTION, is what you don't want to do to achieve that goal.  Those two things will always be in balance.  </p> <p>In the episode I mention one of my favorite books of all time, Go For No by Richard Fenton.  I highly recommend reading it, if you haven't already.  This recording is from a Facebook Live training that I did over on my Your Virtual Upline Fan Page earlier this week.  I already have almost 40,000 views and over 700 shares since it was broadcasted.  </p> <p>I wanted to share the message with you here, knowing that it's going to make a huge impact for you all.  Make sure you go to Facebook and \"Like\" my fan page if you haven't already.  I'm doing a live training every Monday - Friday at 8:00 am EST that you can join live, or see the recording.  Here's the link to my page:</p> <p><a href=\"http://www.Facebook.com/YourVirtualUpline\">www.Facebook.com/YourVirtualUpline</a></p>", "duration": "12:07", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_042.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1477838905, "title": "41: The 80/20 Rule for Developing the Leaders on Your Team", "author": "", "summary": "<p>In this episode we discuss the 80/20 Rule for working with and developing the leaders on your team.  The 80/20 Rule says that regardless of how large your team is, you should never PERSONALLY be spending time with more that 20% of the people.  This is a recording from my \"signature course\" for network marketers, the Breakthrough Academy.    </p> <p>One of the biggest mistakes I see leaders make, is they spend all their time working with the wrong people.  They spend time working with the people on their team that NEED, but don't DESERVE their time.  I like to call these the \"squeaky wheels\", these are the people that don't ever produce but are constantly demanding your time and all they want to do is complain.  </p> <p>What you need to learn to do is identify and focus on the top 20% of your team, and start spending your time there.  These are the people on your team that don't NEED, but they do DESERVE your personal time.  One of the most important things I ever did for my business, was starting to spend more concentrated time helping this group of people.  </p> <p>In the training you will learn how to identify who the 20%'ers on your team, and I explain a detailed process of beginning to work more closely with them.  If you can start following this rule and implementing what you learn in this training, I promise you that you won't believe the difference this will make for your business.  </p> <p>If you are interested in learning more about the Breakthrough Academy you can visit the following link to see all that is included in the online course:  <a href=\"http://www.BobHeilig.com/BreakthroughAcademy\">www.BobHeilig.com/BreakthroughAcademy</a> </p> <p>I HIGHLY recommend this course for anyone looking to take their businesses to the next level.  Whether you are brand new, or already an established leader, there is information in the course that can help you create results far beyond anything you've ever experienced.  Thanks for joining me today, hope you got some value out of the training!</p> <p> </p>", "duration": "26:55", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_041.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1476725240, "title": "40: Sales and Marketing Strategies for New Product Launches", "author": "", "summary": "<p>In this episode I share with you sales and marketing strategies for new product launches.  One of the questions I get asked a lot is, \"<em>My company just announced a new product...how should I go about marketing it to my network?</em>\"</p> <p>In this training, I share with you my top tips and strategies for dealing with new product launches in your company.  When done correctly,  new product launches can be an incredibly powerful way to generate momentum in your business.</p> <p>The sad reality is however, that most people go about new product launches completely the WRONG way.  They immediately go to their social media and start posting every day all the information about the new product, and how excited they are to share it with everyone.  </p> <p>They start \"spamming\" their contact list, thinking that people will just jump all over the new offer just because they put it out there.  This is NOT the way you want to approach a new product launch.  You have to view the information that you have about this new product, etc. as a very valuable commodity.  The information that you have about that new product is a reason for you to reach back out to prospects and re-engage with them.  When you just freely put the information out there at every opportunity, you lose all of the power.  In my opinion, it actually de-values the information.  </p> <p>In the training I share with you my top 3 ways to approach prospects with this new information, and I share some of my best scripts for you to use.  This episode is a longer than usual, but I promise you it is an hour of some of the best training you'll ever get in the area of new product launches.    </p> <p> </p>", "duration": "58:34", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_040.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1476362607, "title": "39: My Interview with Ray Higdon", "author": "", "summary": "<p>In this episode I share with you an interview that I did with Ray Higdon for one of his \"Top Earner Success Spotlights\".  Each month Ray highlights a new success story for his blog, podcast, and a monthly newsletter he sends out to his readers.  </p> <p>I was fortunate enough to be selected by Ray, and this is the interview that we did together.  It was such an honor and cool experience to be featured by Ray, and I know that all of you will get a ton of value out of listening to the recording. </p> <p>In the interview I talk about my personal story the last year, going from dead broke basically to building a million dollar online business.  I share with you why marketing is such an important skill for any entrepreneur to learn, and how it can help you start to work smarter in your business.</p> <p>I share with you the importance of using social media the RIGHT way in your business, and I share with you how creating videos on line literally changed my life.  One of my favorite parts of the interview is towards the end where I start to talk about fear, and what holds most people back from achieving their greatness.  </p> <p>Thanks again to Ray for this amazing opportunity.  I hope you all enjoy!</p>", "duration": "32:03", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_039.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1475794437, "title": "38: The Importance of Accountability and Recognition when Growing a Team", "author": "", "summary": "<p>In this episode I share with you two of the most important things you need to implement if you want to grow a large, successful team.  Whether you're a network marketer or traditional business owner, if you're building a sales organization of any size, this training will be critical for you.</p> <p>When you analyze any successful organization of any kind, there are usually two things that are cornerstones of their culture.  First, the members of that team usually have a high level of personal accountability for their production and job responsibilities.  Second, there is a high level of recognition when it comes to those performing the best in the group.</p> <p>As a leader, one of the biggest mistakes I made in my early days, was I didn't understand my responsibility to implement these things in my team.  I just expected that the people on my team should automatically \"get it\", and it frustrated me when they wouldn't do the things they were supposed to be doing.</p> <p>In my training today, I share with you how to implement these two things in your team, so you can instantly start seeing better results.  Start doing some of the things I share with you in this episode and you'll be amazed at how differently your people start to respond.  </p>", "duration": "22:33", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_038.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1474305992, "title": "37: The Takeaway Method for Following-Up", "author": "", "summary": "<p>In this episode I discuss with you one of my all-time favorite methods of following-up with unresponsive prospects, \"The Takeaway Method\".  We've all had these types of prospects before, the ones who keep saying, \"they're interested\" but never make a decision.  This also works incredibly well with prospects that have stopped responding to you after initially expressing interest.</p> <p>Anyone looking to become more effective at following-up with, or closing prospects into your business NEEDS to listen to this episode.  One of the things that I talk about a lot in this training, is the importance of posture and attitude when it comes to the exposure process.</p> <p>If your prospect feels like you \"need them\", then they're not going to be as interested in what you're offering them.  A lot of times people keep pushing or come across as too \"needy\", and that's why they struggle.  If you learn to use this method of following-up, you're going to start to start to see prospects respond to you in a much more favorable way.  </p> <p>When someone knows you don't \"need them\", it's amazing how much more it makes the right people \"want it\".  Hope you enjoy this episode!  I know you will!!  </p>", "duration": "17:35", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_37.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1469457134, "title": "36: My Interview with Chalene Johnson", "author": "", "summary": "<p>In this episode I share with you an interview I did with New York Times best selling author and branding and online business expert Chalene Johnson.  Chalene asked me to share my story and some training on how I've build my online business for her \"Build Your Tribe\" and \"Chalene Show\" podcasts.  </p> <p>My interview was featured on both of her podcasts, I thought I would share with you all here incase you missed it.  This was an amazing opportunity for me, in that Chalene's podcasts have over 10 million total downloads.  Here Facebook Fan Page has almost 1 million likes, so needless to say it was a pretty big deal that she asked to interview me.  </p> <p>In the interview I share 5 tips to help you start to build your personal brand and how you can become an authority online.  I give you my top strategies if you are in network marketing and looking to leverage the power of social media to grow your business.  The highlight of the interview however, is when Chalene gets me to beat box and rap with her on live video.  Only Chalene could actually get me to do that!  </p> <p>Hope you enjoy the interview as much as I did.  For more information on how you can become an authority online and build and grow your own personal brand check out the details of a 3 day live training event I have coming up in just a few weeks!</p> <p> <a href=\"http://www.BreakthroughAcademyLive.com\">www.BreakthroughAcademyLive.com</a>  </p>", "duration": "01:03:35", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Your_Virtual_Upline_036.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1466088147, "title": "35: Run the 4 Minute Mile for Your Team", "author": "", "summary": "<p><strong>Episode 35: Run the 4 Minute Mile for Your Team</strong></p> <p> </p> <p>This is session is for the leaders out there who are in network marketing or anyone else leading any type of a team.</p> <p>Ask yourself these questions:</p> <ol> <li>Are you frustrated because the people on your team are not showing up or not putting in the work?</li> <li>Are your people not advancing or do they seem to have hit a ceiling?</li> <li>Do you feel that you want it more than they do?</li> <li>Why won't your people follow what you're saying?</li> </ol> <p>Since we are not in the corporate world, it's important to realize that in network marketing, we are building a volunteer army.  The problem is we have to figure out how to motivate and inspire our team.  How do we do that?  By leading them by example.</p> <p>All of us start off our businesses in phase 1, which is recruiting, meeting people and going out there every day to build our business.  But then we start feeling the need to train the people we have and fall into what is called \"management mode\".  We concentrate on teaching our team how to do things, in turn being dependent on them for growth.  So, what will you do when they aren't progressing?  How do you get them back on track?</p> <p>The highest responsibility of a leader is to lead by example and to demonstrate the correct behaviors to our team.  Stop and ponder on these important points:</p> <ol> <li>Are YOU part of the reason why you team isn't succeeding?</li> <li>Do you lack personal accomplishments in your business?</li> <li>When was the last time that YOU rank advanced in your company?</li> <li>Are you showing them that's it's possible to hit your goals?</li> <li>When you are in \"management mode\" and not doing Phase 1 activities, how is that affecting your business?</li> </ol> <p>If you have stopped rank advancing, then consider that your people may be struggling with if it's even possible for them.  Sometimes we need to get a little selfish, get out of management mode, start showing everyone it's possible to getting back to Phase 1.</p> <p>A good example of this is the story of Roger Bannister.  He was the first person to ever run a 4 minute mile.  Before him, people thought it was humanly impossible to complete this goal.  Once Roger Bannister accomplished it, within a year hundreds of others also accomplished this once thought impossible feat.  </p> <p>What changed?  It took one person to show the entire world that it was POSSIBLE.  I challenge you to run the 4 minute mile for your team.  Show the leaders on your team that it's possible to rank advance and achieve your goals.  This will encourage them to stretch and achieve their goals.  </p> <p>Make a decision today to hit that next rank, to get your next promotion.  Get uncomfortable, get out of management mode, and back to Phase 1 activity.  Show your team that it's possible to do what they may now think is impossible.  </p>", "duration": "17:20", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_35.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1463754442, "title": "34: My Top 5 Ways to use Facebook Live to Grow Your Business", "author": "", "summary": "<p>In this episode we discuss the power of live streaming video when it comes to growing your business and personal brand.  If you haven't already started to leverage the power of this incredible tool, you are really missing out.  In my opinion, the future of social media will be live streaming video.    </p> <p>There has never been a more powerful tool to quickly develop know, like, and trust with your team and prospects.  In the last few months, Facebook has made some major enhancements to their live streaming platform that I feel make it perfect for network marketing professionals.  </p> <p>In the training I talk about which platform you should focus on (Periscope of Facebook Live), and give you the top 5 ways to use live streaming video to help you grow your business faster.  These are simple things that you can begin to implement today that will make a huge difference when it comes to training and working with your team.    </p> <p> </p>", "duration": "21:39", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_34.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1463172584, "title": "33: How to Deal with Unsupportive People", "author": "", "summary": "<p>In this episode we discuss how to deal with people that are close to you, but unsupportive of you when it comes to your business.  One of the hardest things for new entrepreneurs to face is when people they expect to be their biggest cheerleaders are negative towards them regarding their business.  </p> <p>It's really important to understand why this happens and what you can do to help you deal with it.  If you are currently dealing with this in your life, this may be one of the most impactful messages you'll ever hear on this podcast.  It's important to understand that you aren't alone.  Every successful entrepreneur has had to deal with this in their life, no matter who they are.  </p> <p>If you are interested in attending my upcoming live event in August make sure you check out the details at <a href=\"http://www.BreakthroughAcademyLive.com\">www.BreakthroughAcademyLive.com</a>  Hope to see you there!</p>", "duration": "13:35", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_33.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1462996937, "title": "32: Slow and Steady Doesn't Win the Race for an Entrepreneur", "author": "", "summary": "<p>In this episode we discuss the importance of taking massive action if you are looking to create massive results in your business.  The old adage, \"slow and steady wins the race\" doesn't apply when you're an entrepreneur.  Slow and steady will kill most people when it comes to your their business.  Just quitting is not enough.</p> <p>If you want to create extraordinary results in your business you must be willing to commit short periods of all out massive action.  You need to treat your business like an airplane.  Anything less than 100% throttle won't get it off of the ground.  In the training I give you the framework for a 30 day game plan that anyone of you can follow to turnaround your business virtually overnight.  </p> <p>Anyone who is trying to build a business needs to hear this training in order to understand what it really takes to be successful.  For many of you this will be a wake up call, because you're going to realize you've never really worked your business nearly hard enough up until this point.  </p> <p>At the end of the episode I announce the details of a 3-day live training event I'll be hosting on August 12th - 14th in Philadelphia called the Breakthrough Academy Live.  For more details and to register for this event just go to:  </p> <p><a href=\"http://www.BreakthroughAcademyLive.com\">www.BreakthroughAcademyLive.com </a></p> <p>Hope to see you there!</p>", "duration": "21:51", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_32.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1458787003, "title": "31: The Power of Focus and Consistency", "author": "", "summary": "<p>In this episode I discuss two essential elements for creating success in anything that you do, focus and consistency.  Without those two things it's nearly impossible to succeed as an entrepreneur and build a successful business.  Most people when they become entrepreneurs are what I refer to as \"some-time\".  They build their business only when it's convenient or when they \"feel like it\".  They're focused for a week then something happens to blow them off course.  In this episode I discuss the keys to remaining focused so you don't get knocked off track.  I give you my top tips for being consistent and showing up every day in your business.  I share with you some of the most valuable lesson's I've learned along my road to success.  This is a recording from a training I did on Periscope last week.  If you haven't had a chance to check me out on Periscope just go to <a href=\"http://www.BobHeilig.com/Periscope\">www.BobHeilig.com/Periscope</a>.  I also mention my upcoming group coaching program the Breakthrough Academy.  If you would like information on that you can go to <a href=\"http://www.BreakthroughAcademy2016.com\">www.BreakthroughAcademy2016.com</a>  </p>", "duration": "16:11", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_31.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1458259303, "title": "30: My 6-figure Video Marketing Formula", "author": "", "summary": "<p>In this episode I give you the exact video marketing formula that I used to go from zero to 6-figures in income in less than 6 months.  The first ever video I posted to social media was in June of 2015.  I procrastinated FOREVER before I finally caved in and started posting videos.  I struggled with everything that most people deal with when it comes to creating videos.  I was worried about what other people would think about me, whether or not I really had anything worthwhile to share and how I come look and come across to the people watching.  I literally had to be forced to do my first video.  I remember how scared I was to upload the video to Facebook that first time.  I was mortified after I finally brought myself to be able to hit share.  To my surprise, people actually gave me great feedback.  They let me know how much the video helped them.  That was my first lesson that there is tremendous value in doing videos.  I committed to doing them several times per week and over the next few months things really started to take off.  I can honestly say, that if it weren't for my decision to begin to market myself using video, I would never be where I am in my business today.  None of you would even know who I am.  In the training today I go over the elements of what makes up a great video.  I give you some specific things to do when you are first starting out.  I explain how you don't have to be super successful in your company or an expert to share valuable videos.  I share with you some of my \"secret tips\" that I follow when creating videos and how by just paying attention you can come up with an endless amount of content to use.  Hopefully this will inspire some of you to start using this incredibly powerful tool.  I can't wait to hear the success stories from those of you that do.  </p>", "duration": "28:06", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_30.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1457734262, "title": "29:  The Money is Not in Your Product or Service", "author": "", "summary": "<p>In this episode we discuss the concept of how the actual money to be made in network marketing is not in your product or service.  The money is in the ability to move your product or service into the hands of the end user (your customer).  The problem most people in network marketing have is they have no idea how to move their products or services.  Network marketing is an industry of marketing and promotion, pursued by people who have no idea how to market or promote.  If you don't know how to market or promote effectively you're basically screwed.  I know this sounds completely counter-intuitive but your product is not your actual product.  Here's what I mean.  Most network marketers are either selling their opportunity or their products and services to people.  What you SHOULD be selling to people is a SYSTEM.  A system that if they follow will effectively turn those products and services into money.  That's the real reason why people start businesses.  To make money.  I promise you this training will give you a completely different way to look at your network marketing opportunity.  I go into detail how you can begin to \"systematize\" your business to make it more attractive to prospects.  If you implement the things you learn in this episode in your business you should start seeing dramatically better results.  </p>", "duration": "16:39", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_29.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1457448580, "title": "28: Your First Year in Network Marketing", "author": "", "summary": "<p>In this episode we discuss what it really takes to be successful in the network marketing profession.  Specifically we go over what the first year in this business should look like for most people.  It's incredibly important for people to have the proper expectations when it comes to what it will take to become successful in this profession.  Most people's idea of what it's going to take and what to expect is WAY OFF.  People come into network marketing thinking they can put in minimal effort and get maximum results.  That couldn't be further from the truth.  Network marketing is really no different from building any traditional business.  For some reason, many people don't realize this when they first start their business.  I go over exactly what to expect in your first year and what you should be focusing on if you want to create long-term success.  I share with you a \"formula\" that almost all top earners in this profession follow on their road to success.  I think for many of you this will be very eye opening in terms of what it's actually going to take.  </p>", "duration": "23:32", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_28.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1457006484, "title": "27: We Have a Better Way", "author": "", "summary": "<p>In this episode I share with you a keynote speech I gave in 2013 at the network marketing company's national convention that I was working with at that time.  This was a huge moment for me, given how much I had struggled with public speaking my entire life.  To be asked to close out the weekend in front of thousands of people was a pretty big deal.  The topic of my speech was \"We Have a Better Way\".  In my talk I discuss how although network marketing isn't perfect - it absolutely is a better vehicle for people who are looking to achieve their goals and dreams.  I share with you some advice on how to overcome all the challenges you face along the road to success.  I share quite a bit about my personal story which I hope will inspire you to keep moving forward.  At the very end I brought out my Mom, Dad, Sister, Brother-in-law and their 4 little kids out with me on the stage.  It was without a doubt one of the proudest moments of my life.  Just 10 years earlier when I was asked to speak in front of a room for the first time, deathly afraid - I never would have imagined to be in that position.  It's a testament to the fact that you can accomplish anything you want if you are willing to work hard enough and commit to the process of improving every single day.  </p>", "duration": "28:28", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_27.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1456266046, "title": "26: How One Webinar Changed my Life", "author": "", "summary": "<p>In this episode I share with you my story of how my life literally changed overnight with one webinar.  It was from a live Periscope I did a few weeks ago that got more positive feedback than anything I've ever done.  It is the most vulnerable and open I've ever been in a training message.  At the very end I get overcome with emotions and gratitude for everything that has happened.  Last month I hosted my first ever paid training.  It was a live webinar, which was the first webinar I've ever done in my life.  I went into the process really not having any idea what kind of demand I would have for the product.  I had spent close to 7 months putting out as much free valuable content as I could and was finally ready to start to monetize my personal brand.  The results that I saw when I opened the registration were nothing short of extraordinary.  I announced the registration on a live Persicope and by the time I was done 15 minutes later over 70 people had already registered!  Within 2 hours I had almost 200 people that had registered from that Periscope.  That was over $5,000 I brought in from a single Periscope.  All total, I had over 1,100 people pay for the live training which brought in $35,000.  On the webinar I offered my group coaching program and a special discount for all the attendees.  Within 24 hours I had brought in a total of over $112,000 in income from that single webinar.  Overnight my life literally changed from that happening.  I share with you some of the struggles I went through last year and how I was able to overcome them.  I give you the biggest lessons I've learned going through this process and hopefully inspire you to continue your journey to greatness.   </p>", "duration": "23:47", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_26.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1456183412, "title": "25: Understanding the 4 Personality Types", "author": "", "summary": "<p>In this episode I discuss the 4 personality types that you will encounter when dealing with prospects and the people on your team.  It is critical that you understand the differences between each so you can more effectively lead and motivate your people.  If you can identify what personality type a prospect is while you are presenting to them, it will also help you in being able to recruit more people into your business.  The 4 personality types we discuss in the training are:  sharks, whales, dolphins and urchins.  I go over in detail what each are, and the specific traits that each possess.  Most people have aspects of many of these, but one that is predominant.  I also give you some tips on how to communicate with each personality type to help you be able to influence them and become a better leader.  </p>", "duration": "22:55", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_25.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1455150288, "title": "24: The Marathon Mindset for Building Your Business", "author": "", "summary": "<p>In this episode I discuss what I refer to as the \"marathon mentality\" of building your business.  Success in network marketing or any other entrepreneurial venture is not a sprint, it's a marathon.  You need to have a long-term view when it comes to building a business.  In the training I use the analogy of you being the \"runner in the race\", and describe 3 fuel sources that you will need to finish the marathon.  As someone who has personally finished 4 full marathons in my life, I can tell you it's no easy feat.  Understanding these 3 sources of fuel are critical to you being able to finish the race, and cross the finish line of creating a massively successful business.    </p>", "duration": "14:52", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_24.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1454712892, "title": "23: Beware of the Valley of Death in Your Business", "author": "", "summary": "<p>In this episode I introduce to you a concept called the \"valley of death\".  This is the place where most network marketers businesses go to die.  After have shared a 3rd party tool to expose a prospect to your opportunity this is where you encounter the valley of death.  When you prospect is interested but has questions, it's critical that you DO NOT answer the questions.  I explain why that is and get you to understand the right way to handle prospects that have questions.  Understanding this concept is important if you want to become a better presenter and recruiter in your business.  </p>", "duration": "14:40", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_23.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1453841105, "title": "22: The Power and Importance of 3-Way Calls", "author": "", "summary": "<p>In this episode I teach you the power and importance that 3-way calls play in building a successful network marketing organization.  The 3-way call is one of the most powerful tools you have at your disposal when building your team.  If you can get your people to understand why these calls are important and they duplicate in your group, you won't believe the results they can help create.  One of the biggest mistakes I see people making is they try and do \"everything on their own\", and never use the power of an edified 3rd party expert to help them grow their team.  In the training I explain what 3-way calls are, the proper way to set them up and if you are a leader - the proper way to conduct one.  For many of you, this will be a life changing training when it comes to growing your team.  In the episode I make mention of my upcoming group coaching program the Breakthrough Academy.  If you are interested in learning more you can go to:  <a href=\"http://www.BreakthroughAcademy2016.com\">www.BreakthroughAcademy2016.com</a> </p>", "duration": "22:25", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_22.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1452685589, "title": "21: The Slight Edge Philosophy", "author": "", "summary": "<p>In this episode I share with you the key message from a book I read a few years ago called 'The Slight Edge' by Jeff Olson.  I have never read a book that had a more positive impact on my personal and professional life.  The message in the training today is what you need to understand if you want to make your New Years resolutions actually stick.  The Slight Edge Philosophy applies to every single area of your life.  It's always working whether or not you realize.  It says that in every moment of every day we are making decisions that over time have dramatic effects on the results we see.  We are either practicing simple daily disciplines or making simple errors in judgements.  Over time these small seemingly insignificant decisions compound to create the results we see in our lives.  If you are not familiar with The Slight Edge, I promise you this may be one of the most powerful trainings you'll ever hear.  Make sure to go pick up a copy of the book.  </p>", "duration": "30:37", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_21.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1452040928, "title": "20: Overcoming Your Fear of Failure - Go for No!", "author": "", "summary": "<p>In this episode I discuss the key points from a book I read that changed my life, Go For No!  If you have ever struggled with taking action because of a fear of failure, messing up or rejection then this is going to be an incredibly important training for you.  The book has a simple, but very powerful message.  It teaches you to look at failure a different way and I promise you when you're done listening to this episode you will be running to pick up the book.  </p>", "duration": "17:40", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_20.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1450049245, "title": "19: The 'Hot Market' Approach to Customer Acquisition", "author": "", "summary": "<p>In this episode I go over the 'Hot Market' approach to building your business.  The 'Hot Market' approach can be an incredibly powerful way to increase your production and grow the overall volume in your group.  It acknowledges the fact that most people in network marketing are not \"sales types\", and that most of the people you approach are going to be more likely to be a customer than they are a business partner.  It's designed to help a new person who purchases a high dollar starter pack, to move their product and earn a profit within their first 72 hours of starting.  If you can teach this approach and it duplicates in your team it can create incredible momentum.  </p>", "duration": "27:02", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_19.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1449151088, "title": "18: My Morning Routine", "author": "", "summary": "<p>In this episode I go through in detail what I do every morning to start my day.  In my study of ultra-successful people I found one thing most of them had in common.  They had a clearly defined process for starting out their day that usually started early in the morning.  About 4 months ago I read a book that I would highly recommend called \"The Miracle Morning\" by Hal Elrod that changed my life.  I began to implement much of what I learned in the book and the results I've seen since then have been unreal.  I go through in detail everything that I do and some of the lessons that I've learned since beginning this process.  I'm sure many of you will get some great ideas for you to implement into your morning routine.  </p>", "duration": "30:02", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_18.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1448827407, "title": "17: My Interview with MLM Nation Founder Simon Chan", "author": "", "summary": "<p>In this episode I interview top industry trainer and the founder and host of the #1 network marketing podcast in the world, Simon Chan.  Simon has an incredibly inspirational story and is a perfect example of what focusing on building your personal brand can do for your business.  In the first half of the interview Simon shares his story of how he came to be introduced to network marketing and talks about the things he learned along the way to make him successful.  In the second half of the interview he really goes into detail how the decision he made to stop promoting his network marketing company and begin to promote himself changed his business and life forever. He give some very valuable advice to anyone starting out down the path of building a brand for themselves.  He also discusses how he decided to start the MLM Nation podcast and gives you 3 common characteristics he sees in all the top earners he interviews for his show.  This is an episode you can't afford to miss!  </p>", "duration": "56:53", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_17.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1447885412, "title": "16: Stop Trying to Sell on Facebook", "author": "", "summary": "<p>In this episode we tackle an issue that I know is a controversial one for many network marketers.  Whether or not you should be \"selling\" your particular company's opportunity, products and services on Facebook.  Facebook has become inundated with network marketers promoting their \"stuff\".  I tackle the very important question of whether or not this is good for their business and network marketing as a whole.  I introduce one of the most important concepts I've ever learned when it comes to marketing, \"learn to create curiosity instead of raising resistance\".  I use the analogy of your Facebook page being like your personal TV channel.  If all you are doing is posting about your specific company, you are really nothing more than an infomercial.  I believe this is an episode that every single person that is in network marketing needs to listen to and really understand.  If you or anyone on your team flooding your news feed with company specific content all the time then make sure they listen to this episode.  </p>", "duration": "27:41", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_16.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1447442643, "title": "15: How to Confront the People on your Team", "author": "", "summary": "<p>In this episode we discuss an issue that I know a lot of people in network marketing struggle with.  We go over different scenarios where you may need to confront people that are on your team.  It could be because they aren't doing anything and you want to try to understand why, or maybe they're doing some of the wrong things that could be detrimental to their business and the team.  One of the most important aspects of character in life without question is the ability to confront.  As a leader it's your responsibility to learn to confront people when these issues occur.  When you are willing to confront, it strengthens relationships with people because it shows them that you actually care.  Confrontation doesn't have to be adversarial when done the right way. Here is one of the key takeaways of the training, learn how to \"go hard on the issue but soft on the person\".  Confront the issue but do it in a way that preserves the relationship.  In the training I'll go over different examples of when you may need to confront, and give you specific things to say.  When you are willing to take this responsibility on, and confront the people on your team they will start to look at you as a leader on an entirely different level.     </p>", "duration": "27:35", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_15.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1447194009, "title": "14: How I Built my own 7-Figure Personal Brand with Ray Higdon", "author": "", "summary": "<p>In this episode I welcome a very special guest, Ray Hidgon.  Ray has an incredibly inspirational story of going from dead-broke, over a million dollars in debt in 2008, to today having built three separate 7-figure businesses.  After failing in 11 different network marketing companies, he finally broke through and became a million dollar earner in the profession.  Ray realized early on the value of building a personal brand and started his very own generic network marketing training website just over 5 years ago.  He committed to putting out valuable content every single day and after a few years became known as one of the top authorities when it comes to network marketing. He took that experience and hard work and launched both a private coaching business as well as an info-product business, selling online courses and physical products on his website.  Today, each of those business are now multiple 7-figure businesses outside of his network marketing income.  Earlier this year he had a single product launch that did almost $850,000 in sales.  If you are looking to improve as a network marketing professional or someone who wants to build their own personal brand this is an interview you can't miss.  Ray and I discuss how he was able to build his personal brand and give specific recommendations and tips to anyone just starting out down that path.  This is by far one of the best episodes of the Your Virtual Upline Podcast to date.       </p>", "duration": "48:20", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_14.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1446923005, "title": "12: The Power of Authentic Leadership", "author": "", "summary": "<p>In this episode we discuss the subject of 'Authentic Leadership'.  Authentic leadership is an approach to leadership that emphasizes building legitimacy through honest relationships with followers.  In the network marketing profession many leaders are never able to develop the type of following they want and truly inspire people because they don't understand this concept.  Truly great leaders are vulnerable and transparent when it comes to their past failures and disappointments.  When a leader is honest and transparent it facilitates trust with the people that are following them.  People need to see that you're not perfect, that you're like them.  There is a fine line that many people step over when being vulnerable and willing to share past hurts.  Often times, people read that as being able to be negative or complain to the people that are following them. This is a HUGE mistake that people make.  One of the biggest lessons I've learned in this profession is that you can NEVER be negative or complain to the people on your team.  I introduce you to a concept that has been so impactful to me, \"pass negatives up and positives down\".  My goal is that when you're finished listening to this training, you'll be in a better position to lead people and inspire them to take action.  I want you to be the type of leader that can inspire and make a difference in the lives of others all over the world.  That is one of the greatest gifts the network marketing profession gives us all.  </p>", "duration": "21:04", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_12.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1446856193, "title": "13: How Videos can Help You Create Your own Celebrity Brand", "author": "", "summary": "<p>In this episode I welcome a very special guest, personal branding and social media expert Nadya Melton.  Nadya is one of the top authorities on using videos to help you build what she calls your own \"Celebrity Brand\".  Nadya is a good personal friend and has been one of the biggest mentors to me personally in helping me launching my own brand.  If you have EVER wanted to start using videos to help you grow your home business faster than she is the one to learn from.  Her and her husband John have been six figure earners in the network marketing profession for the last 10 years.  They started to grow frustrated from the daily \"grind\" of building a traditional network marketing business and knew there had to be a better way.  It was then that they decided to embrace the world of online marketing and saw social media as an incredibly powerful way to generate leads and leverage their time.  One of their biggest motivators was to be able to truly \"work from home\" and build a business that would allow them to spend more time with their two children.  They have created 2 very successful online courses teaching people how to brand themselves, generate leads using social media and grow a home business.  Nadya has a very popular blog <a href=\"http://www.nadyamelton.com\">www.nadyamelton.com</a> and her and John have a private mastermind group on Facebook,  My Lifestyle Academy with over 5,000 members.  If you are looking to start doing videos or just want to improve what you are already doing, then I know you find this episode incredibly valuable.    </p>", "duration": "49:36", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_13.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1446506419, "title": "11: Start Treating Your Business Like a Job", "author": "", "summary": "<p>In this episode we will discuss the benefits that come from when you start to treat your network marketing business like it's your job.  When most people join this profession it's the first time in their lives that they have ever been in the situation to be their own boss.  What they find out pretty quickly is that they are actually terrible bosses.  Most people are used to having someone to tell them what to do and hold them accountable for their results.  In the network marketing profession that doesn't exist.  It is one of the biggest reasons why people fail.  In this training I'll explain exactly what I mean.  I'll share with you the biggest areas where we fail ourselves as bosses and how it kills our business.  I'll finish by giving you 4 specific areas you can begin to focus on today to help you start creating better results.  </p>", "duration": "28:21", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_11.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1446408432, "title": "10: Start Talking Less and Recruiting More", "author": "", "summary": "<p>In this episode I explain that if you can learn how to start talking less, you will actually begin to recruit more people into your business.  One of the hardest things for me to learn early on in my network marketing career was to resist the urge to personally explain everything and answer questions for prospects.  A very valuable less to learn is this, \"The less YOU say, the more money you will make.\"  I go over exactly what that means and break the exposure process down piece by piece and explain your role.  I'll introduce the concept of acting as a \"consultant\" when dealing with prospects and how that can dramatically improve your results.  I'll give you specific tips on helping you become better at prospecting and presenting.  I'll also go over the biggest mistake I see people making that keeps them from being a great closer.  When you're done this training I promise you that you'll never look at the recruiting process the same again!</p>", "duration": "24:01", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_10.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1446162401, "title": "09: How to Get a New Rep Started the Right Way", "author": "", "summary": "<p>In this episode I go over the right way to help a new rep get started and launch their business.  Having a simple, defined process for getting new people started is the key to creating duplication.  People spend so much time and effort trying to recruit people and then once they sign up, never get that new person started the right way.  You need to think of this process as your new person's orientation to the business.  When done properly, this will make the new person feel more confident and excited about the business.  I will give you 5 specific elements that should be a part of this process that you can start immediately implementing in your team.  Follow this game plan that I lay out in the episode and you will see far less people quit and fail and create massive momentum in your business.            </p>", "duration": "26:47", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_9.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1445648289, "title": "08: How to Approach People That Have Already Told You No", "author": "", "summary": "<p>In this episode I go over how to recontact the people on your list that have already told you no.  A huge mistake many people make is never following up with the people that weren't initially interested.  The biggest lesson I've learned is that when people tell you 'no', what they're really saying is just 'not now'.  Their situations change over time and that's why it's critical to have a strategy to be regularly following up with the people you know.  I will give you 4 different approaches you can use when reconnecting with these people.  I'll also share with you an amazing app that I use to help track these follow-ups.  By the time this training is over, you will be ready to start contacting people today and put together a strategy that will help you never miss an opportunity ever again!  </p>", "duration": "28:31", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_8.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1445639233, "title": "07: The Importance of 'A Players' to Your Business", "author": "", "summary": "<p>In this episode I introduce the concept of an 'A Player'.  I explain how most people in network marketing struggle because they spend their time prospecting and working with the wrong people.  'A Players' are the most successful and influential people that you know.  They are the ones that usually fall on your \"chicken list\".  In this training, I give you some strategies and exact scripts that you can use to begin to recruit the right kind of people into your business.  When you elevate the level of people that you approach, you start to see dramatically different results.  I'll also give you a strategy to get over the fear you are experiencing now that is keeping you from reaching out to the successful people you know.  This is a MUST listen to training for anyone on your team.</p>", "duration": "33:13", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_7.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1444949675, "title": "06: 3 Simple but Powerful Phrases that will INSTANTLY Make You a Better Recruiter", "author": "", "summary": "<p>In this episode I will give you 3 simple but incredibly powerful phrases that will help you INSTANTLY create better results in your business.  I explain how mastering the invitation process allows you to increase the amount of exposures you are able to create which will in turn help you create better results.  I explain the biggest mistake I see people making when it comes to the invite and give you some tips to help you master this skill.  These 3 phrases are simple to learn, easy to use and will absolutely help you recruit more people into your business.  Enjoy!</p>", "duration": "27:54", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_6.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1444868197, "title": "05: The Key to Unlocking Long-Term Residual Income in Your Business", "author": "", "summary": "<p>In today's episode I discuss what in my mind is the absolute \"key\" to you unlocking long-term residual income in your network marketing business - CUSTOMERS.  We are going to talk about the importance and necessity of customer acquisition to creating sustainable \"walk away\" residual income.  It's the greatest gift that the network marketing profession offers to those that are involved.  The problem however, is that for many people it remains nothing more than an unfulfilled promise.  Many companies have failed to deliver on what they promise to their distributors.  In my opinion, one of the biggest reasons that this happens is that many of the behaviors that are being taught are not conducive to creating residual income.  There's been shift in many companies to focusing almost 100% on recruiting.  There's no emphasis on customer acquisition or product training and their compensation plans don't really reward that behavior.  There is however, a movement that is happening now back to more of a focus on the value of the customer.  In this training I discuss what this means to all of you and your business.  I give you some strategies and tips that you can start implementing in your business and on your team to help you build a massive customer base so you can create that residual income that you've always dreamed about.             </p>", "duration": "29:36", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/05.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1444344416, "title": "04: How to Become a Great Presenter and Conquer Your Fear of Public Speaking", "author": "", "summary": "<p>Do you want to conquer your fear of public speaking and learn how to become a great presenter?  If you want to become a top earner in your company you HAVE to learn how to present.  In this episode I give you a detailed step-by-step plan to help you master how to give the following types of presentations:  your personal story, your company's opportunity presentation, basic / quick-start training and inspirational training.  I'll teach you all of the \"tricks\" that I've learned to help me master public speaking and presenting.  Public speaking has always been one of my greatest fears most of my life.  Actually forcing myself to give my first presentation was one of the hardest and scariest things I've ever done.  However, the moment I gave my first presentation my business changed forever.  I will share with you the top 5 tips I've learned over the last 10 years that will help you not become a good, but a GREAT presenter.  I'll help you get over your fears or whatever is holding you back so you can experience a true breakthrough in your business and your life.  For many of you, this will be one of the most important trainings of your life.       </p>", "duration": "31:56", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/Episode_4.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1443738734, "title": "03: How To Not Suck At Cold Market Recruiting", "author": "", "summary": "<p>In this episode you will learn how to master cold market recruiting and generate an endless amount of leads for your business.  I give you strategies for Facebook, LinkedIn and face to face prospecting.  </p>", "duration": "36:44", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/03.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1443721532, "title": "02: Stop Promoting Your Company And Start Promoting Yourself", "author": "", "summary": "<p>In this episode I discuss how personal branding can help you create results in your business far beyond anything you've ever experienced before.   </p>", "duration": "46:42", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/02.mp3?dest-id=311387", "type": "episode", "tags": []}, {"seriesId": 1046138184, "seriesTitle": "Your Virtual Upline Podcast:  Personal Branding | Network Marketing | Online Marketing", "pubDate": 1443721262, "title": "01: My Personal Story", "author": "", "summary": "<p>Are you ready to take your network marketing business to the next level?  In the first episode of the Your Virtual Upline Podcast I share my own personal story.  Hopefully it inspires you to stop living small and start earning big!</p>", "duration": "20:43", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music62/v4/e4/a6/fa/e4a6fa6f-b6f3-40f6-dabb-e5051c708b4c/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/bobheilig/01.mp3?dest-id=311387", "type": "episode", "tags": []}]}