{"series": {"feedUrl": "http://www.spreaker.com/show/1707708/episodes/feed", "genres": ["Design", "Podcasts", "Arts", "Business", "Health", "Self-Help", "Careers"], "title": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "country": "USA", "author": "Majo Molfino", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "type": "series", "id": 1100949693}, "episodes": [{"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1488459625, "title": "Creative Revival {Debbie Millman}", "author": "Heroine", "summary": "Debbie Millman is a writer, educator, artist, brand consultant, and host of the radio show Design Matters (the world’s first podcast about design). In this episode, she shares her wisdom on dealing with criticism, what to do when you’re in an ‘inner critic storm’, and how to funnel your energy towards your one non-negotiable.\n\nShe and Majo also discuss Debbie’s darker childhood days, facing rejection in her twenties, and achieving great success in her thirties as a brand consultant. More recently, she realized a connection to her true creative spirit was missing and that she needed to circle back to it. As a creative woman now in her fifties, Debbie’s wisdom and words of encouragement strike a powerful chord. \n\nShow Notes:\n-Debbie opens up about her difficult childhood, touches on her coming-of-age years, and shares how she was recently astounded by a picture of herself from when she was two. [5:01]\n-The evolution of her creative expression: From making perfumes and writing bad poems as a girl to editing newspapers and magazines in college. Plus, how her twenties came to be dubbed “experiments in rejection and failure”. [10:45]\n-On rejection and feedback, the idea of the “good girl myth”, and the parts of herself she disregarded in order to please her inner misogynist. [15:28]\n-Debbie talks about her success as a branding consultant, circling back to her creative roots, and how it’s taken a long time to feel comfortable in her own skin. [20:56]\n-On getting bullied by a design blog, taking responsibility for our choices, and achieving your one non-negotiable. [25:16]\n-“Well-behaved women seldom make history.” Debbie offers advice on making things happen for yourself. [32:27]\n-How Debbie deals with criticism and feedback today. [37:08]\n-Debbie and Majo discuss an issue many women grapple with, and how they each are working to overcome it. [43:11]\n\n\nReferences:\nDebbie's website: http://debbiemillman.com/\n\nEpisode Sponsors:\nAdobe Creative Residency – http://adobe.com/go/creativeresidency \nUENO – https://ueno.co/careers\n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2877", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/11289714/final_millman_full.mp3", "type": "episode", "tags": ["creativity", "artist", "design", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1487854828, "title": "Redefining Success {Grace Bonney}", "author": "Heroine", "summary": "Grace Bonney started the blog Design*Sponge many years ago, and today it’s one of the most trusted places online to go for creative inspiration. Her journey has had several points of big changes, like when she decided to pursue her blog full-time, when she came out as gay, and when she was diagnosed with diabetes. She’s an excellent example of how we sometimes must cycle through the heroine’s journey more than once.\n\nGrace is also the author of the recently released book, In the Company of Women: Inspiration and Advice from over 100 Makers, Artists, and Entrepreneurs, and shares Heroine’s mission to support and empower creative women from all walks of life. \n\nIn this episode, you’ll learn the mistakes Grace has made in order to grow, and the lessons she’s learned as her business has evolved. \n\nShow Notes:\n-Grace growing up: A quiet and shy girl who struggled to feel like her natural self was accepted. [4:17]\n-Transferring to a small liberal arts college after feeling like NYU was too big for her, and how that shifted her path for the better. [10:22]\n-Dealing with pushback and criticism, coming out at thirty, and the importance of transparency. [14:30]\n-On her early career, the evolution of Design*Sponge, and some deeply-seated patriarchal beliefs that she had to unlearn in order to lead. [21:08]\n-Majo and Grace discuss misconceptions about women, like the false sense of competition, and Grace shares how a lot of her growth has come from making mistakes. [27:24]\n-On setting boundaries and letting go of guilt, redefining herself and her business, and the aftermath of being diagnosed with diabetes. [34:11]\n-Defining success in your own way: Grace shares what a successful day looks like for her. [40:12]\n-Digging into her book, In The Company of Women. Grace reveals the huge myth that almost every women she interviewed had learned to let go of. [44:19]\n-Discussing some of the most important messages to women in Grace’s book, including the encouragement to take up more space. [50:17]\n\nReferences:\nhttp://www.designsponge.com/\nhttp://www.designsponge.com/book\nhttp://www.thehivery.com\n\nEpisode Sponsors:\nInVision – https://www.invisionapp.com/company\nAdobe Creative Residency – http://adobe.com/go/creativeresidency\n\n Music by Lucia Lilikoi – lucia.bandcamp.com", "duration": "3456", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/11041448/grace_bonney_episode.mp3", "type": "episode", "tags": ["women", "inspiration", "design", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1487250054, "title": "Drop the Ball {Tiffany Dufu}", "author": "Heroine", "summary": "Are you a fixer who loves taking responsibility and caring for others, but feel like you have too much on your plate? You’re not alone. Today’s episode features Tiffany Dufu, Chief Leadership Officer at Levo League and author of the new book Drop the Ball – a must-read for all of us trying to do everything ourselves and struggling to embrace imperfection. \n\nTiffany’s gems of wisdom include the value of delegating with joy, a concept she calls “strategic chaos”, and the three attributes to look for in a partner before you build a life with them. She also talks about motherhood as the last frontier of dropping the ball.\n\nShow Notes:\n-Tiffany growing up: An imaginative “good girl” who experienced early on a sense of injustice that sparked a feminist spirit. [5:25]\n-Trying to be valued and liked in her teenage years, plus the benefit of experiencing failure at a young age. [9:59]\n-College years, realizing she had more options than she’d been shooting for, and how she got into the nonprofit world. [15:11]\n-On the specialness of millennials and the powerful meaning behind the title of her book. [20:33]\n-How Tiffany and her husband fell into default mode when it came to the division of domestic labor – and what they did when that didn’t work. [25:10]\n-How to delegate tasks in a meaningful way and other essential tips for busy women. [31:39]\n-Learning to live with chaos: An incredibly amusing story that resulted in restored balance at home. [36:49]\n-Exploring our social conditioning as women, and how to stay focused on what matters most. [42:40]\n-Tiffany shares why motherhood is the final frontier in “dropping the ball”, plus the three attributes any partner of yours should have. [45:30]\n-On our relationships with our mothers, having a greater sense of service, and Tiffany’s final thoughts. [51:52]\n\nReferences:\nCheck out Tiffany’s website and find her new book, available now, at http://tiffanydufu.com/\n\nEpisode Sponsors:\nUENO – https://ueno.co/careers\nAdobe Creative Residency – http://adobe.com/go/creativeresidency \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "3544", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10832906/tiffany_dufu_full_episode.mp3", "type": "episode", "tags": ["women", "lifestyle", "inspiration", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1486645239, "title": "Design for Good {Patrice Martin}", "author": "Heroine", "summary": "Design is powerful magic – It can help solve some of the world’s most urgent, critical problems. Patrice Martin is co-founder of IDEO.org, an organization that works to improve the lives of people in poor and vulnerable communities through design.\n\nPatrice shares about her past struggles to be taken seriously as a petite woman, what she’s observed as a difference in creative confidence between men and women, and some of the incredible projects her team is focused on. Her conversation with Majo is living proof that design, when done well, can change the world.\n\nShow Notes:\n-Patrice shares a funny childhood story about persistence that anticipated one of her strongest personality traits as an adult. [5:05]\n-High school years: Finding her identity in art. [7:36]\n-Thinking of technology as a medium to create experiences, plus other formative experiences during college. [10:56]\n-Patrice’s experience at IDEO – applying a design lens to complicated questions and issues. [17:55]\n-Her transition to IDEO.org, the organization she co-founded that focuses on social impact and poverty. [21:46]\n-What she’s learned as a leader, how to set up an environment where people thrive, and her spot-on insights on the difference in creative confidence between men and women.  [26:30]\n-Designing for good: Some of the exciting projects Patrice and her team are focused on. [34:01] \n-On the importance of being part of a community of mothers who are figuring out the work-life balance together. [43:35]\n-Patrice’s final words of wisdom and advice. [52:47] \n\nReferences:\nhttp://www.ideo.org/\n\nEpisode Sponsors:\nAdobe Creative Residency – http://adobe.com/go/creativeresidency\nInVision – https://www.invisionapp.com/company\n \nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "3424", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10636296/patrice_martin_full_episode.mp3", "type": "episode", "tags": ["women", "inspiration", "design", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1486040438, "title": "Discipline & Faith {Alana Nichols}", "author": "Heroine", "summary": "This interview had our host in tears. In today’s episode, Majo speaks with Paralympic Gold Medalist Alana Nichols. Playing sports was like a safe haven for Alana, whose family life wasn’t always ideal. But at 17, she broke her back in a snowboarding accident that left her unable to walk again. As a lifelong athlete, this was devastating.\n\nAlana grappled with denial, depression, and isolation in college, until a magical moment turned everything around. Her story is about the power of practice, discipline, grit, and faith. And she shares powerful insights on gratitude – seeing what we have instead of what we don’t have. \n\nShow Notes:\n-Growing up as a confident, active tomboy who found her identity in sports at a young age. [4:13]\n-On always being a risk-taker and her dreams of playing Olympic Softball. [8:46]\n-Coming into her identity as a young teen, dealing with social pressures, and missing the presence of a mother who wasn’t able to be there for her. [13:48]\n-Playing sports in high school, being approached by colleges offering scholarships, and the accident that brought everything to a halt. [17:04]\n-Reflecting on that critical moment in her journey when everything changed, and her initial denial of it all. [22:18]\n-The hard transition Alana faced upon returning home after rehab. [30:05]\n-How taking a chance shortcut led to Alana’s magical moment when she was at her lowest point. [35:25]\n-Mourning her loss with grace, moving forward, and developing a new dream. [38:47] \n-Alana’s journey to the Paralympics and beyond, her insights on risk-taking, and final words of wisdom. [45:23]\n\nReferences: \nhttp://www.alanajanenichols.com/\n\nEpisode Sponsors:\nInVision – https://www.invisionapp.com/company\nAdobe Creative Residency – http://adobe.com/go/creativeresidency \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "3196", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10462047/alana_nichols_episode.mp3", "type": "episode", "tags": ["inspiration", "leadership", "wisdom", "paralympics", "paralympian"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1485439835, "title": "Victim to Queen {Justine Musk}", "author": "Heroine", "summary": "In today’s episode, we speak with with writer, speaker, and soul-blogger Justine Musk, who has long been exploring the heroine’s journey in her work. She’s bold, honest, raw, and her story is an uncanny fit of the heroine’s arc. \n\nJustine found her true voice and power as a creative leader after rising up from her own personal underworld. She shares how we can look to myths for guidance and offers advice for putting yourself out there. Her insights on our relationship to emotions, what she calls “non-predatory” power and leadership, and why saying 'no' is so important as a woman will blow you away. \n\nShow Notes:\n-Justine’s early years: A small town, bookish girl who couldn’t wait to grow up. Early influences, teenage awkwardness, and learning to stand up for herself. [4:30]\n-Coming into her own in her college years, wondering where she belonged, plus her awareness of the disconnect between how people were perceiving her and how she perceived herself. [9:14]\n-The story of goddess Persephone and why Justine connects so strongly with her. [12:52]\n-The benefit in connecting to myth, “post-traumatic growth”, and Justine’s insights on dealing with pain. [18:33]\n-How Justine emerged stronger and more empowered after descending to her lowest point. [22:43]\n-Justine’s advice for putting yourself out there, plus why it’s important for women to be unconventional. [27:02]\n-Taking a closer look at feminine authority and leadership, and the power of saying ‘no’. [32:23]\n-On women’s relationship to emotions and feelings (especially in the workplace). [35:54]\n-Justine shares her excitement for an issue she’s exploring and what she’s working on now. [39:05]\n\nReferences:\nCheck out Justine's blog at http://justinemusk.com/\n\nEpisode Sponsors:\nUENO – https://ueno.co/careers\nAdobe Creative Residency – http://adobe.com/go/creativeresidency \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2580", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10391147/justine_musk_fix.mp3", "type": "episode", "tags": ["creativity", "inspiration", "writing", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1484830847, "title": "Are you an \"artist\"? {Lisa Congdon}", "author": "Heroine", "summary": "Ever get the feeling that it’s too late to do what you love? In this episode, even our host admits to feeling that way sometimes, thinking it’s “too late” because she's already thirty. But thirty is around the magical time that artist and illustrator Lisa Congdon had her artistic revival. After working many years in education, she felt like a part of her wasn’t being fed. On a fluke she took an art class with her brother, and the experience changed her life. \n\nLisa is best known for her colorful abstract paintings, intricate line drawings, pattern design and hand lettering, as well as her work as an author. She and Majo cover some topics Lisa hasn’t shared on a podcast before, including the unsexy parts of her work and challenges she still grapples with, and discuss why some women can be so afraid to step into their creative power.\n\nShow Notes:\n-Lisa’s early years: A young girl eager to please and figure out her place, her awkward teenage years, and the layers of self-doubt and insecurity she had to shed. [4:34]\n-“Is this really what I want to be doing?” Lisa’s insights on her early career and the creative outlet she sought to feel “fed”. [10:58]\n-The fluke that triggered her creativity and path to becoming an artist. [15:02]\n-On deserving to be a creative, exploring loneliness, and opening oneself up to the world. [18:34]\n-Some of the internal challenges Lisa faced, including thinking of herself as a victim. [24:41]\n-Lisa’s advice to Majo on coming out of the creative closet. [28:46]\n-What defines an artist? Plus, conflicting thoughts on sharing your work via social media. [33:33]\n-The unsexy parts of Lisa’s world as an artist. [37:24]\n-Still “in process”: Lisa shares things she’s never discussed on a podcast before, including her plans to connect her work with activism and some of the vulnerabilities she grapples with. [42:51]\n\nReferences:\nMore on Lisa at http://lisacongdon.com/\n\nEpisode Sponsors:\nUENO – https://ueno.co/careers\nAdobe Creative Residency – http://adobe.com/go/creativeresidency \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2847", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10340529/fixed_2_lisa_congdon_mixdown.mp3", "type": "episode", "tags": ["creativity", "artist", "inspiration", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1483621200, "title": "Bonus: Elle Luna", "author": "Heroine", "summary": "Starring in this bonus episode is returning guest, Elle Luna. Majo hosts a Q&amp;A with the author and artist, who drops deep, timely wisdom that will help you reflect for the new year. \n\nElle shares her profound perspective on the difference between 'should' and 'must', and why it's so important to be aware of our 'should's as women. She is an activator and a catalyst who will get your heart stirring and your mind bubbling with ideas. \n\nReferences:\nThe Crossroads of Should and Must by Elle Luna\nLearn more about Elle at http://elleluna.com/ \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2035", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10241648/elle_episode.mp3", "type": "episode", "tags": ["creativity", "women", "inspiration", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1483016458, "title": "Quick Update", "author": "Heroine", "summary": "A quick update from Majo during the break — including a preview into next year's interview lineup. \n\nHappy Holidays!", "duration": "101", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10191503/mid_holiday_announcement.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1482411642, "title": "Bonus: Ayla Nereo", "author": "Heroine", "summary": "In this bonus episode, Majo hosts a Q&amp;A with musician and environmental activist Ayla Nereo. Ayla is an incredible soul with an uncanny ability to listen to her surroundings and channel the inspiration she hears into musical form. \n\nAyla shares insights on some meaningful topics, like the importance of listening, being vulnerable, and how we all possess a unique puzzle piece to the bigger picture of our world. Her advice is timely and will inspire you to speak up and share your own creative gifts. \n\nReferences:\nLearn more about Ayla at http://aylanereo.com/ \n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "1091", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10150261/ayla_episode_final.mp3", "type": "episode", "tags": ["music", "creativity", "leadership", "wisdom", "nature"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1481202021, "title": "Transition & Learning {Jesse Genet}", "author": "Heroine", "summary": "How many fifteen-year-olds do you know have a mid-life crisis and stop to ask themselves, What really matters in life? Jesse Genet was one of them, and today she’s the Designer, Founder, and CEO of Lumi, a company that lets you easily brand your own packaging. Her journey to entrepreneurship started in high school – she basically petitioned herself out of her senior year and drove across the country to L.A. with nothing but a dream and her 1969 Lincoln convertible.\n\nJesse is a perfect example of a perpetual learner, constantly putting herself in uncomfortable situations in order to grow. She offers great counterintuitive advice to women who are seeking to be more creative and take more risks, and as a bonus, she’s straight up hilarious.  \n\nShow Notes:\n-Jesse Genet growing up – a serious girl who wanted to be taken seriously. [3:32]\n-Going through life phases early and fast, plus the turning point for her creativity. [7:32]\n-How Jesse deftly figured out a way to leave high school early, and other evidence of an independent spirit. [13:24]\n-On the benefits of being flexible, and choosing to view life with an opportunistic lens. [19:12]\n-“I always wanted to level up.” On constantly putting herself in uncomfortable situations in order to learn and grow. [21:34]\n-From a low year of being lonely and poor to creating a new path for herself. [27:21]\n-The ups and downs of being a CEO, plus Jesse’s insights on developing new skills. [34:18]\n-Jesse shares about her inner critic and offers advice to other women who want to be creative leaders and take more risks. [39:55]\n\nReferences:\nMore on Jesse at http://jessegenet.com/\nLumi website – https://www.lumi.com/\n\nEpisode Sponsors:\nUENO – ueno.co/careers\nInVision – invisionapp.com/company\n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2932", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10061645/jesse_genet_fix.mp3", "type": "episode", "tags": ["creativity", "inspiration", "leadership", "wisdom", "entrepreneurship"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1480597246, "title": "Designing Rituals (6/6)", "author": "Heroine", "summary": "You are human. You make mistakes. You aren’t perfect and you certainly aren’t a machine. We all know this, and yet so many of us hold ourselves to idealized standards of very disciplined people with high willpower. In a perfect world, maybe we’d actually be like that. But the truth is that even after you design your ritual and test it out, eventually it will morph, lessen, or decay altogether. This is completely natural.\n\nWe have to design for the maintenance of our rituals as much as the creation of them. In this flash wisdom episode, host Majo talks to us about the importance of self-compassion and shares three things that have helped her develop a “reset” mindset when rituals fall to the wayside.\n\nShow Notes:\n-Check out and pre-order the new ebook: The Magical Effects of Morning and Evening Rituals, shipping on December 8 – plenty of time to order as a Christmas gift! Find it at mariamolfino.com/rituals and use the code “heroine” to get $10 off.\n\n-Music by Lucia Lilikoi at lucia.bandcamp.com\n\nReferences:\n-You can read through the steps & resources outlined in this episode and the others in this series at mariamolfino.com/blog. Scroll down to the Rituals category.\n\n-If you’re a woman in the SFBA interested in joining my women’s group, let me know at mariamolfino.com/group.\n\nSome of the incredible supporters of Heroine – Check them out!\n-Brigit Kang (http://beauteparler.com/): Brigit is a SF-based designer with a great eye for beauty who is now focusing on weddings. \n\n-Coleen Baik (http://coleenbaik.com/): Coleen is an independent designer and artist who has worked with legends like Gloria Steinham and whose art has explored the heroine’s journey. \n\n-Daniel Steinbock (http://danielsteinbock.com/): Daniel is an incredible musician and philosopher with a beautiful mind. His album, The Blade, is to die for.\n\n-Greyson MacAlpine (http://greysonmacalpine.dribbble.com/): Greyson a very supportive product designer at UENO, our lead sponsor who you know is always looking to hire designers at https://ueno.co/.\n\n-Kelsey Janda (http://kelseyjanda.com/): Kelsey is a very talented designer in the Midwest whom I recently bonded with. Her work is very cool and interesting, so for the designers listening, check out her work. \n\n-Mamie Rheingold (http://beta.onuniverse.com/): Mamie is an amazing legend who is developing the coolest app called Universe that allows you to unleash your creativity and basically make whatever you want with an app. \n\n-Meredith Rom (http://www.risingwomenleaders.com/): Meredith has her own podcast called Rising Women Leaders. If you’re into feminine spirituality, you’ll want to check her out. \n\n-Laura Porcelli (http://lauraporcelli.com/): Laura is my aunt and a very talented artist. She’s freaking dope and so is her work. \n\n-Rhiannon Griego (http://www.ghostdancercollection.com/): Rhiannon is a soul-sister and a really incredible textile artist. She makes woven garments, beaded jewelry...I wore a pair of her earrings to my wedding. Her love for beauty and for our planet is really felt in her work.", "duration": "910", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/10008976/rituals_6_final_final_1.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1479906022, "title": "Art & Service {Lynsey Addario}", "author": "Heroine", "summary": "A woman in complete service to what she does, who is even willing to die for her work, definitely fits the archetype of the heroine. Lynsey Addario is a photojournalist who has photographed women under the Taliban, documented misogyny in the Congo, and been on the ground in Afghanistan after 9/11. From capturing the lives of transgender prostitutes in New York to her continued work on Syrian refugees and those displaced by war, Lynsey seeks to do justice for her subjects by capturing the true essence of their humanity.  \n\nLynsey is also a New York Times bestselling author. Her memoir, It’s What I Do: A Photographer’s Life of Love and War, is so filled with vivid details and vulnerability, including her very close call as a hostage in Libya, that Steven Spielberg will soon be directing a movie based on her life starring Jennifer Lawrence. Lynsey’s spirit and drive will inspire you to recognize the unique impulses and passions we all have inside of us. \n\nShow Notes:\n-Growing up with parents who encouraged her to express herself, follow her dreams, and learn things for herself. [4:19]\n-Receiving her first camera, becoming a self-taught photographer, and breaking into the business (which involved sneaking a shot of Madonna). [8:10]\n-How Lynsey found her calling early on, and the inspiring purpose that drives her. [12:53]\n-How she furthered her career by asking for an advance on the wedding she didn’t intend to have. [15:31]\n-Bringing milk and cookies to transgender prostitutes: Lynsey’s method of getting to know people before photographing them. [17:20]\n-Going to Afghanistan as an unmarried, American female photographer during a time when photography was outlawed by the Taliban. [22:07]\n-The unique barriers (and dangers) of being a woman photojournalist. [25:43]\n-The brutal week she spent as a hostage in Libya: Being groped and assaulted and constantly threatened with execution. [28:56]\n-Deciding to have a child after surviving the ordeal in Libya, plus Lynsey’s thoughts on living a “dual life”. [34:19]\n-“This job is not about me, it’s about the people I cover.” Lynsey shares how she’s able to continue her work despite the trauma and violence she’s seen. [38:48]\n-An incredible story of kindness from a young boy displaced by war, plus what Lynsey is working on now. [42:59]\n\nReferences:\nLynsey’s Website – www.lynseyaddario.com\nYou can find Lynsey’s best-selling memoir (now in paperback!) on Amazon.com – Search “It’s What I Do” in books.\n\nEpisode Sponsors:\nUENO – ueno.co/careers\nInVision – invisionapp.com/company\n\nMusic by Lucia Lilikoi – lucia.bandcamp.com", "duration": "2938", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9946023/lynsey_addario_episode.mp3", "type": "episode", "tags": ["inspiration", "leadership", "wisdom", "photography", "photojournalism"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1479387605, "title": "Designing Rituals (5/6)", "author": "Heroine", "summary": "Rituals are growing, evolving things with their own stubborn intelligence. That’s why the same exact rituals are hard to sustain over time. Since we are constantly changing with the months, seasons, and our environments, it makes sense to allow our rituals to organically change along with us. This approach is not only more realistic, forgiving, and practical, but it honors our naturally changing feminine energy. \n\nMajo described in Part 4 how to design your morning and evening rituals after identifying actions that aligned with your deeper desires. Now it’s time to anticipate and even welcome change. In this flash wisdom episode, Majo shares three principles that will help you add flexibility and fluidity to your rituals in a way that honors your body’s natural rhythms.\n\nShow Notes:\n-Check out and pre-order the new ebook: The Magical Effects of Morning and Evening Rituals. Get it through our Indiegogo campaign at bit.ly/heroinelive – You’ll be investing in your own self-care while supporting women’s voices. \n\n-Music by Lucia Lilikoi at lucia.bandcamp.com\n\nReferences:\n-You can read through the steps & resources outlined in this episode at mariamolfino.com/blog, How to Evolve Your Rituals.", "duration": "549", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9889474/rituals_5_anne_edit.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1478782812, "title": "Community & Heritage {Bethany Yellowtail}", "author": "Heroine", "summary": "If you’re looking to understand your creativity and how it connects to your roots, this interview will surely spark some ideas and inspiration for you. Bethany Yellowtail is an influential Native fashion designer who shares her Crow and Northern Cheyenne heritage with the utmost sensitivity and care. When our host first stumbled upon her, Majo was struck by Bethany’s work and its beautiful celebration of Native American culture (without the ickiness of appropriation). \n\nThey cover what it was like for Bethany growing up as one of the only Native girls in a mostly white public school, how she envisioned her brand and met her co-founder, and the inspiration behind her artist collective. Not only is she carving out an entirely new space in the fashion industry, but she’s doing so in a way that is positively impacting Native communities. \n\nShow Notes:\n-Bethany as a little girl: An old soul growing up on the Crow Indian Reservation. [4:43]\n-On her parents and Native heritage, and dealing with racist mentalities that still exist to this day. [8:52]\n-The extreme culture shock of her college years in L.A. and the emergence of her unique brand. [12:51]\n-Bethany’s business partner who arrived via “divine intervention” and the launch of their first ecommerce products. [17:26]\n-Her point of view around authentic native representation in fashion, plus the lessons she learned working for other companies. [21:21]\n-How Bethany’s work is a way of sharing her culture, and how she deals with criticism. [25:03]\n-On the theme of reclamation and how it relates to modern-day issues impacting Native communities. [31:39]\n-Bethany shares about the inspiration and vision behind her artist collective. [33:31]\n\nReferences:\nBethany Yellowtail – www.byellowtail.com\nArtist collective – www.byellowtail.com/all\n\nHeroine Live! IndieGogo campaign – bit.ly/heroinelive\n\nMusic by Lucia Lilikoi – lucia.bandcamp.com\n\nEpisode Sponsors:\nUENO – ueno.co/careers\nInVision – invisionapp.com/company", "duration": "2341", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9839996/bethany_full.mp3", "type": "episode", "tags": ["fashion", "women", "confidence", "leadership", "native-american"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1478174448, "title": "Designing Rituals (4/6)", "author": "Heroine", "summary": "Ready to design your morning and evening ritual? Even if you’re not, this flash wisdom episode will help you go through the motions to see what happens. In the last episode of this series we identified actions that align with your deeper desires. The next step is even simpler: sequencing these actions into a ritual. \n\nA ritual is simply a structure with intention, something we make sacred through our attention and love. They provide a way to elevate the mundane (taking a shower) into a magical experience. In this fifth episode of the Designing Rituals series, host Majo walks you through the ritual designing process, inviting you stay experimental as you explore what works best for you. \n\nShow Notes:\n-Check out and pre-order the new ebook: The Magical Effects of Morning and Evening Rituals. Get it through our Indiegogo campaign at bit.ly/heroinelive – You’ll be investing in your own self-care while supporting women’s voices. \n\n-Music by Lucia Lilikoi at lucia.bandcamp.com\n\nReferences:\nYou can read through the steps outlined in this episode at mariamolfino.com/blog, The 6 Steps to Designing Your Ideal Morning Ritual.", "duration": "668", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9782792/riutals_4_for_dani.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1477573222, "title": "Shifting Power {Eileen Carey}", "author": "Heroine", "summary": "Our speakers often hold up a big mirror, sometimes revealing traits within us that need to be developed or amplified. Eileen Carey is a super feminist who offers that experience as an outspoken, unapologetic woman with a thirst for power. An overachiever who doesn’t always follow the rules, Eileen is CEO of Glassbreakers, which provides solutions for companies that want to keep their employees diverse and engaged by tackling diversity at the corporate level.\n\nEileen comes from a long line of strong, opinionated women, and she continues in their tradition. In her interview she shares her thoughts on the fluidity of gender, drops some tough-love for women who feel like they can’t completely be themselves at work, and talks about the difference between career and corporate feminism in a way that is refreshingly direct and authentic. \n\nShow Notes:\n-Eileen’s powerful upbringing: Coming from a long line of strong and rebellious women. [4:02]\n-On her independent and strong-willed personality, speaking up despite labels of being bossy or bitchy, and being comfortable with being controversial. [9:27]\n-College years and discovering her true passions, plus the elite job she found on Craigslist that opened the doors of power to her in Manhattan. [14:53]\n-Eileen shares about her thirst for power and how that guided her when the recession hit and her career became uncertain. [19:39]\n-On being the “token millennial” during Occupy Wall Street, plus stories of Eileen’s mom the “corporate feminist”. [24:53]\n-A lively discussion on masculine vs feminine in work cultures, and Eileen’s critical advice to jobseekers. [28:49]\n-The value of diversity – One of the main catalysts for starting Glassbreakers. [34:20]\n-The rock-bottom years: Eileen shares how moments of darkness in her life led her to make (good) drastic decisions. [39:13]\n-Eileen’s lifelong passion for feminist causes and her thoughts on Hillary being the most overqualified candidate. [44:55]\n-Some tough-love advice on work-life balance, what it takes to scale a huge company, and the importance of building amazing teams. [49:07]\n\nReferences: \nCheck out Glassbreakers at www.glassbreakers.co\n\nMusic by Lucia Lilikoi - lucia.bandcamp.com\n\nEpisode Sponsors:\nUENO - ueno.co\nInVision - invisionapp.com", "duration": "3366", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9730636/eileen_episode_final_1.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "diversity"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1476964823, "title": "Designing Rituals (3/6)", "author": "Heroine", "summary": "Pleasure gets an interesting rep, don’t you think? Spiritual traditions all over the world have told us to “transcend” pleasure, or at the very least not get too attached to it. Our American culture built on puritanical principles makes us feel wary of anything that’s too pleasurable, or that comes through pleasure versus hard work. Layer on gender, and we have a whole other conversation about so many of us women (especially good girls) who feel guilty about experiencing pleasure. \n\nIn this flash wisdom episode, Majo describes how our morning and evening rituals become the pleasurable bookends to our career work, revealing how pleasure and discipline aren’t mutually exclusive. Your biggest takeaway will be the three steps she outlines to help in designing rituals that are aligned with your deeper desires.\n\nShow Notes:\n***Heroine Live! event on 10/27 – RSVP & check out other perks at http://www.bit.ly/herpod\n\n-Check out and pre-order the new ebook: The Magical Effects of Morning and Evening Rituals (available at mariamolfino.com/rituals). Use code “heroine” to get a special rate through Nov. 1!\n\n-Music by Lucia Lilikoi at lucia.bandcamp.com\n\nReferences:\n-The Desire Map by Danielle LaPorte", "duration": "460", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9674940/rituals_3_anne_edit_2.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1476360052, "title": "Fight for Authenticity {Nancy Douyon}", "author": "Heroine", "summary": "Many of our guests have had their fair share of obstacles they’ve had to overcome, but Nancy Douyon is on a whole other level. A user experience researcher at Google, Nancy found her way to happiness and stability only after bridging a new and bewildering culture, bouncing around foster homes and living on the streets, and coming to terms with her broken childhood. \n\nYou won’t believe the magical, serendipitous encounter with the MIT Media Lab that changed (and potentially saved) her life, revealing an aptitude for computers and design at a young age. Another big theme from her interview is the struggle she faced with her mom and how she was able to heal that relationship – a true hallmark of the heroine’s journey. Nancy is real, resourceful, and she has an incredible story to share.\n\nShow Notes: \n-An inquisitive daughter of immigrants: Nancy’s early years in Boston surrounded by her Haitian culture. [4:33]\n-Feeling confused, behind, and like an outsider as she tried to bridge American culture, plus the remarkable outcome of running away. [10:35]\n-How she got connected to Computer Clubhouse, an MIT program where she learned to produce music, code, use photoshop, build robots, and lead her peers. [16:28]\n-The lowest point: Bouncing around between being homeless and different foster homes. [19:02]\n-The role of art and design as her only respite during a phase of anger and loneliness. [24:32]\n-How she chose to get revenge on the foster care system, and her struggle to afford college. [28:24]\n-Finding her passion, acknowledging her skills (despite stereotypes), and taking first steps to healing the relationship with her mother. [34:44]\n-Moving forward and making amends, plus her decision to “show love through technology”. [42:49]\n-How the earthquake in Haiti affected Nancy and her family, and the growth she experienced as a result. [45:33]\n-“Fight to be authentic” and other advice from Nancy for women on their own journeys. [48:23] \n\nReferences: \nTech Social Impact Conference - www.techsocialimpact.com\n\n*Nancy has been working on multiple support efforts in Haiti - visit her relief outreach page at: www.douyonsignature.com/outreach\n\nMusic by Lucia Lilikoi - lucia.bandcamp.com\n\nEpisode Sponsors:\nUENO - ueno.co\nInVision - invisionapp.com", "duration": "3198", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9627202/nancy_douyon_episode_fix_final.mp3", "type": "episode", "tags": ["google", "women", "confidence", "leadership", "authentic"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1475755231, "title": "Designing Rituals (2/6)", "author": "Heroine", "summary": "Here’s the truth nobody ever told you: rituals are really hard to hold down. A lot of people like to pretend it’s a snap to set rituals into place. When we hear about the daily do’s of others (especially successful people of today) it can be inspiring, but it can also make you feel kind of shitty if you’re struggling to nail down your own. \n\nWe all make mistakes in how we approach and think about rituals— from the time we set them to how we relate to them after we “fail.” In this flash wisdom episode (part 2 in the Designing Rituals series), our host Majo proposes a key shift in our orientation and relationship to rituals with a feminine approach that honors all that is fluid and cyclical, and in way that promotes self-compassion.\n\n-Check out and pre-order the new ebook: The Magical Effects of Morning and Evening Rituals (available at mariamolfino.com/rituals). Use code “heroine” to get a special rate through Nov. 1!\n\n-Music by Lucia Lilikoi at lucia.bandcamp.com\n\nReferences:\n-The Crossroads of Should and Must by Elle Luna\n-Gretchen Rubin’s quiz: The Four Tendencies", "duration": "630", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9571137/rituals_2_6_full_episode.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1475150412, "title": "In Progress {Jessica Hische}", "author": "Heroine", "summary": "Years ago, Majo (our host) invited Jessica Hische to speak at the first Women In Design event and she blew everyone away with her humor, honest vulnerability, and passion for her work. Jessica is a lecturer, illustrator, and type designer – hands down one of the most important designers living amongst us in our generation today. Her clients include Wes Anderson, Dave Eggers, Penguin Books, The New York Times, Tiffany & Co., the list goes on and on. \n\nShe recently released her book, In Progress, where she shares her creative process, how her career unfolded, and how each opportunity leads to the next. Jessica and Majo may have only scratched the surface in this interview, but they cover a lot of juicy stuff plus wisdom and tips for the striving creative. \n\nShow Notes:\n–Growing up as a quiet art kid from a small town. [4:08]\n–On Jessica’s work ethic, the awkwardness of high school, and her book, In Progress. [10:13]\n–How her parents’ divorce made her a kinder person, and why “oversharing” is a huge part of who Jessica is. [14:53]\n–The shock of criticism: Being told she wasn’t “good enough” and how she responded. [20:16]\n–Dealing with competition in art school, doing lots of internships, plus a great pro tip for students. [26:30]\n–Going all in: The illustration promo she put together to get noticed, and how it paid off. [31:44]\n–On working insane hours, being upfront with her boss about what was important to her, and how hard it was to quit. [42:16]\n–Diving into freelancing full-time and being her own boss: How Jessica dealt with doubt and her biggest fear. [50:24]\n–Why Jessica likes to think of her life and career as a constellation, plus some great advice for creatives looking to attract business. [54:20]\n–The importance of being an accessible creative leader, speaking her truth, and maintaining humility without losing self-confidence. [1:01:08]\n\nReferences:\nIn Progress by Jessica Hische\njessicahische.is/awesome", "duration": "4189", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9519677/jessica_hische_full_episode.mp3", "type": "episode", "tags": ["women", "confidence", "leadership", "illustration", "lettering"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1474545607, "title": "Designing Rituals (1/6)", "author": "Heroine", "summary": "Now that we’ve finished the Creative Confidence series, we’re launching a new flash wisdom series called The Magical Effects of Morning and Evening Rituals. In this first episode, our host makes the case for why you must fiercely protect your daily rituals as a creative woman. \n\nSo why is it even important to have daily rituals? Think for a minute of all the stimulation we have at our fingertips day to day: our laptops, iPhone, Facebook, Twitter, Amazon, Netflix, YouTube, the list goes on and on. Engaging in these great tools and platforms hour upon hour makes our brains tired in this sneaky, unnoticeable way. Establishing a daily ritual is a beautiful, joyful way to remain rooted, stay sane, and keep life magical. \n\nJoin Majo (formerly Maria, she explains more about the name change in the episode) for the introduction to her six-part series on rituals, and learn four big reasons to fiercely protect at least 5 minutes of space and time for yourself every day.\n\nAlso check out and pre-order her new ebook: The Magical Effects of Morning and Evening Rituals (available at mariamolfino.com/rituals). Use the code “heroine” to get a special rate.\n\nShow Notes: \n-Check out and pre-order Majo's ebook at http://mariamolfino.com/rituals\n\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "609", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9458969/rituals_heroine.mp3", "type": "episode", "tags": ["women", "inspiration", "leadership", "wisdom", "rituals"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1473940850, "title": "Strength & Mindset {Nidhi Kulkarni}", "author": "Heroine", "summary": "Before Nidhi Kulkarni co-founded Spitfire, she did what many of us do after graduating college – she found a good, safe job where she worked hard and burned a lot of midnight oil. But she soon realized she was only pushing herself to avoid the fact that she felt lost and creatively unfulfilled. When the chance came to take a creative side project to the next level, she took it and launched Spitfire Athlete, a strength training and weightlifting app of thousands of users that helps women build physical and mental strength. \n\nNidhi and her co-founder have created a community of women that focuses on reconnecting with your body and building a confident mindset. What’s just as special is that they did it their own way, going against the “founder myth” that tells us we have to raise a buttload of money from VCs (most of whom are men). For you good girls with a passionate creative side project wondering whether to take the leap, Nidhi offers some wonderful advice. \n\nShow Notes:\n-Nidhi growing up: On being quiet and introverted, her love for sports, and testing her own limits. [3:38]\n-The teacher who helped change her trajectory and what it was like being the only girl in her programming class. [8:05]\n-Nidhi reflects on the reasons for holding herself back in the past, and why she forces herself to do things she’s afraid of. [12:46]\n-On practice, intimidation, and the rigors of studying computer science at MIT. [16:38]\n-Dealing with stress, the importance of rowing (exercise), plus   \n-Nidhi’s brief encounter with “imposter syndrome”. [22:02]\n-After college: Nidhi talks about feeling lost for a while, working a lot, and the encounter that forced her to decide between taking a chance and playing it safe. [27:46]\nStarting Spitfire Athlete and a new phase of life. [34:12]\n-From a super high to a frustrating low: Nidhi shares why buying into the “founder myth” and following a prescribed set of steps didn’t work for them (and what they did instead). [38:03]\n-The vision behind Spitfire Athlete: Taking a unique and vital approach to women’s fitness by growing strength and confidence. [43:23]\n-Nidhi shares an incredibly moving success story from one of their users. [49:17]\n“Nothing compares to doing something that is fully your own.” -Nidhi’s advice to women with side projects they want to move forward. [51:04]\n\nReferences:\nSpitfire Athlete at spitfireathlete.com\n\nSpitfire Athlete is a fitness app that helps women build their strength and power through structured training programs. The app features bodyweight and weight training programs for a variety of goals and sports from rock climbing to triathlons to powerlifting. The app has helped women around the world lift more than their bodyweight, learn how to do their first pull-up, and train to overcome anorexia.\nTraining with Spitfire Athlete is about cultivating the athlete’s mentality — it’s not about what you look like, it’s about what you can do. The warrior’s mentality of strength, mental toughness, grit and dedication.\n\nDownload their app: https://itunes.apple.com/app/apple-store/id822040342?pt=2083816&amp;ct=heroinepodcast&amp;mt=8\n\nMusic by Lucia Lilikoi at lucia.bandcamp.com\n\nThis episode's sponsors:\nUENO (ueno.co), \nInVision (invisionapp.com/company#jobs)", "duration": "3340", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9409077/nidhi_heroine_episode_outro.mp3", "type": "episode", "tags": ["women", "confidence", "leadership", "mindset", "strengthtraining"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1473336025, "title": "Overly Independent (Block #10)", "author": "Heroine", "summary": "This is the 10th and final #flashwisdom episode in the series, The 10 Blocks to Creative Confidence, and it’s all about being overly independent. Many of us (especially women) find it difficult to ask for help or fear being a “burden” to anyone. As a result, we’re so eager to achieve financial independence that we often choose paths that focus more on financial reward than heart. \n\nJoin Maria as she talks about the harm in being overly independent, sharing her own examples of how she grapples with this today. Learn how pride, fear, and the inner critic prevent us from following our most meaningful path in our quest for independence. Do some gentle introspecting to uncover whether or not you’re comfortable asking for help or if you’re being blocked by a “make it on your own” mindset. \n\n\nShow Notes:\n-Download Maria’s free playbook and catch up on all ten blocks at mariamolfino.com/free-playbook\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "366", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9356839/independent_v2_heroine_final.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1472731229, "title": "Being a Creator {Ariana DeBose}", "author": "Heroine", "summary": "Have you heard of the Broadway musical Hamilton? It’s a story of one of America’s founding fathers, featuring a score that blends hip hop, jazz, blues, rap, R&amp;B, and Broadway. It has won 11 Tony Awards, including Best Musical, and our own President has seen it. In today’s episode we hear from one of the show’s stars, Ariana DeBose, a woman who had the courage to follow her intuition, drop out of school, and fulfill her dreams. \n\nAriana is a young, passionate, multi-talented woman with many creative projects already under her belt. We talk about her challenges as an outspoken girl and one of the only students of color in her peer group, her encounter with anorexia and the pressure she felt as a teenager to be perfect, and what it means to her to be a true creator. \n\nShow Notes:\n-Ariana’s childhood: Her early love for cinema and how she connects that love to her passion for theater today. [2:55]\n-On being raised by a mother who treated her like an adult, never being afraid to ask questions, and her start with dancing. [10:24]\n-The challenge that took a self-assured teen out of her comfort zone, plus Ariana’s perspective on needing approval from others. [13:46]\n-Her struggles fitting in, always being the smart girl, and rubbing people the wrong way with her focus and ambition. [17:04]\n-“I thought I had to be perfect.” Ariana’s struggle with perfection and finding solace in dance. [20:31]\n-How her inner faith and intuition helped her fight the odds, drop out of college, and move to New York to become a dancer. [23:18]\n-How she came to realize the importance of being there for the creation of projects she worked on, and making her broadway debut. [27:53]\n-Lessons from the last six years: Not taking things too personally, knowing your own worth, and fighting stereotypes. [31:35]\n-On what it means to Ariana to be a creator, and how it felt getting the part in Hamilton. [36:20]\n-“What are some of the internal barriers women face today who want to create?” Ariana shares her insight. [40:31]\n\nMusic by Lucia Lilikoi at lucia.bandcamp.com\n\nEpisode Sponsor: UENO at ueno.co", "duration": "2981", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9305467/heroine_ariana_final.mp3", "type": "episode", "tags": ["women", "confidence", "hamilton", "leadership", "thebullet"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1472126427, "title": "Pressure (Block #9)", "author": "Heroine", "summary": "In this flash wisdom episode, host Maria Molfino gets personal about the 9th block to creative confidence – Pressure. She shares about the pressure she once felt to repay her immigrant parents for their sacrifice, and how her “save the world” complex left her feeling stressed, angry, and unable to follow her true path. \n\nListen to her story of the lesson she learned during her travels in India that helped reframe her perspective around pressure, and how small acts of kindness really can make a difference in the world and in yourself. Alleviate some of the pressure in your life by taking a step back and bringing this tendency into your awareness. \n\nShow Notes:  \n-Download Maria’s free Creative Confidence Playbook at mariamolfino.com/free-playbook\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "426", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9247153/pressure_heroine_final.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1471521650, "title": "Owning Your Desires {Emily LaFave Olson}", "author": "Heroine", "summary": "It’s not uncommon for girls who grow up in a patriarchal society to wonder if being a boy would be better; to see masculinity as more powerful than femininity. That was the case for Emily LaFave Olson, but a conversation with her mom led her to a realization that changed her life (and her perspective on the feminine).\n\nEmily is a fierce entrepreneur whose choice to take back her maiden name and become co-CEOs with her husband sets her apart as a woman unafraid to ask for what she wants. We cover a lot of ground in this episode, like how to manage the voice inside our heads that tells us we’re not good enough or smart enough, why women often struggle to ask for what they want, and how to get in touch with the inner feminine in a hyper-masculine world.\n\nShow Notes:\n-Emily’s childhood: Growing up close to her dad, a natural leader, and always believing she could do whatever a boy could do.   [3:14]\n-Teaching herself to cook from magazines and beginning to see the world through the lense of food.   [9:30]\n-College years, their first business, and feeling “not smart enough”.   [13:12]\n-Why she had to reach out to her parents to help reconcile her inner critic and her huge realization about the power and strength of the feminine.   [20:40]\n-Standing up to fear: When and how it clicked that she needed to change her name back and become co-CEOs with her husband.   [25:57]\n-How to get what you really want, plus the importance of her husband’s participation in her vision.   [30:55]\n-On internalized patriarchy, making Big Asks, and why women have a hard time demanding what we want.   [33:52]\n-How to get in touch with the inner-feminine while surrounded by hyper-masculinity at work.   [39:54]\n\nMusic: Lucia Lilikoi at lucia.bandcamp.com\n\nEpisode Sponsor: UENO at ueno.co", "duration": "2912", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9210493/emily_heroine_episode.mp3", "type": "episode", "tags": ["women", "food", "confidence", "leadership", "entrepreneurship"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1470916818, "title": "Chronic Stress (Block #8)", "author": "Heroine", "summary": "What is chronic stress? Unlike acute stress, chronic stress is constant and low-grade, wearing and tearing on the nervous and immune systems over time. You may not even realize you’re being affected, but studies show that chronic stress makes it harder for us to be creative, think outside the box, and be mentally flexible. \n\nIn this flash wisdom episode, host Maria Molfino explains how this form of stress cripples our energy and willpower, inviting the inner critic to come out and play. Practice some compassionate self-inquiry to reveal the impact chronic stress has over your life and learn basic steps you can take to keep it in check.\n\nShow Notes:  \n-Download Maria’s free Creative Confidence Playbook at mariamolfino.com/free-playbook\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "278", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9149279/8_chronic_stress_2.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1470312056, "title": "Eileen Fisher: Reclaiming the Voice", "author": "Heroine", "summary": "A big piece of the heroine’s journey is reclaiming what’s been lost. For some of us, it’s our intuition, our creativity, or our sense of self trust. For Eileen Fisher, it’s been her voice and her courage to lean into difficult conversations. This design magnate has scaled an incredible organization that generates over $300 million a year in revenue, but she didn’t have an easy start or a path paved with roses.\n\nWhat makes her shine even more is her passion for sustainability, empowering women, and living life with purpose. In her interview you’ll learn the conditions she’s created for her success, her thoughts on purpose and embodiment, and the principles that guide her leadership today. \n\nShow Notes:\n-Eileen’s upbringing: Early desires for a simplified wardrobe, the subconscious influence of Catholic school uniforms, and making her own prom dress.   [3:25]\n-How she used her math skills to help her in business and in finding creative expression.   [8:23]\n-Falling in love with the concept of simplicity and putting together her first pieces.   [11:47]\n-How a design-thinking mindset gave her the confidence to move her ideas forward.   [16:12]\n-Eileen’s biggest challenges starting out (and how she overcame most of them through sheer resourcefulness).   [17:31]\n-Overcoming her fear of communication and reclaiming her voice.   [22:23] \n-On being a mom, getting divorced, and trying to run a business (the toughest part of her journey).   [26:18] \n-The quality that allowed her to keep going during the hard times.   [30:38]\n-Meaning, purpose, and other principles that guide Eileen’s leadership today.   [33:12]\n-Beyond profits: The importance of sustainability, organic materials, and supporting women’s bodies.   [39:15]\n-Eileen’s daily advice for supporting relaxation (which in turn, supports creativity).   [45:33] \n\nDiscover Eileen’s newest initiative, the Learning Lab, where she is creating opportunities for people to get enlivened and inspired through a focus on the mind-body connection, creative leadership, and purpose-driven living. With online and on-site workshops and events, the Learning Lab offers space to try on new ways to live and work that feel more integrated and authentic.\n\nConnect soon and sign up to be a part of Eileen's vision at www.eileenfisherlearninglab.com\n\nMusic by Lucia Lilikoi: lucia.bandcamp.com\n\nSponsor:\nUENO\nhttp://ueno.co", "duration": "3235", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9121488/eileen_fisher_full_episode_with_plug.mp3", "type": "episode", "tags": ["women", "confidence", "design", "leadership", "eileenfisher"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1469707224, "title": "Numbing Feelings (Block #7)", "author": "Heroine", "summary": "We live in a culture that medicates feelings. Women are especially under constant pressure to restrain our emotional lives; we apologize for our tears, suppress our anger, and tone down our passion out of fear of being called hysterical.\n\nJoin Maria in this flash wisdom episode about the 7th block to your creative confidence and expression: numbing feelings. Learn the consequences of this tendency, such as missing out on feelings essential to the creative process, and the important role feelings play in creative leadership. Maria offers empowering wisdom to help you bring this tendency into your awareness and leverage your feelings to great effect.\n\nShow Notes:  \n-Download Maria’s free Creative Confidence Playbook at mariamolfino.com/free-playbook\n\nReferences: \n-Medicating Women’s Feelings by Julie Holland (NY Times, Feb. 2015)\n-Brené Brown: The Power of Vulnerability (TEDx Houston, Jun. 2010)\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "345", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9060277/7_numbing_feelings.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1469102426, "title": "Creative Confidence {Andréa Mallard}", "author": "Heroine", "summary": "Imagine graduating from college and flying to Europe for your first job as a journalist. Instead of things going as planned, you end up bartending in the red-light district to survive. That’s Andrea Mallard’s “fall from grace” story, but it’s not where her story ends.\n\nFrom making friends with the head pimp on the street to becoming Chief Marketing Officer at the inspiring and innovative company, Omada Health, Andrea’s journey is filled with personal insights about finding the creative confidence to lead on your own terms. In her interview she busts a few myths that keep you second-guessing yourself, shares her perspective on work cultures that support whole people, and offers advice on how to integrate work and home life.\n\nShow Notes\n-Maria introduces Andrea Mallard.   [1:45]\n-The “lost year”: How Andrea ended up stranded in Paris and tending bar in the red-light district.   [3:55]\n-The wake up call she needed to stand up for herself and land a job at Forbes Magazine.  [9:59]\n-Analytic vs. creative and Andrea’s decision to be both, plus the epiphany that helped her get confident fast.  [14:52]\n-The big secret around feeling like an imposter and how to stop getting in your own way.    [20:02] \n-On sexism in the workplace, being a working mom, and how to integrate work and home life together.   [25:00]\n-Why it's so important to be your authentic self at work.    [30:52] \n-Andrea talks about being a leader on her own terms and shares a 100% unique example of creative confidence.   [35:31]\n-The most exciting thing about working at Omada, plus Andrea’s advice to her younger self.   [40:48] \n\nReferences: \nwww.andreamallard.com\nOmada Health: www.omadahealth.com\n\nMusic: \nLucia Lilikoi at lucia.bandcamp.com", "duration": "2864", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/9016880/creative_confidence_full.mp3", "type": "episode", "tags": ["women", "health", "confidence", "design", "leadership"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1468490406, "title": "Attachment to Outcomes (Block #6)", "author": "Heroine", "summary": "Do you hold back from going after what you want because you’re too tied to how things will turn out? Host Maria Molfino shares how our attachment to outcomes is keeping us from the joy and pleasure of our creative process. In this short 'n' sweet episode, learn how to create space between your work and the results and maintain a healthy outlook around how other people perceive you and your own expectations.\n\nShow Notes:\n-Download Maria’s free Creative Confidence Playbook at mariamolfino.com/free-playbook\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "220", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8904122/6_attachment.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1467885631, "title": "Luck & Opportunity {Katie Dill}", "author": "Heroine", "summary": "Katie Dill, Head of User Experience Design at Airbnb, grew up with a creative background that was far from typical. So how did she land her dream job at a company centered around creating unique experiences for their users? Katie shares all about her journey, which often required her to step outside her comfort zone, and how she found her niche. \nLearn specific ingredients designers have that are useful to leaders, how she handles growing pains and tough feedback, and her wisdom on the relationship between luck and creating opportunities.\n\nShow Notes:\n-Katie’s outdoorsy upbringing as a talented problem-solver and trouble-maker.   [4:30]\n-How she discovered her niche and figured out how to make a career out of it (despite feeling out of her element).   [10:58]\n-On her transformative trip to Italy, where she learned how much there is to gain by going outside your comfort zone. Plus, how to talk yourself out of talking yourself out of things.   [15:58]\n-Creating opportunity vs. Luck (and the relationship between them).   [20:17]\n-The different types of designers at Airbnb, Katie’s own creative vision as a designer, and how being creative makes her a better leader.   [24:48]\n-Do women have a secret superpower they need to unlock? Katie, Maria, and Linda discuss.   [29:19]\n-Dealing with transition: How Katie used positive self-talk, self-reliance, and self-confidence to adapt.   [34:43]\n-Her biggest career challenges.   [41:44]\n-How Katie handles growing pains and critical feedback (including the toughest pieces of feedback she’s ever received).   [46:35]\n\nReferences: Lean In by Sheryl Sandberg \nMusic: Lucia Lilikoi at lucia.bandcamp.com", "duration": "3308", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8930568/final_katie_dill_luck_opportunity.mp3", "type": "episode", "tags": ["travel", "women", "confidence", "design", "leadership"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1467291624, "title": "Comparison (Block #5)", "author": "Heroine", "summary": "Continuing the series on the blocks to creative confidence, host Maria Molfino reveals the fifth block: Comparison.  \nComparison is an ugly face of the inner critic, and a huge de-motivator. Learn what comparison feeds on, how it can warp your standards for success, and what you can do to keep it in check.\n\nShow Notes:\n-Download the free Creative Confidence Playbook at Mariamolfino.com/free-playbook\n-Music by Lucia Lilikoi at lucia.bandcamp.com", "duration": "437", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8877754/flash_wisdom5_comparison.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1466686839, "title": "Aphrodite Emerges {Elle Luna & Susie Herrick}", "author": "Heroine", "summary": "In this episode, host Maria Molfino takes on two inspirational women in one go:  Elle Luna, a SF based artist and author, and Susie Herrick, a licensed therapist with over 20 years experience and author of an upcoming memoir, Aphrodite Emerges (to be released in the Fall).\n\nThey tackle some big themes, the biggest being inner misogyny. Hear about their journeys and the challenges they faced, how to know when you’re following expectations vs. your deeper calling, the expansive power of dreaming bigger, and their upcoming workshop Aphrodite Emerges: Activate the Goddess Within (now open for enrollment at www.aphroditeemerges.com).\n\nShow Notes:\n-On Susie’s spiritual upbringing, and her earliest realizations of negative self-talk and the conflicting expectations within women in our society. [3:54] \n-Considering our ‘should’s: Where they come from, what they’re like for women, and how they imprison us. Plus, the powerful one-liner Elle read about Susie that caused them to meet. [8:36]\n-The insanely busy, exhausted, dried up, and deeply dissatisfied state Elle was in before turning things around. [11:46]\n-How do you cross over from discontent and inner dissonance to other side? Susie shares her own experience. [13:33]\n-Elle reads from their book, Aphrodite Emerges, about destroying ego and accepting new callings for life. [18:55]\n-On the conflict women face in a “balanced” work culture and the kinesthetic experience of ‘should’ and ‘must’. [23:46]\n-Culturally inherited misogyny: The oldest prejudice. [27:03] \n-Coming to terms with the social emotions of blame and shame. Plus, how Susie’s relationship with her father strengthened after opening up to him about some buried issues. [32:23] \n-Elle and Susie talk about their upcoming workshop in August, Aphrodite Emerges: A Journey to Unleash the Godess Within. [39:58]\n\nReferences: \nAphrodite Emerges retreat info at http://www.aphroditeemerges.com\nThe Crossroads of Should and Must by Elle Luna\nMisogyny: The World’s Oldest Prejudice by Jack Holland\n\nSponsor:\nUENO  http://ueno.co\n\nMusic: Lucia Lilikoi   lucia.bandcamp.com", "duration": "2718", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8833491/heroine_susie_ellie_episode.mp3", "type": "episode", "tags": ["art", "women", "confidence", "leadership", "femininepower"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1466085633, "title": "Vision Quest {Majo Molfino}", "author": "Heroine", "summary": "We’re taking a little break from the blocks to creative confidence series to honor an important one-year anniversary. In this episode, host Majo Molfino shares her recent interview with SOULS of Society creator Dijon Bowden, in which she opens up for the first time about her three-day vision quest in the desert that she embarked upon one year ago today.\n\nGet to know Heroine’s founder and host through her own journey, one that challenged her on every level, as well as the immense preparation it required and the heart-opening moments that made it all worth it. Brace yourselves, this one’s intense.\n\nShow Notes: \n-Episode intro: Honoring an important one-year anniversary in the life of Heroine's host, Majo Molfino.  [0:00] \n-On writing her novel and how it inspired her to go on a vision quest.   [2:35] \n-The tradition of vision quests, and the discipline and preparation required.   [9:10] \n-Some of the major insights Majo gained.   [14:20] \n-What it was like being on a mountain in the desert with no food or water.   [17:35] \n-On working with a Medicine Woman to prepare, and the predominant emotions she felt during the quest.   [21:13] \n-Coming down the mountain: Meaningful metaphors around water (and being thirsty!), and not being recognized by her parents.   [25:41] \n-How the experience sowed many seeds that will continue to sprout for a long time, plus Majo pre- and post- vision quest.   [34:41] \n-Majo shares some immediate life changes following the event, as well as a few poems she wrote about her experience.   [41:20] \n\nReferences: SOULS of Society at www.soulsofsociety.com\n\nMusic: Lucia Lilikoi at lucia.bandcamp.com", "duration": "2736", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8783225/visionquest.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "visionquest"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1465477246, "title": "Courage & Hustle {Sofya Polyakov}", "author": "Heroine", "summary": "CEO & co-founder of The Noun Project, Sofya Polyakov inspires us through her heroine's journey, which includes immigrating to the U.S. from Russia, working insane hours, holding meetings out of her car, and having the courage to embrace the unknown by starting a company for the first time. She also shares her perspectives on key issues that commonly block us from reaching our full potential as creative leaders.\n\nShow Notes: \n- Growing up stubborn and independent in communist St. Petersburg. [10:00]\n- Sofya’s teenage years, immigrating to the U.S., and the importance of being adaptable. [14:57]\n- On staying motivated, searching out people who challenge you, and the inspiration behind The Noun Project. [19:07]\n- How Sofya had the courage to launch a startup without a lot of experience and her perspective on what leadership really is. [23:19]\n- Challenges getting started on The Noun Project. [28:40]\n- The big turning point: How Sofya rose to the challenge and played every card she had when it was all on the line. [35:40]\n- On perfectionism, the fear of failure, and the qualities that allow you to give your all when you’re ready to give up. [40:50]\n- The trap of comparison: Feeling intimidated but putting yourself out there anyway. [46:26]\n- Sofya’s views on balancing business and being a mom, and the type of CEO she strives to be. [52:04]\n- How she has built a culture of trust within her team, and the two qualities she considers most valuable in new employees. [57:04]\n\nReferences:\n- http://thenounproject.com\n\nSponsor:\n- http://ueno.co", "duration": "3766", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8725841/sp_heroine_final_final.mp3", "type": "episode", "tags": ["women", "technology", "design", "startup", "leadership"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1464876006, "title": "Guilt of Pleasure (Block #4)", "author": "Heroine", "summary": "How's your relationship with pleasure? Host Maria Molfino talks about the tendency to feel guilty about pleasure and where that guilt comes from. Learn why it's so important to slow down and access pleasure in your day-to-day.\n\nShow Notes:\n-Download the free Creative Confidence Playbook at Mariamolfino.com/free-playbook.\n-Music by Lucia Lilikoi, lucia.bandcamp.com", "duration": "302", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8665069/flash_wisdom_guilt_of_pleasure.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1464271216, "title": "Grit & Generativity {Helena Price}", "author": "Heroine", "summary": "Do you have a creative passion you never imagined could pay the bills? Host Maria Molfino introduces us to tech photographer Helena Price. Recently named Silicon Valley’s most wanted photographer, this heroine rekindled a lifelong passion and made it her career. Find out what it takes to make the leap into becoming a full-time creative, and learn some surprising ingredients that can help in the process.\n\nShow Notes:\n-Young Helena: Her background, being perceived as the “smart kid”, and dealing with feelings of isolation.   [1:23]\n-Helena talks about her first exposure to photography and what it was like growing up in a creatively-stifled hometown culture.   [6:45]\n-On college (and skipping class), falling in love with the tech scene, and touring with music bands.   [10:57]\n-Some of the challenges Helena faced and how she survived on her own.   [15:58]\n-What it took to be taken seriously and become a success early in her career.   [21:49]  \n-How photography came back into the picture (to stay).   [25:59]\n-From getting her first job to drowning in work offers, plus Helena’s theory on how to make sure everything works out.   [30:22]\n-Grit. Can women learn to have more of it?   [34:00]\n-What she’s working on now: Her first, personal project that’s showing people a side of tech they haven’t seen before.   [39:12]\n-Helena’s amazing advice to women wanting more creative expression in their lives.   [43:22]\n\nReferences:\nTechies by Helena Price: www.techiesproject.com\n\nMusic:\nLucia Lilikoi: lucia.bandcamp.com\n\nFind Heroine at:\nHeroine.fm\nTwitter.com/heroine.fm\nInstagram.com/heroine.fm\nFacebook.com/heroine.fm", "duration": "2825", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8601695/grit_generativity_helena_price_final.mp3", "type": "episode", "tags": ["women", "confidence", "leadership", "photography", "techies"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1463666431, "title": "Perfectionism (Block #3)", "author": "Heroine", "summary": "Is your tendency towards perfectionism blocking your creative confidence? Writer and coach Maria Molfino reveals the root of perfectionism's dark side and shares how you can decrease its power over your life.\n\nShow Notes:\n-Download the free Creative Confidence Playbook at mariamolfino.com/free-playbook\n\nReferences: \n-The Gap by Ira Glass\n-Big Magic by Liz Gilbert\n\nMusic:\n-Lucia Lilikoi  lucia.bandcamp.com", "duration": "499", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8547347/flash_wisdom_perfectionism.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1463058002, "title": "Creative to CEO {Marian Goodell}", "author": "Heroine", "summary": "How did Marian Goodell go from studying photography and creative writing to becoming the CEO of Burning Man, one of the biggest sociocultural experiments of our time? The link is fascinating, especially for those who are both creative and analytical and who aren’t following a straight and predictable path. Find out how Marian deals with criticism (i.e., she is too impatient and her tone is too \"demanding\") and how she filters feedback. \n\nShow Notes:\n-Marian as a little girl: Learning self-acceptance, how to embrace differences, and enjoying the perks of being a fiery redhead. [2:34]\n-The role of Marian’s family in shaping her to become a strong, confident woman. [8:47]\n-On attending an all-girls college, running for student body, and the first time she decided to be a leader. [13:16]\n-“My role as a CEO is very much that of a storyteller”: How Marian’s creative, analytical side made her the right woman for the job. [16:37]\n-On being a “cat herder” and what that means to her as a leader, and other leadership qualities. [21:47]\n-Why Marian cares about providing opportunities, giving people the benefit of the doubt, and sharing differing perspectives. [27:04]\n-Stories of her father and his participation in Burning Man 2008 (a year before he passed away). [30:32]\n-Marian and Maria discuss failure and the fear of rejection, the importance of creative confidence, and the challenges (and benefits) of collaboration. [35:14]\n-On feminism and fathers, and finding the balance between feminine and masculine leadership traits. [40:30]\n-Looking beyond gender: Taking a hard look at qualities like patience, aggression, compassion. [47:26]\n-How Marian filters and utilizes criticism/feedback. [52:38]\n-Have you ever felt like an imposter? The inner critic vs empowering voice. [57:44]\n-Burning Man: Marian’s vision for the project’s future, her favorite principles (Leave No Trace and Radical Self-Expression), and being poised in the world as a catalyst for social change. [1:01:53]\n\nReferences: \nLean In by Sheryl Sandberg\nBurning Man at burningman.org\n\nMusic: \nLucia Lilikoi at lucia.bandcamp.com\n\nFind Heroine on: \nHeroine.fm\nTwitter.com/heroinefm\nInstagram.com/heroine.fm\nFacebook.com/heroine.fm", "duration": "4180", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8485869/creative_to_ceo_maria_goodell.mp3", "type": "episode", "tags": ["women", "confidence", "leadership", "social-engineering", "burningman"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1462459871, "title": "Fixed Mindset (Block #2)", "author": "Heroine", "summary": "Host Maria Molfino shares how a fixed mindset – believing things about yourself cannot change – is blocking your creative confidence.\n\n- Creative confidence playbook: mariamolfino.com/free-playbook", "duration": "422", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8424408/flash_wisdom_fixed_mindset.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1461859837, "title": "Meaning over Happiness {Dr. Vivienne Ming}", "author": "Heroine", "summary": "If you believed you could never be happy, would you go on living? That’s the question that echoed in Dr. Vivienne Ming’s mind when she contemplated killing herself, before she became a woman, mom, neuroscientist, technologist, and LGBT advocate. Dr. Ming shares more about the wisdom that saved her life, and how it led her to focus on the one superpower that predicts success over and over again. \n\nShow Notes:\n- Vivienne’s upbringing, not living up to expectations, and realizing she was “different.”  [1:30]\n- The lowest point — Suicide, and why she decided not to do it.   [4:39]\n- On her larger-than-life father and his example of “living a life of substance.”   [7:54]\n- How intrinsic motivation fueled her shift away from the brink of suicide.   [12:02]\n- From flunking out of college to getting perfect scores in everything the second time around.   [14:59]\n- On her year at the Machine Perception Lab and the start of her professional success.   [19:08]\n- Learning to counter her destructive-perfectionism through perseverance. [21:31]\n- On feeling free to follow what she believes to be right.   [25:09]\n- Women’s tendency to worry about how they are being perceived rather than whether they are being true to themselves.   [26:51]\n- On meeting her wife in graduate school and opening up about wanting to be a woman.   [31:13]\n- The immediate effects of Vivienne’s gender transition – losing her position at Stanford, being treated differently by close friends and strangers alike, and observing implicit gender biases.   [35:38]\n- Vivienne’s work at Socos: Studying the predictors of success and optimizing life outcomes.   [42:43]\n- Defining a meta-learner and the main categories that predict success.   [47:33]\n- How to strengthen our meta-learning abilities.   [52:49]\n- Vivienne’s perspective on how society influences gender roles and the enduring disparities between men and women.   [54:55]\n\nReferences:\nDr. Ming’s organization Socos: www.socoslearning.com\n\nMusic:\nLucia Lilikoi at lucia.bandcamp.com\n\nFind Heroine on:\nHeroine.fm\nTwitter.com/heroinefm\nInstagram.com/heroine.fm\nFacebook.com/heroine.fm", "duration": "3878", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8370798/interview_2_dr_vivienne_ming_final.mp3", "type": "episode", "tags": ["women", "technology", "confidence", "science", "leadership"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1461073719, "title": "Following the Rules (Block #1)", "author": "Heroine", "summary": "Following the Rules: Little girls outperform boys in school because they do their homework, listen to their teachers, and follow the rules. But that can backfire when it comes to creative leadership. Writer and coach Maria Molfino explains why and how following rules could be blocking you in unexpected ways.\n\nShow notes:\n- Download the free Creative Confidence Playbook: mariamolfino.com/free-playbook\n- Lucia Lilikoi music: lucia.bandcamp.com", "duration": "460", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8296595/flash_wisdom_1_following_the_rules_final.mp3", "type": "episode", "tags": ["women", "inspiration", "confidence", "leadership", "wisdom"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1461073214, "title": "Discomfort & Risk {Roz Savage}", "author": "Heroine", "summary": "How and why does a management consultant become the first woman to row across three oceans? How does she overcome the ocean at night, and above all, the doubts swirling in her own mind? Roz Savage, environmental advocate and TED speaker, shares the specific process that set her on this wild adventure – one that you can do in under ten minutes.\n\nShow Notes:\n- Roz’s upbringing as the perpetual new girl and her skill at jumping through childhood’s hoops.   [1:51]  \n- How Roz got stuck for 11 years pretending to be something she didn’t want to be.   [10:00]\n- On the epiphany (inspired by a simple self-help exercise) that changed her life. And why she waited to act.   [12:58] \n- From self-sabotaging to her lowest point, to finding transformational confidence and her life’s calling.  [17:39] \n- How the unlikely idea emerged to use ocean rowing as her platform for bringing environmental awareness.   [24:46] \n- Going into the first race (as the only solo female) and the challenges she faced.   [29:35] \n- How Roz destroyed self-limiting beliefs and redefined what she was capable of.  [35:50] \n- On surprising herself, being grateful for challenges, and choosing to see her discomfort as a clear sign of success.   [39:15]\n- The story of her emotional decision to be rescued when she really needed it.   [44:11]\n- The toxicity of criticism: Roz’s theory on why people criticize, dealing with with her own inner critic, and how she stays true to her vision.   [49:22]\n- Understanding internal motivations and taking ownership over your life.   [56:13]\n- On the importance of amplifying heroine journeys, being open to spiritual perspectives, and balancing feminine and masculine energies.   [1:00:55]\n- Looking to the future: Roz’s belief that stories like hers help others to challenge old paradigms.   [1:09:35]\n- Roz breaks down the exercise that changed her life and discusses the importance of crafting your own story.  [1:12:28]\n\n- Lucia Lilikoi music: lucia.bandcamp.com\n\nReferences:\nRoz Savage’s book, \"Rowing the Atlantic: Lessons Learned on the Open Ocean.\" \nRoz Savage’s website, http://www.rozsavage.com/", "duration": "4629", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8296506/episode_1_roz_savage_final.mp3", "type": "episode", "tags": ["creativity", "women", "adventure", "leadership", "heroine"]}, {"seriesId": 1100949693, "seriesTitle": "Heroine: Women’s Creative Leadership, Confidence, Wisdom", "pubDate": 1459882442, "title": "Introducing Heroine", "author": "Heroine", "summary": "Learn why I started this podcast, what to expect, and sneak previews to interviews with women creative leaders, risk-takers, and adventurers. First official episode releasing soon on 4/19/16!\n\nShow notes:\n- Interview snippets with Roz Savage, Helena Price, Vivienne Ming, and Marian Goodell\n- Podcast website: heroine.fm\n- Maria's website: mariamolfino.com\n- Music by Lucia Lilikoi: lucia.bandcamp.com", "duration": "264", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music122/v4/22/78/73/227873b6-a4f7-8483-3c5b-e6ff208b027f/source/60x60bb.jpg", "audioUrl": "http://api.spreaker.com/download/episode/8185967/heroine_teaser.mp3", "type": "episode", "tags": ["women", "inspiration", "self-help", "leadership", "heroine"]}]}