{"series": {"feedUrl": "http://the10minutemarketer.com/feed/podcast/", "genres": ["Management & Marketing", "Podcasts", "Business", "Business News", "Education", "Training"], "title": "The 10 Minute Marketer", "country": "USA", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "type": "series", "id": 1167526085}, "episodes": [{"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1488804958, "title": "The Death of Radio and Rise of Podcasting", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s show will focus on podcasting; traditional terrestrial radio is dying, but people still want to hear music and get information.  Today David talks to his podcast co-host Lisa Davis about this.\n\nIs podcasting the future?\n\nAccording to Lisa – yes it is.  Podcasts are huge because you can listen at any time; it’s also great fun to do and fun to learn.  For entrepreneurs, a podcast is like having an audio blog, and it’s a great way to reach your audience. Instead of preparing PowerPoints for a presentation, flying to the venue, and making a presentation to reach the audience which is confined to the venue; a podcast allows you a much greater range; not just to an audience in the US but across the globe and your audience can listen when they want.  Getting access to a podcast is as simple as subscribing and listening when you want – on demand.\n\nHow easy is it to get a podcast on iTunes?\n\nAccording to David – it’s simple but very detailed- the details will be posted to the website.  There was one guest whose company makes plug-ins which make it very simple to get started; podcasting is not a complicated thing.  Statistics show that 3/4ths of podcasts listeners are under twenty-four years old.\n\nAs an entrepreneur – is podcasting for me?\n\nAnyone can start a podcast – you don’t have to reach millions of people and you don’t have to be Howard Stern.  All you have to do is connect with your ideal audience and have a small following – it’s not a sprint, it’s a marathon; it is an excellent way to get your message out there.  It also helps to have a co-host since this will make the podcast less annoying and more entertaining to listen to.\n\nWhat about content?\n\nWhat if your business is not cut and dry? What are some of the things that you can talk about?   David suggests you first have to define your audience – you have to start with who is your ideal client, why are you doing the podcast?  Your aim should be to get information out there, engage an audience and monetize it; you want to get people to your site.  Content is easy – just think of what your audience wants, think of the problems they are facing try to address them in each episode.\n\nYour challenge\n\nIf you’re going to do a podcast instead of a blog or plan to do one to compliment your blog - determine who your audience is, what their top of mind problems are and think about how often you would want to do it.", "duration": "10:01", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm042-The-Death-Of-Radio-And-The-Rise-Of-Podcasting.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1488459312, "title": "The Art of Pivoting in Today’s Economy with Guest Wendy Sachs", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s show will focus on women and how they tend to be cautious – over thinking their next move and because getting ahead requires taking action and overcoming some of this.  Today’s guest joining David and Lisa is Wendy Sachs. After college, Wendy started out on Capitol Hill as a Press Secretary then she moved into news and became an Emmy award winning producer, then went on to Dateline, CNN, and Fox.  She has written a book “Fearless and Free – How smart women pivot and re-launch their careers.”\n\nPivoting and Re-launching \n\nThe economy and the workplace is different than it was ten years ago – digital and technology have disrupted a lot of industries - and to stay relevant and current one has to be pivoting.  For many women, they take time away from the workforce especially when they have children and then try to re-enter. Re-entry can be tough and a challenge, especially if you haven’t kept up your skill sets, kept up your network or figured out what you’re going to do again.  It’s crucial to stay focused – as Wendy stated she had been fired from jobs, but you have to get back up again. There have been many studies which show that men will apply for jobs when they are 60% whereas women will only apply if they meet 100% of the qualifications. Males are more willing to try things out whereas women want to be perfect – we are afraid to take that risk because we are scared of failing, but when you take the risk, you create the confidence to make a move.\n\nDon’t over think – act and be confident\n\nConfidence grows from taking the bigger risks – the more you put yourself out there, the more you will have to gain from that experience and the more confident you become, but it all starts with believing in yourself to take some action.  There is another philosophy which is very prevalent with start-ups, and it’s “fake it till you make it” or “fake it till you become it.”  Women in their careers just need to go out there and “fake it until we make it” or “fake it till we become it;” if that doesn’t work – move on.  If it does work, learn from it, make it better and press onward.  It’s a different mentality that women need to learn and grow.\n\n “Fearless and Free – How smart women pivot and re-launch their careers.”\n\nWendy uses inspiring stories such as Lisa’s in her book – Lisa now has four radio shows, but no one offered her a job – she worked hard on her radio show concept, and now nine years later she has four shows.  Stories like that are meant to inspire women to try new things, but you also need to surround yourself with like-minded people who can cheer you on.  Listeners are invited to go check out the book because it’s very inspirational – the greatest lesson coming out of all of this is to try and try and if it doesn’t work out the first or second time – persevere and pivot to get out on the other side of all of it.\n\nHow to contact Wendy?\n\nCheck out her website at wendysachs.com", "duration": "10:21", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm43-The-Art-Of-Pivoting-In-Todays-Economy-With-Guest-Wendy-Sachs.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1488200120, "title": "All About Podcast Sound Quality With Guest Sonar", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "You may think that podcasting and radio are one in the same, but in reality, they are worlds apart. Today we have podcasting expert ‘Sonar’ back with us to give us some information on the ins and outs of podcast sound quality and how GAB Radio Network helps with it!\n\nIntroducing Sonar (Again)\n\nIf you haven’t listened to one of our older podcasts, Sonar is the director of engineering over at the GAB Radio Network -- a company that helps make podcasting incredibly simple. All you need to do is deal with the actual content, and they’ll take care of the rest. He’s also a sound, podcast, and radio expert!\n\nImportance of Podcast Quality\n\nSonar points out that he could be telling people the winning lottery numbers for the next day, or offer the secret to life and listeners would tune out of the sound quality was horrible. If your sound quality isn’t up-to-par, then you risk sounding ‘sophomoric,’ according to Sonar. It makes it appear as if your content (no matter how much value it has) isn’t credible. Most listeners of this podcast are probably entrepreneurs who may be considering starting one of their own -- and it would be in your best interest to sound professional. Take this show for example -- everyone speaking is in a different state, yet they all sound as if they’re in the same room.\n\nWhich Equipment Should I Get?\n\nWhat can you ‘get away’ with? What should you consider? When should you be looking to work with someone like Sonar and GAB Radio Network? These three questions are vital to those looking to start their podcast. Fortunately, getting started alone is very easy nowadays (and making it sound good as well.) For starters, your computer should have at least 4 gigabytes of RAM to capture your voice without any latency, and some way for the sound to get ‘into the computer’ -- in other words, a mic. Sonar says there are plenty of USB soundcards (or external soundcards) out there. Regarding microphones, a lot of beginners tend to use cheap Skype headsets or even the ones for their phones, but you should get at least a mid-tier microphone for a little under $60 if you’re serious (http://bswusa.com/ is a great website for a lot of your audio needs.)\n\nAudio Software and Production\n\nOnce the audio is actually on your computer, you’ll probably need to do a lot of post-production, such as cleaning up any bad sound quality, especially from guests with less-than-perfect audio quality. There are a couple of programs you can use for this, and a lot of them are free -- but the one we use is called GoldWave, which has a one-time fee and then it’s yours to use for life on unlimited devices. However, you’ll need to live mix everything (if you have questions you can email sonar@gabradionetwork.) Speaking of that, a lot of work goes into the production and management of a podcast, and for entrepreneurs such as David, you have a business to run -- in other words, you have no time.\n\nProduction Companies Make Your Life Easier\n\nA lot of people have no idea production companies like GAB exists. While there are quite a few production companies out there, GAB does everything from production to distribution. Even if you have an idea for a radio station yourself, they can handle it. As an entrepreneur, all you have to do is worry about the content side of it and let the production company be the man or woman behind the glass that drives everything and monitors quality; this means that when you record your podcast, all you have to do is send it. Coordination of sound, editing, and everything else can be done by a production company. From coordinating guests, editing, and even providing audio cues -- such as when you’re running out of time. That's it for today's show, but fortunately, we’ll have Sonar back another time with tons of other tips to create amazing podcasts.\n\nYou can check out GAB Radio Network here: http://gabradionetwork.com/", "duration": "11:15", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm040-Podcast-Sound-Quality-With-Guest-Sonar.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1487854557, "title": "How to Stay Competitive with Larger More Traditional Brands with Guest Nicole Ertas", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s guest is the best-selling author of \"Free Range Brands\" and founder of The Ertas Group, Nicole Ertas. She’ll be here to inform us on the rise of newer brands and the fall or stagnation of more traditional ones in today’s interconnected social environment. \n\nWhat Many Traditional Brands Lack\n\nMore and more big brands today are trying to figure out how to be like some of the newer, smaller brands in an attempt at not falling behind. Brand to consumer relationships has made a huge shift from even just 8 or 10 years ago where traditional brands thought they had no reason to worry. Today they’re finding themselves trying to emulate much smaller, more contemporary brands. Why? Nicole claims that this change is because traditional brands were built on more of a “one-way,” controlled channel of communication. Newer brands focus on building a community and embracing the two-way environment we now live in.\n\nFour New Types of Consumers Who Can Make or Break Your Brand\n\nIn today’s very social environment consumers want to participate in your brand. Gone are the days where your target audience would be receptive to a one-way message. The brands doing this correctly are shifting from making themselves the hero into making the consumer the hero. There are four new types of primary consumers:\n\n \tLords\nThese are the modern day \"influencers\". In the past, this role was strictly designated towards celebrities and other high profile individuals, but today almost anyone with an internet connection can have a large following.\n\n\n \tLovers\nThis type of consumer looks to connect on shared values. How can you find ways to connect using values and not features and benefits?\n\n\n \tHackers\nThis group feels a strong need to participate, interact, and co-create with a brand. They don’t like being completely on the receiving end and want to help you build your brand.\n\n\n \tHawks\nThe last group is the most aggressive, and basically, want to make sure you practice what you preach. With the growing distrust of large brands, companies must think about what they do from top to bottom; today is a world of transparency, and because of this you must make sure you’re able to appease the hawks.\n\nDefining Traits of a Free Range Brand\n\nFree Range Brands, as Nicole calls them, possess defining characteristics that make them what they are. These brands are much agiler and think about how to make consumers the hero. They act as leaders of a community and build the best relationship with consumers as opposed to being a product that only wants to talk about itself. These brands are aware of how to be more receptive and adaptable to what’s going on in the world. A lot of companies think just being on social media fills this requirement, but that’s a misconception --  it’s how you use it that makes all the difference.\n\nSuggestions on How to Do This\n\nTaking the time to focus on your social media efforts is important because when you’re all over the place, it’s hard to be interactive. If you’re not doing this in a way where you’re communicating with the people who are interacting with you, then you’re missing out on a tremendous opportunity. If that’s the case then pulling back and focusing on one platform where you can cultivate your followers is suggested. You don’t want to spread yourself so thin to the point where you can’t react to your community.\n\nHide Your Brand and See Your Fans Grow\n\nToday almost everyone has some following -- whether it be Facebook, Instagram, or even Snapchat -- they want to be seen by their followers. This point resonates with the “Lords” especially, because they value discovery and want to elevate themselves to their fans. To take advantage of this, as a brand you should give them information or insight that may be of value to both them and their followers. Many brands such as Taco Bell put this into practice. An example would be to invite loyal followers to try new products; then these followers would in tur...", "duration": "9:56", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm039-stay-competitive-larger-traditional-brands-guest-nicole-earhast.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1487595325, "title": "Podcast Content Tips With Guest ‘Sonar’", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "This morning we’re going to be going over some fantastic podcast content tips for you guys and our guest today is Sonar, an expert in the field and a host with GAB Radio Network.\n\nTalk to Your Audience Instead of at Them\nNo one appreciates anyone talking down to them or ‘at’ them. Treat your audience as a group of your friends and make a conversation out of your discussion. People don’t want a lecture (they would have stayed in school if they did), they’re looking for a friendly, warm peer to peer conversation. A good tip is to engage your audience to a point where it feels like they’re sitting in a room with you -- this is one of the best ways to build a genuine conversation.\n\nTry Not to Take Long Breaks\nThe big goal is to form a conversation, but at the same time, a podcast is certainly different from a regular conversation. In a personal conversation, you’re easily able to take long gaps to digest what has been said, however, on a podcast or radio if you stop talking for a solid 10 seconds your audience is probably going to leave you right there. You must articulate and engage your audience regularly, taking as little breaks as possible.\n\nConsistency Is Key \nYou’ve heard it a million times, and you’re going to hear it once more -- consistency is key. As a host, you’re looking to build expectation and anticipation from your listeners. It doesn't matter as much when you release, just always release at that time; this isn’t necessarily a content tip, but it’s good practice nonetheless. Radio and podcast hosting is all about timing.\n\nKnow Your Subject Well\nYou’re going to want to know what you’re talking about, and this means being well-versed in your podcast’s subject. You don’t necessarily have to be an expert, but you should know enough to ask the right questions to an expert. One of the benefits of podcasts is being able to find people who know more about something, interviewing them, then picking their brain. You are, essentially, the embodiment of your audience. Even if you know the answer, if it’s useful information, you should be asking it for your audience’s sake.\n\nFind a Co-Host\nA co-host isn’t a necessity, but it’s recommended. Sonar says he enjoys having a co-host because without one it feels like he’s preaching to his listeners. Being alone also cuts down on your downtime, meaning you always need to be saying something. Transitions are a lot easier with a co-host. One last benefit is even if you don’t have a guest you’re still able to have another voice thrown into the mix. With a co-host you have another person to lean on and that in itself is engaging to the audience.", "duration": "9:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm038-Podcast-Content-Tips-With-Guest-Sonar.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1487249716, "title": "Inspiration and the ‘Aha Moment’ with Guest Donna Palm", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today we’re going to learn a bit from returning guest Donna Palm’s life experiences, what inspired her, and the ‘aha moment’ that got her to pick the path that she did.\n\nWhat was the ‘Aha Moment.'\n\nDonna claims that she has had quite a few times like these, but the one that paved her way to success was at the time she had just gotten divorced with two kids. At that point, she was a single mom that got tired of living a life she wasn’t happy with, and something snapped. Donna then decided that something had to change; she had to adjust her life, so she wrote down a plan or ‘blueprint’ for herself. She lists an inventory of where she was, what she had, and then her dreams and what it was she wanted to accomplish.\n\nOvercoming Fear and Depression\n\nAt that point, she felt the lowest she has ever felt, and that fear and depression then acted as the driving force behind the change in her life.  She felt that she couldn’t and wouldn’t waste her life living this way; that she wasn’t going to wait another 20 or 30 years for something to change, especially since she had children and wanted a better living for them as well.\n\nWhat Donna Did to Excel\n\nChances are you know a handful of lawyers and realtors, but not many of them experience success as big as Donna. She claims her success came about from her sincerity and honesty in dealing with people. You get back what you put in, and if you work hard to get customers and talk to people, it will come back to you. In fact, almost all of her clients are repeat or referrals from previous customers. The key takeaway here is “when you take care of your customers they will take care of you.”\n\nDonna’s Biggest Challenge\n\nIf you’ve heard about Donna’s past situation one would think that her being a single mother trying to change her life was the greatest obstacle on her path to success, however, as cliche as it sounds, it was her believing in herself. More people than you think are in that very same situation, but if you don’t do something as simple as believing in yourself, then you’ll never be able to get up and follow your dreams. When Donna began to take chances, that’s when everything started changing for her.\n\nThe Start of Believing in Herself\n\nThere were a lot of pieces to the puzzle, but one of the most life changing according to Donna were the seminars she had attended. A lot of them were very inspirational and provided her with the motivation to follow her dreams. Another great reason were her kids -- looking into their eyes she couldn’t stand them living as they were. As a parent and a single mother she wanted to be their role model, and because of this, her children were a big motivation.\n\nDonna's Biggest Tip for Listeners\n\nTenacity is imperative -- be tenacious, believe in yourself, and don’t be afraid to fail. You need to get started and stop making excuses. Without failure you will never be a success. \n\n \n\nYou can learn more about Donna Palm here: http://www.donnapalm.com/", "duration": "9:56", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-Inspiration-for-Success-and-the-Aha-Moment-DonnaPalm.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1486990756, "title": "Easy Podcast Publishing with Mackenzie Bennett", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Podcasting helps us grow our business but what you may not have known is that a lot that goes into building a podcast. Today our guest is Mackenzie Bennet, and she works for one of the most popular podcasting platforms out there, Blubrry. This morning’s podcast is about how the Blubrry plugin makes the ins and outs of podcasts much easier for anyone trying to get into it.\n\nPodcast Hosting and Statistics\n\nBlubrry makes it simpler to host your podcasts and podcast downloads by storing them on their own servers as opposed to your own. This means that instead of using up gigabytes of bandwidth per month with potentially thousands of users listening to and downloading your podcasts, they’ll handle it all for you. This eliminates any possibility of your website crashing or you having to pay for an upgraded plan. Another feature they boast is their podcast statistics. These statistics make it easy to track where listeners are coming from, whether it be iTunes, Android, or any other platform. You can also see what marketing is working and what isn’t, which guests and show topics are the most popular and more with just one click of button.\n\nWhen Should Someone Use Blubrry\n\nAnyone who is planning to have a show should sign up for hosting because you never know how popular you’re going to get. Not many people know about this, but typically media files such as podcast downloads are against a web host’s Terms of Service so Blubrry also eliminates any possibility of you getting your service cancelled. The plugin also handles sharing, RSS, downloads, and posting of your podcast to various platforms such as iTunes, Android, Stitcher, and TuneIn. Even better, those who have opted into an email subscription via the plugin are sent emails every time a new podcast is uploaded. Because of these features, your podcast has the ability to grow much faster than if everything were handled by yourself.\n\nWhat If I Don't Have a Big Following\n\nWe’re all aware that massive growth doesn’t happen overnight but a podcast is an amazing way to reach out to people with very little effort compared to conventional methods. Blubrry’s average downloads for all podcasts across the board is around 100-250 and while this sounds small, imagine a room filled with 250 people listening to you every week. Before podcasts you would have to travel to different locations very often in order to speak to a room filled with people of that very same size.\n\nAny Advice for People Who Want to Get into Podcasting \n\nBefore you get into it, you should plan ahead and do research on who your audience is going to be. Reach out to people who already do podcasts and also communities who are interested in what your show’s topic is.\n \nSign up for Blubrry Podcast Hosting \nSign up for Blubrry Professional Statistics", "duration": "10:13", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm035-EZPodcastPublishing-Mackenzie.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1486644903, "title": "Blueprint Your Dreams with Guest Donna Palm", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Most people float through life without ever making a plan for themselves. They’ll make a plan for anything else, but in life when it comes to the route they take people always seem to neglect it. Today Donna Palm returns to give more insight to what exactly a ‘Blueprint’ for your dreams is.\n\nWhere to Start with Making a Blueprint\n\nThe first step towards creating an effective plan is to start where you are now. Get a good idea of what assets you currently have and where you stand in life at the moment. After doing that, Donna claims the next step should be to write down your goals, no matter how crazy or insane they may seem. Writing down your goals is one of the easiest ways to make a plan and act on it. If you want it, you should get up and go for it. Donna uses the words, \"plan and accomplish,\" because just believing doesn’t get the job done, you need to do something about it. David chimes in with, “You don’t win the lottery if you don’t buy a ticket.”\n\nBlueprints Must Be Adaptable\n\n\nJust because you have a blueprint doesn’t mean it’s set in stone. Life is unpredictable, and nothing goes as planned one-hundred percent of the time. Keeping your plan resilient means, you’ll be able to adapt if something happens unexpectedly. That being said, blueprints aren’t only for individuals and those who are looking to change their lives. Even businesses and successful people can step back and make a plan as a guide to follow. A business without a blueprint or guide is one set up for failure.\n\nWhat Does ‘Dream Bigger’ Mean\n\nIn life, anything can happen, so you should never be content. The majority of people have lost hope in their daily lives and settle for the mundane. These people live paycheck to paycheck only barely getting by because it’s the easy way out. ‘Dream Bigger’ mostly means not to accept the life you currently have and to never settle just because you think there’s nothing that could happen to you that’s better than where you’re at now. If a divorced single mom with two babies, in the middle of moving to an entirely different state with nothing can turn her life completely around, then so can you. Donna claims that her rise from being homeless to successful was because she dreamt bigger.\n\nRisk Is Necessary\n\nPeople often think the best time to take risks is when you’re at a younger age -- without a family and fewer responsibilities -- so it can be scary for people who are older, have a family, bills, and don’t want to put things like retirement on the line. Because of this, many think past a certain age it’s too late to take any form of risk. To counter this state of thought, Donna makes the hard-hitting point that at the end of the day you have two choices: Would you rather take the risk, or be lying on your deathbed thinking about everything you’ve missed out on that could have been. If you're still opposed to risk, doing tasks in small, calculated steps can help minimize it.\n\nYou can learn more about Donna Palm here: http://www.donnapalm.com/", "duration": "9:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm036-Blueprint-Your-Dreams-Donna-Palm.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1486385934, "title": "Use Story Telling To Build Your Brand And Fill Your Blog", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s topic is about utilizing ‘storytelling’ to build your brand. Telling stories can be vital, from writing blog posts to setting up email autoresponder content -- building trust is critical.\n\nOne of the Best Ways to Build Your Business\n\nOne of the greatest ways to build your business and get eyes on your brand is to create a blog. Content from blog posts can even be used to create social media posts and as content for autoresponders in email marketing. At first, many are too intimidated to get this done, and this is why most blogs are lacking in the content department. These people ask themselves questions such as, “what would I write about,” or “what would people be interested in,” but in reality, it’s a lot easier to create content than you think it is. The best part about this is even if you’re more comfortable with audio or video, you can always have show notes written for you. Show notes are a summary that covers key points of what it was you spoke of prior (it's what you're reading right now). The importance of this goes beyond your listener having another medium to digest the content in; it makes it possible for Google to funnel visitors and potential clients to your site. Keep in mind that Google can’t ‘see’ audio or video, but can crawl blog posts.\n\nDelivery Is Important for Trust Building\n\nMany individuals think they need to be very formal, but on the contrary, people want to get to know you. Imagine each conversation as a one on one talk with a best friend. You shouldn’t particularly worry about any formalities because if you want people to feel comfortable around you, you have to seem human; this is a vital part of building trust with your base.\n\nFour Key Areas to Pull from for Content\n\nThe main takeaway here is creating content that engages your ideal client in an efficient but ‘human’ way. Here are four easy methods for you to build content while incorporating storytelling into the mix:\n\n1. Share a Problem That You've Solved / Problems That You Solve\n\nYou should start off by writing down at least five different problems that you’ve solved or helped another person solve and tell a story while you do it. With a list of five, you have not only created content for the week, but you’ve effectively created content for the next four weeks worth of posts. A good way to get started would be to lay it out like this: \n\n \tHere’s how I met one of my favorite clients. \n \tHere’s the problem they had.\n \tHere’s how I solved it. \n\nKeep in mind to do this is a way that doesn’t make you sound like a salesperson and remember to share it from the heart. \n\n2. How are you different: \n\nDifferences are something that usually catches people’s attention. If you’re providing a product or service, then you've probably started it because you couldn’t find a solution anywhere else. You can list a handful of stories about your journey in getting to your current point and tell those. Tell them why filling the niche you did makes you different. While doing this, you should neither be negative nor knock any competition.\n\n3. Your inspiration for being in business:\n\nStories of inspiration are some of the most personal ones we can share with others. Explain to people why you got into your particular field of business and even tell stories of anything that happened along the way.\n\n4. Celebrating customers or clients:\n\nTo do this, you can pick a few clients or customers, get permission to tell their story, or even interview them. Speaking of existing customers ties easily into the other steps, because you can even bring up how you’ve helped them solve a problem they had. These types of stories easily resonate with potential clients who’ve experienced something similar.\n\nBy telling stories and being relatable you’re effectively selling yourself without being a salesperson. \n\nPutting It All Together\n\nOnce you've managed to tell all these stories, you can publish them in a shuffled order,", "duration": "10:09", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm033-Use-Story-Telling-To-Build-Your-Brand-And-Fill-Your-Blog.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1486044708, "title": "Life Do Overs with Guest – Donna Palm", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s guest is Donna Palm, who went from homeless to the author of “Dream Bigger, Live Better” and independent real estate broker who within two years of that purchased her first RE/MAX real estate franchise. The goal of today’s podcast is to detail ways in which to make the most out of life, and she’s here to tell you how.\n\nMost People Lack a Blueprint\n\nIt’s critical to keep track of exactly what you have and where you are now in life and where you want to be.  Donna started out as a single mother union electrician who was totally unhappy with her life, living in the cold state of Illinois, to residing in Florida and becoming a successful author and real estate agent. Having a blueprint is vital because it puts a lot into perspective and gives you a starting point.\n\nStart with Where You Are\n\nSomething everyone should do is create an accomplishment or gratitude list. In it, you should include everything you could be grateful for that has happened to you and what you have to fall back on. Creating and carefully going through a gratitude list will lift your spirits and because of the very nature of the list, will have you notice that your life isn’t as bad as you initially thought it was.\n\nSchool of Life List\n\nWhat the second type of list Donna advises to create is a “School of Life List.” This list is essentially a checklist of mistakes you have made and what you’ve learned from them. Reflection is the key to improving yourself, and you must realize that failing is a key to becoming successful. Most people are afraid of failure, but in reality, this is where you get most of your strength. It gets you to better think about what you can do better the next time.\n\nTaking Chances Is Important\n\nBeing persistent, taking chances, and trying against all the odds makes a difference. Lisa mentions a time where she introduced herself to a TV station manager, and for six months after that she was persistent enough, and to her friends’ surprise she ended up doing a show called “Health Power” for two years just because of that tenacity, effectively launching her career in media. Donna mentions it was her persistence that determined that success.\n\nQuit Making Excuses\n\nExcuses are poison to your success. If you want to do something, just do it, and this shift from your comfort zone is the first step to reshaping your life. The point is, don't ever give up. You have no clue what’s ahead of you if you never take a chance.\n\n \n\nYou can learn more about Donna here: http://www.donnapalm.com/", "duration": "9:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm032-Life-Do-Overs-Donna-Palm.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1485781166, "title": "Improving Sign-ups On Your Website", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "You aren’t alone if you have issues getting people to sign up to your website. You can spend all the money in the world on marketing and traffic, but if you lack a proper and effective funnel, it all means nothing. If your site design is profoundly flawed, the majority of visitors will leave without giving it a second thought.\n\nWhat Is a Call to Action\n\nA call to action is effectively an instruction you give to a potential customer for them to put to use a good or service of yours. Capturing a person in their first visit is tough, making email sign-ups one of the most effective calls to action you can implement. Keeping in touch with your audience is imperative and following the 80/20 rule is key. David further elaborates on this.\n\nLead Magnets Are Important\n\nLead magnets go hand-in-hand with a call to action and email marketing. In today’s digital world the best lead magnet is value. Why would anyone want to give you their email voluntarily? What value can you offer to them? We’ll figure out the best piece of value you can create to garner a valuable and engaged following.\n\nSolving Problems Is Key\n\nSolving problems isn’t necessarily selling your potential customer a good or service, but offering them something that is of immediate benefit to them. It is then up to them to utilize that information as a personal guide for free. Imagine being forcefully sold a car instantly, with little to no knowledge of what you’re getting into, as opposed to being offered a free brochure with all the information you need to make an educated purchase.\n\nTrust is Paramount\n\nNow that you’re at this step your primary goal is to build trust. If you put out a clear guideline of what you’re going to send them and when you’ll send it to them, it then creates a distant relationship between you and your customer. Keep in mind to reassure them you will never send them spam or sell their email address but instead, you’re working for them, sending them valuable information that will help them.\n\nKeep It Up\n\nContinuous value and knowledge are very practical for your email subscribers, and there is no reason to halt what it is you’re doing if it works. There are three options when it comes to sign-ups: The person will make a purchase, unsubscribe, or you continue to offer them free value. You must also keep in mind emails are not a substitute for social media posts, meaning, they are sent periodically and not in say groups of 10 emails per day. Your email campaigns should be more of a semi-blog post style content offering, for example, your latest tips, podcast, or any valuable content you want your audience to see. Naturally, now and then it is okay to promote particular content, just make sure it isn’t something completely unrelated to your brand's area of focus.", "duration": "10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm031-Improving-Signups-On-Your-Website.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1485435614, "title": "Vision Vs Dream with guest Dr. Joyce", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "In today's podcast, we’re going to touch bases on the relationship between visions and dreams. Everyone has a dream of some sort, and if you’ve ever planned to accomplish anything only to end up putting it off forever to the point of it never getting done then today’s topic should be all too familiar with you.\n\nImportance of Vision\n\nTo bring an idea into action, you must first have a vision. People without a vision are very easy to identify; they are the ones who are usually complaining about their jobs and how unhappy they are. These people have little to no motivation, and it is because they lack vision. What they don’t realize is that vision is the key to putting their dreams into action.\n\nWhat Exactly Is Vision\n\nIn Dr. Joyce’s eyes, a dream is a goal that has yet to be accomplished and requires a vision. To her, a vision not only includes a plan to achieve a goal, but it also entails passion. She believes that a vision starts with yourself. A proper vision is organization and knowing what your limits are. You can look at it as a roadmap of how you are going to get there (your dreams).\n\nMoney Isn't the #1 Goal, Passion Is\n\nMotivation is a crucial part of achieving your dreams, but unfortunately, a lot of people have the wrong idea when it comes to what motivates them. If you ask a significant portion of individuals with big dreams what their primary motivation is, they’ll boldly state that it’s money. What they don’t realize is, successful people, don’t primarily think of money in the process, what drives them is passion. Many people don’t see the big picture, they get impatient, but in reality, the money will come if you stick to it and see it through until the end.\n\nVision Boards (the Good and the Bad)\n\nVision boards are beneficial, however just having one makes little sense. There is a term related to vision boards, and that is, “putting it out there in the universe,” but if you aren’t actively putting forth any work towards the goals set on that vision board, nothing will happen.\n\nAny Actions You Can Take\n\nIdentifying energy drainers is paramount. Get rid of distractions and people who discourage you. You cannot give up. If you think about it, we are all marketers that sell ourselves to others the very moment we open our mouths. You must find a balance with external distractions if they get in the way of your vision.\n\nBe a Contrarian\n\nIt’s needless to say but most people are negative, and unfortunately friends and even family can be included in this group. A part of being a contrarian in today’s world involves removing the negative from your life. You need to ignore the negative obstacles to achieve your dreams. The truth is when you remember to tell yourself, “If it were easy everyone would be doing it,” you will feel a lot better.\n\nDeveloping Better Self Esteem\n\nPositive self-esteem is a necessary mindset to possess when you want to achieve your dreams. To stay concentrated on the big picture, you need to think like a winner. If you tell yourself you are the best at what you do the only thing that can stop you are other people. Revisiting the point of being a contrarian, you must remove the negativity from your life. Some useful tips are to stop reading the negative news you see online. Stop following friends or family who post or share nothing but negative stories. Find positive news instead and start your day in a positive light. It all starts with yourself and if you have positive self-esteem nothing and no one can hurt you. At the end of the day it is a game-changer to remain positive, motivated, and laser-focused on the right thing.\n\n \n\nYou can learn more about Dr. Joyce here: http://drjoyceknudsen.com/", "duration": "10:12", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm030-Vision-Vs-Dream-With-Dr-Joyce.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1485176455, "title": "Creating Successful Emails", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Creating Successful Emails\n\nToday’s show will look at successful emailing – what should you put in an email cover, how long should it be – among other things; the discussion will be between the show’s hosts Lisa and David.\n\nCategories of emails\n\nMost individuals get a lot of emails on a daily basis – Lisa gets maybe forty or fifty per day, David gets well over a hundred or two hundred.  Emails maybe coming from customers, from sites you subscribe, shopping sites, some definitely maybe spam – the key is to craft the perfect email because no one will ever see it unless you do the things which will be discussed in the next few minutes.\n\nCrafting the perfect email\n\nTo start take your mailing list, segment it and as you have a sign up box – make it targeted.  For example for Lisa’s radio show there maybe persons only interested in recipes or exercise – if she’s sending out emails, she would need to make them targeted; do not send emails to everyone because they may unsubscribe.  Let the subscriber choose if they want some or all of the information.  Crafting the perfect email begins on the sign up page on your webpage.\n\nWhat is in the email?\n\nBe informational 80% of the time; sell 20% of the time. If you’re an entrepreneur constantly blasting out emails – sale, sale, sale – you’re going to lose people because they don’t care.  Show them you care by your selling our product by showing your customers you are an expert, you know how to use I, you may be showing other ways of using the product they never thought of.  Who the email is from is critical because people won’t open it if they recognize the person sending it; so if you’re a company use the company’s name and then put your name.  If you’re building a personal relationship with your client – put your name first, because people want to recognize who it is from.\n\nWhen to send emails?\n\nThe key is to be consistent; David suggests emailing out consistently every time each week – find out which day works for your industry – but be consistent because if you start changing days it may be seen as spam  and it may get deleted.\n\nOften overlooked....\n\nThe subject line is often overlooked; and, if done incorrectly you could turn off people.  A third of persons will decide to open it or not based on the subject line so it doesn’t matter if you’re giving away gold for free it wouldn’t matter because based on the subject line, people are making the decision to open it and see that offer.  There’s also a report that 70% of people reports an email as spam solely based on the subject line!\n\nCraft the perfect subject line\n\nCreate a subject line that is going to get curiosity going – it doesn’t have to be very specific because sometimes vague build curiosity. One of the most famous email heading was done when President Obama was running and it simply said “Hey You.” Another category is: reveal a secret – for instance say “the number one reason entrepreneurs always _____.”  Another way to do it is to begin with a number; another is how to.  The fifth way is to create a pain point or top of mind problem and then solve it.\n\nIncrease the opening rate \n\nIf you have a large mailing list you’re doing yourself a disservice:  if the reader is not expecting it, if you’re constantly selling and if you’re not following one of the five categories for subject headings.", "duration": "10:10", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm029-Successful-Emailing.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1484830809, "title": "There’s A New Generation In Town – with guest Dr. Joyce", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "When speaking to potential clients one would assume a generational gap would be a reference to millennials in contrast to the ages before them, and while that’s true, today’s podcast will present a different spin on the meaning of “new generation in town” you probably have never wrapped your head around.\n\nThe Forgotten Generation\n\nIn today’s marketing environment it isn’t necessarily the newer generation that everyone is forgetting, it’s the older ones and not just this, we fail to remember that different generations aren’t necessarily supposed to be kept separate. Reaching out to newer generations is important, but we cannot forget to communicate and work together to achieve the greatest overall results. Learning various ways to speak with and communicate between different generations is of utmost value in today’s ever-changing world.\n\nLearning to Speak to Generations That Aren't Yours\n\nIf you desire to remain competitive, you must find ways to discover more about generations that are different from yours, whether they come before or after, some may just be your ideal clients which you would benefit from targeting.\n\nDifferences in Ideologies and Lifestyles Between Generations Is Okay\n\nDr. Joyce authored a book called, “The Generational Puzzle” and in it, she interviewed different people from each generation and had them tell their story. During this process she noticed that there are vast differences in what each from their respective generations would say, however, as we learn, this isn’t necessarily a bad thing. An example was brought up about the show “Survivor” where they had Millennials vs. Generation X, and while they all had their differences, when they came together problems were solved a lot faster than naught.\n\nSimilarities vs. Differences in Generations and What We Can Learn\n\nWe're told that although differences are apparent, there are a lot more similarities between the generations than there is contrast. It is clear that there are quite a few lessons the younger generations can learn from the wisdom of the older ones, and inversely, there are a lot of innovative methods the young generations can teach the older ones (Dr. Joyce goes into more detail with an example).\n\nSocial Media and How It Bridges the Generational Gap\n\nAs we all know, social media is the greatest phenomena of this century when it comes to connecting to and expanding your audience. In today’s world, people of all ages are becoming more technology savvy, and the majority of the world is active on their smart and mobile devices, further strengthening this point. If you have a desire to learn about a target audience that’s foreign you need to reach out to them and connect on a different level. We have a lot to learn from every generation.\n\n \n\nYou can learn more about Dr. Joyce here: http://drjoyceknudsen.com/", "duration": "10:08", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm028-Theres-A-New-Generation-In-Town-With-Dr-Joyce.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1484571600, "title": "Features Vs Benefits", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Today’s discussion will be “what you think your customers want to hear versus what they really do want to hear;” in other words, features and benefits.\n\nFeatures versus Benefits\n\nIt doesn’t matter what industry you’re in, no matter what business you’re in – you offer something and most people confuse features and benefits of their product and they don’t really get what the benefits are because they think the feature is the benefit; often the two is confused. The way to distinguish them is to ask yourself “so what?”  In marketing we say, people are very selfish – they only buy when you can solve a problem – what they want to hear is “what does it do for me?”   When we assume that our customers want to hear all the feature of what we offer – we’re assuming they have knowledge of our industry but really what they want to hear is the benefits of what we have to offer.  For instance, if asked to sell a pencil many persons would say it is made of lead, and it’s wood and it has an eraser on it – all those are the features; but to sell the benefits you would say it’s easy to hold so it makes it easy to write in cursive, you can write a personal letter and connect with people on a whole other level and if you make a mistake you can erase it.   The features are of interest in a longer description page if someone wants to look up and get more information but in your emails and your posts on social media – anything you’re writing – you want to focus on the benefits and that’s the critical part to learn.\n\nWhy do you need to sell benefits?\n\nEveryone will clearly understand why they need to buy what you have to offer – you would have answered the “so what?” The benefits can be sold without giving any technical knowledge of the industry or even telling one feature of the product.  Companies like Apple have been very successful in selling benefits to their customers – for instance, when they introduced the iPod; everyone else was selling mp3 players that contained 8mb, 32mb or 64mb and what Apple did when they launched the iPod said “put a thousand songs in your pocket.” It was sold on the benefit without any technical information about the industry.\n\nAre more people getting this right?\n\nThe ones getting it right are most successful; most small entrepreneurs don’t know the difference.  Most persons will say “everybody should know this,” but no, if you went back in time before you learned it – that is where your customer is, they don’t have the technical knowledge of your industry so tell them how you benefit them – how you address top of mind problems, how you solve their problems.  Selling the benefits of your product is not bragging – you’re just saying to people what you have that is beneficial.\n\nWhat do you promote?\n\nMake a list of all the features of your products and then list the benefits of all those features; mix it up, pick your favorites and that’s what you should promote.", "duration": "10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm027-Features-Vs-Benefits.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1484226029, "title": "Keeping Your Word with Dr. Joyce", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "In today's show our guest is Dr. Joyce Knudsen. She is a professional Image and life coach, who is also the operator for the first and only school for certification in this area.\n\nWhy is it important that we keep our word - from a brand, business or personal side?\n\nSaying something that you don't mean will not help you or your business in anyway. If you want to be an entrepreneur, you need to know that your word is your bond, it means everything. In other words, if you tell your clients that you are going to be there at a certain time and a certain place, it is your responsibility to be there. People need to know that they can rely on you, in whatever way you present yourself to them. When you keep your word, this builds trust and respect.\n\n \n\nTips to help you remember things and keep your word.\n\n \tWrite it down - Do not wait until the end of the day to write down something important.\n\n\n \tBe real - take extra steps, bring things to your conversation that can help.\n\n\n \tBe there - You have to be there for your clients when you say you will.\n\nTake away notes.\n\nDo not say something unless you're going to keep your word. If you say something, no matter how small or how big, make sure to carry it through. Do not use excuses. If you're not able to make it, let the client know before the appointed time because their time is as valuable as yours.\n\nGuest Website: \nwww.drjoyceknudsen.com", "duration": "10:10", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm026-Keeping-Your-Word-With-Dr-Joyce.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1483966822, "title": "How to Write Your About Me Page", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary \nOne of the hardest things to do is to talk about yourself and yet it’s something that you absolutely have to do – meeting new clients or even for your webpage. Today’s show will look at how to create the “About Me “page.\n\nThe “About Me” page\nIt made a big difference for Lisa after David taught her about the “About Me” page – it got her re-energized about why she’s doing what she’s doing on her health website and her health shows. It forced her to think about her mother’s illness, her childhood and wanting to help people live their healthiest lives. As David points out it is sometimes difficult for people to talk about themselves because it may seem like bragging but you want to get across your background, your expertise because your audience wants to connect with you. There’s a formula – all entrepreneurs have a story to tell and David will provide the formula to assist you to tell the story on your website.\n\nWhat’s the formula?\nYou want to cover: who you are, you’re expertise, how it addresses the needs your clients have and how they can contact you. Often times the contact information is overlooked and left off the about me page but you want to leave your readers with a call to action or how they can reach you.\n\nHow do you write it?\nInstead of worrying about sentence structure and things like that, Lisa suggests that it can be written as though you’re talking to a friend. When someone is reading your website, it can come across as a big cold corporation but that doesn’t work - people want to connect with you, they want to know that you understand their problems; they want to know you have gone through some of the same problems. So, when you tell your story do not be formal; so you can download an app on your phone which allows you to record yourself and ask yourself the questions, ask them out loud and answer as though you’re talking to a friend.\n\nWhat are the questions which should be answered?\nWhat is it you do?\nWhy did you start your particular type business? Describe it.\nWhat drives you to do what you do?\nWhat is your background in the area?\nWhat special achievements, awards, and recognition have you received?\nWhat was your “aha” moment which got you into this area?\nWhat were some of the biggest challenges/obstacles you faced?\nDo not worry about the order; do not worry about formality, do not be shy, do not worry about trying to impress anybody. Just talk as though you’re talking to a friend and tell stories that your audience can relate and connect to.\n\nAbout Me\nAfter you’ve answered all the questions above, you would have addressed all you want to keep in the “About Me” page – it can be 700–1000 words; include a few pictures, some nice graphics, tell your story in a fun personal one on one way. Make sure all the questions above are answered but no need to be formal and at the end a call to action as to how someone can contact you.\n\nExamples\nCheck out my About Me page by clicking \"Start Here\" above or check out Lisa's at www.itsyourhealthwithlisadavis.com.\nRemember, they can be fun, informational and the fact that people will want to learn more about you.", "duration": "10:09", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-025-How-To-Write-Your-About-Me-Page.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1483621216, "title": "Inspiring Guest David Essel of Positive Thinking Won’t Change Your Life…", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nDavid Essel - author of the book “Positive Thinking Will Never Change your Life but This Book Will” is back on the show; he’s monetized giving advice and helping others into a business.\n\nWhat is David Essel’s business?\n\nDavid has worked with people in all areas of life; he has helped entrepreneurs in starting and expanding their business, hiring the right staff, marketing and advertising.  He also goes across the board in helping to heal, to lose weight and to feel better about themselves; positive thinking is only a small part of this process.\n\nPositive Thinking Won’t Change Your Life....  \n\nPeople say if you want something – you just put it out into the Universe - but it doesn’t end there; you’ve got to work hard at it – you’ve got to be tenacious.  David’s suggests that if your vision board, your affirmations hasn’t brought you exactly what you wanted in the last three years then you need to do things differently; the reality is if it doesn’t work – stop doing it – no matter who endorses it.   Nothing will change if you don’t make that change; none of the great gurus have ever said they created their success via their thoughts.  In all aspects of life – business, relationships, and health - it is doing that thing which makes you uncomfortable which will bring you success. Vision boards are great but it figuring out how to get to your goals and stepping out of your comfort zone that is going to help you achieve those goals.\n\nDavid’s “aha “moment...\n\nWhen the book was written it would either sink David’s career or make it explode – and it has exploded, and the reason for that is that he is speaking truth.  He is authentic, he has been doing this work for thirty-six years and he came to the realization that up to 1998 what he was teaching people was nonsense.  When he got to this point he apologized to his people and said “here’s an inexpensive book that will give you proof of the reality of success;” that is what has taken him to where he is.\n\nThe Positive Thinking Movement\n\nDavid has been endorsed by Jenny McCarthy as the “new leader of the positive thinking movement” because his positive thinking movement is the one that actually gets things done.\n\nDavid devotes the first hour of every day to affirmations, journaling, gratitude, prayer and meditation and then after that he working hard at achieving his goals.\n\nGet Chapter One of the book\n\nDownload at www.talkdavid.com and download it. Read it and enjoy – you’ll want the rest of the book!", "duration": "10:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-024-Inspiring-Guest-David-Essel.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1483362030, "title": "The Importance of Mastermind Groups with Guest David Essel", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary \n\nIn today’s show our guest will talk to us about the critical importance of entrepreneurs getting involved with business coaches, mastermind groups and networking groups; he’s author of the book “Positive Thinking will Never Change Your Life but This Book Will” – he is David Essel.  The first chapter of the book will available for download at the end of the show.\n\n \n\nWho needs a networking group? Why?\n\nAnyone who has ever achieved massive success in life will not tell you they did it on their own and one of the main principles of the book is that you have to be willing to constantly invest the time, money and effort into growing your business and for even the brightest entrepreneur that means getting involved with some form networking group, meet up groups, masterminds groups or business consultants.   David speaks of his mentor who went from homeless to multi-billionaire and when asked of his secret to success - he said mastermind groups and consultants.  Therefore David encourages all his clients to do the same.\n\n \n\nWhat is a mastermind group?\n\nA group of entrepreneurs together – it is led by one person; every week there is an individual in the “hot seat.”  They talk about their business for sixty seconds, they talk about their successes for sixty seconds; they spend two minutes talking about where they’re not making it, what their greatest blocks are, what their greatest challenges are and there’s a ratio:  sixty seconds – who I am, sixty seconds – what am I doing well.  A hundred and twenty seconds here are my blocks because as stressed in the book, your challenge lies not within what you do well but in what you avoid, what you suck at, what you don’t like to do.  When the person speaks for two minutes then the group gives advice; the person in the hot seat cannot reply to anyone’s advice, they can only write down the recommendations.  Seven days later they come back and share the action steps that they took and let us know what worked and what didn’t.\n\nThe concept would be the same if you work with a business coach or consultant – the key is to talk about your fears, vulnerabilities and what you don’t want to do.\n\n \n\nHow to find a mastermind group? \n\nGod did the world a favor when Google was created – so if you don’t know an answer, Google does.  So wherever you are in the US, go ahead and Google “mastermind groups” in your area and see what shows up.\n\nWhy do you need a mastermind group or a business coach?\n\nAs entrepreneurs on a daily basis we gravitate towards tasks we like doing - that’s natural; but the block is what you don’t enjoy doing so if you don’t feel comfortable going to networking groups – that’s the first step.  You have to step out of you comfort zone and go make it happen – quit hiding behind excuses; when you get with a group that has different visions they will enlighten and help guide you to answers you may not have thought of.\n\n\nHow to get Chapter One of the book\n\nGo to www.talkdavid.com to download.", "duration": "10:57", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/Importance_Mastermind_10mm023.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1483016427, "title": "Connecting with David Hoffeld – Author of The Science of Selling – Part 2", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "We talk about marketing and we often leave out the component of the sales process. The sales process is where we’re actually closing the deal. We’ve brought back a guest that we had on before that was a lot of fun and brought to the marketing and sales side of things actual science. If you recall we heard from David Hoffeld. He literally wrote the book on science in sales.\n\nRules\n\nThere are certain rules our brains follow that are almost innate. We don’t try to do it, our brains just utilize them and it helps us make rapid choices. Once you know some of these rules, regardless if you’re in sales or marketing, you’re going to become instantly more effective.\n\nReactants\n\nWhen you walk by the sign that says “Don’t Touch: Wet Paint.” What do you want to do? You want to touch it. Why is it that a sign that tells you not to do something makes you want to do it? The reason is because of reactants. Reactants are the feelings of psychological pressure that occurs when people believe their ability to freely choose is being restricted by another person. This is also why signs that say don’t litter have been shown to increase littering. That’s why many communities put up signs that say “Please Pitch In” instead of “Don’t Litter”.\n\nLeveraging reactants\n\nWe leverage this all the time in sales and marketing. Often times we’re trying to get somebody to do something like click on our website. Or to speed up a sales cycle we try to create urgency. What happens though is people often react negatively to these strategies because they feel reactant. They feel like you are pressuring them to do something. Scientific studies have validated what creates reactants but how do we reduce them? Research shows that letting people know, whether it’s a good choice or not it’s their choice reduces reactants and creates even more urgency to comply with your request.\n\nSocial Proof \n\nThere is another principal you can use whether you’re in sales or marketing and it’s called social proof. Social proof is very powerful. There have now been over sixty years of research on social proof and even some brain science. Social proof is the idea that we connect the persuasiveness of a behavior or an idea with how other people are responding to it. That’s why we like bestselling books, blockbuster movies or businesses that have a lot of satisfied customers. If other people are doing it it’s more likely to be a good idea. So share what other people are doing, especially those that are like your potential customers. Similarity amplifies the persuasiveness of social proof. Share real world examples of how past customers have experienced success with your product or service. If you do that it lowers the perception of risk and people now are far more likely to embrace your ideas.\n\nSecond level questions\n\nSecond level questions is where you ask someone to assess something or give their opinion about something. David talks about these in the book. This is very powerful for creating robust follow up questions and is has been studied scientifically.\n\nContacting David Hoffeld\n\nWebsite: www.hoffeldgroup.com\n\nBook: The Science of Selling", "duration": "10:06", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-022-.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1482757256, "title": "Know Your Audience", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nYou can spend all the time in the world marketing but you can spend a lot of time wasting your efforts. Time is very precious so the biggest thing we can share with you is how to be focused on who you are and who your audience really is. I think a lot of entrepreneurs have a problem with that because they think what if I miss an opportunity or miss someone who might have an interest? Today we’re going to talk about how to focus in on who you are and who your audience is.\n\nLaser focused \n\nIf I said to you let’s do an email blast of some of the things you’re offering, I have a list of five million names. I’ve had clients get excited about having five million names. In reality if I offered you 5,000 targeted names which would you prefer? If you can get a smaller number but they are targeted and they are your ideal client you can actually spend more time with them and be more effective and converted.\n\nPassion\n\nThe biggest thing is you have to have passion for what you do. Think about what you do and what part of it you enjoy the most. What is it you actually want to focus in on? You didn’t start your business just to make money. You started your business because you wanted to solve a problem and have fun. Whatever the products or services you’re offering focus in on what you’re most passionate about. Decide who you are and how you want to be perceived. Do you want to be perceived as someone who is funny, someone who is more serious or someone who is sciency? Focus in on that. You have an image you want to portray. Don’t paint a fake image, you want to be the real you but figure out what that is and then make sure you stick with it.\n\nOwn who you are, own what you’re passionate about and accept the fact that you’re the expert in what you do. That’s hard because a lot of people think it’s about ego but your customer is buying from you because they trust you. They want to know you’re an expert and are passionate about what you do. It has nothing to do with ego. They want to work with friends and connect with you at a different level. So it’s critical you start building this image of yourself.\n\nAudience\n\nLet’s go further now and talk about your audience. The biggest thing I can say to you is your audience is you years ago. Think about when you first got into your industry. In the beginning before you started your business you knew nothing. You were so nervous and you had a hundred questions. That’s your audience. So think of who they are and figure out how you can give them advice and how you can inspire them. The biggest thing is to start looking at who that audience is.", "duration": "10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-020-Know-Your-Audience.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1482411738, "title": "Connecting with David Hoffeld – Author of The Science of Selling – Part 1", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Our guest today is David Hoffeld, author of The Science of Selling. We’re going to talk about the science of sales and marketing. As entrepreneurs and business owners you often think about marketing as being a little scary, but David has truly developed a science behind it.\n\nAbout David Hoffeld \n\nDavid developed a new system that’s based on neuroscience, social psychology and behavioral economics. He has a method that’s going to help up rapidly increase sales. If you’ve ever looked for someone who has found a way to science marketing he has actually written the book on the subject.\n\nScience \n\nOften times the word science has been used very flippantly, especially in the world of sales. When David says it he literally means science. They have looked at academic journals from social psychology, communication theory, cognitive psychology, social neuroscience, cognitive neuroscience and behavioral economics. These have disclosed the factors that influence how our brains make choices and why we choose one product or service and not another.\n\nLayman’s terms \n\nThe book is not a textbook or journal article. It is practical, easy to read and easy to understand. There are very actionable ideas that you can use as soon as you put the book down but it is all grounded in science. There are hundreds and hundreds of foot notes in the book so if you want to get more into the research behind an idea you follow the foot notes and you can literally read the research for yourself.\n\nSelling\n\nUp until recently this science has been hidden away in academic journals and the only way to get it was literally to read academic journals and then connect the dots in the world of sales and marketing. There are some companies utilizing this in marketing but very few in sales because there really isn’t the academic research in the world of sales that would connect the dots as there is in marketing. Very few schools have courses on selling.\n\nYou can use these principals for sales or marketing. The book talks about marketing a little bit but it focuses primarily on selling. How do you ask questions? How do you gain certain commitments? What do you need to know to present your product or service compellingly? You can leverage the science in marketing as well and he talks about that a little bit in the book.\n\nQuick tips\n\nA lot of companies struggle when it comes to initiating customer conversation. David teaches them to leverage the science of a principal called reciprocity. Reciprocity is a social norm that says we should repay other people for what they have done for us. You leverage it by beginning with value. Don’t ask potential customers for things, give them something of value (an insight, a white paper, an eBook or whatever can demonstrate your expertise and provide meaningful value). In turn they will reciprocate by giving you their time and answering your questions and going forward in the sales process.\n\nContacting David Hoffeld\n\nWebsite: www.hoffeldgroup.com", "duration": "10:07", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-021-David-Hofeld.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1482152440, "title": "The Perfect Website – Part One", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\n80 percent of the people online use a search engine to find their product. 94 percent of website users make their first impression based on the designs. People search online and when they get to the website what’s their first impression of you and your company?\n\nPull up your website and do an analysis. Take a look and see if it’s time to update it. The biggest thing is going to be the graphics. A website has many components and if you don’t do right you will make a horrible first impression.\n\nOn our website we’re going to post a template of everything we talk about today. So whether you do your website yourself or have someone professionally do it the key is having the right things.\n\nHome page\n\nThe home page is critical. In the old days the home page would have to look good and then people would look around. In today’s world because we’re often on cell phones the majority of the traffic to your site is going to be from a cell phone or tablet. A lot of information has to be on that first page.\n\nWhat’s above the fold? \n\nIn the old days in New York when you rode a subway you would fold your newspaper a certain way while riding. They called it the subway fold. We use the same term on the internet. When you design your home page what’s above the fold? The fold is the same as the fold on your newspaper. To see anything below it I have to scroll. When I go to the home page I make my first impression. If I scroll down it means your professional, you have credibility and I’m staying.\n\nSimplification of the menu\n\n \tStart Here or About Me. This is where you tell your story and go into a little bit more about why they are here etc.\n \tThe Difference. What’s the difference between you and the competition? Is it technology, a different service etc. If it didn’t fit in the start here you can put it here.\n \tBlog or Podcast (you could also put more information, tips and resources etc)\n \tContact Us\n \tFrequently asked questions\n \tIf you are an online retailer you could put Shop at the beginning or the end. You want it at the far left or far right side of the menu, making it very simple.\n\nBelow the menu\n\n \tBelow the menu the main graphic should be a picture of you, the founder. This way people can connect with you and humanize your brand.\n \tNext to that a catchy headline. You want something that’s going to tell them why they are there.\n \tBelow that put a little bar with any awards you have won, media logos, media interviews and anything else that gives you credibility.\n \tBelow that put a call to action. It’s critical that this is above the fold. We call it a lead magnet.\n\nFocus above the fold. Keep it simple, make it catchy, give them the benefit of why they are there and get their attention so they will scroll down and take a look.", "duration": "10:02", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-018-The-Perfect-Website-Part-1.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1481806834, "title": "Inspiring Guest Dr. Joyce “The Dream Maker” Part 2", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nIn a previous episode we had a great, inspiring, guest Dr. Joyce. She’s called the dream maker because she makes dreams come true. We had to have her back because she does much more than that. We want to continue the conversation but get her involvement on Twitter.\n\nTwitter\n\nDr. Joyce works Twitter. She looks for interesting things to put up there. She puts up positive things that people like such as art, photography, food, travel, music and nature. People don’t know how to use Twitter. People post negative things, blatantly try to sell to you, do direct marketing and even show naked pictures which is just wrong and some of it isn’t pretty.\n\nFollowers\n\nDr. Joyce has over a million followers on Twitter. That sounds unbelievable but it’s not when you think about how hard she works. A lot of people are lazy and don’t want to take the time to go find an interesting article, put it in a bitly and put it up so people can go to it and read it.\n\nYou have to get involved on all the social networks. On LinkedIn you have to write articles and people will comment on them. That’s how you get to know people, by messaging back and forth. Dr. Joyce doesn’t do messages on Twitter because you can’t possibly direct message a million people. She sends them to her website and tells them to message her if they want her to answer them.\n\nFinding the time\n\nA lot of entrepreneurs don’t have enough time to go find interesting articles, not related to their business, and Tweet them to share themselves. What you do is re-tweet. If you put up an article and I liked it I would re-tweet.\n\nDr. Joyce helps people get followers by following them on their behalf for a small monthly fee. That has worked wonders because she has taken people from 7,000 to 30,000 followers. She doesn’t get fake followers, 99 percent of them are real. So when she follows someone they get higher numbers because she is giving them people she worked hard to get.\n\nDr. Joyce has a very busy schedule too. What she does is get up an hour earlier every morning and stay up an hour later at night just to do Twitter. You don’t have to not be busy to do Twitter. In fact with Twitter you will be busier because people will find you. Dr. Joyce has received offers to speak at organizations around the world for high fees and these offers came from Twitter.\n\nQuick tips \n\nPut what you find out people are interested in. If someone you’re following is a photographer then he’s interested in what other photographers are doing. So you go to photographer on the top and you search and you follow those people. You figure out which ones they might be interested in and put up a tweet just for them.\n\nInstead of the amount of followers it’s the amount of good followers you have. On Twitter you could take away 50-70 percent. They aren’t real. They signed up, put up one Tweet and disappeared. You want to get to the percentage that are real, that have a message to give that you like.\n\nContacting Dr. Joyce\n\nDr. Joyce website is www.DrJoyceNudson.com", "duration": "10:23", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-019-Dr-Joyce-2.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1481547643, "title": "Why You Should Be Blogging", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nOne of the best things you can do in marketing is blogging. You can do it through writing content or even through short audio or video podcasts. Today we’re going to talk about writing content. Blogging is a low cost form of marketing. If you aren’t blogging you are missing out. Today I want to share with you some of the benefits of blogging. Don’t let the word blogging scare you. It doesn’t have to be a lot of work.\n\nWhy you should be blogging\n\nBlogging is not only a low cost form of marketing; it’s a subtle form of advertising. You’re going to share all kinds of information so it’s a chance to do a soft sell. People come looking for information on whatever it is you do and you’re going to guide them. Think back to what you didn’t know before you got started. That is who your clients are. By sharing information your soft selling but it also positions you as an expert in your field so you’re accomplishing a lot.\n\nBlogging has to be on your own site. I’m going to defer guest blogging to a later episode. You want to blog on your site and later we’re going to take some of that content, repurpose it and use it to bring traffic to your site.\n\nSEO\n\nIf you write a blog on your own site and follow the rules and learn how to do it the biggest thing that’s happening is SEO (Search Engine Optimization). When people Google questions search engines are going to find you and show your blog as the answers to those questions. Google is going to help bring you visitors and that’s huge.\n\nHashtags\n\nYou don’t have to use hashtags in blogging. Google is going to look at the entire article, what words we use the most and the title. It is looking for keywords.\n\nWhat’s the question?\n\nWhen you write a blog you want to start with what’s the question? What are the top problems your audience has? How can you help them? In doing that and writing those articles you’re going to flood them with information and when those questions come up they will find you. You will get different audiences based on the questions they asked.\n\nInfluence marketing\n\nIn marketing today there is what’s called influence marketing. Advertisers find people who blog about a certain subject and pay them to blog about their products.\n\nEmpowerment marketing\n\nWe can’t push one single item or we will be a commercial. When you share from knowledge you’re guiding the person. I call that empowerment marketing. You are empowering the consumer to make the decision that’s right for them. At the end if should be obvious it’s you but you have helped them gain the knowledge. You’ve positioned yourself as an expert in the field, you have humanized the brand, you have engaged the person and they found you. Those things alone level the playing field.\n\nBlog length\n\nA good rule of thumb is 600 to 1,000 words. Nobody is going to sit there and read a ten page article. You are writing something that everyone wants to get the information out of quickly.", "duration": "10:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-016-Why-You-Should-Be-Blogging.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1481202026, "title": "Your First Hire Should be a VA", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nAs an entrepreneur, I must admit my days sometime get bogged down with some of the most tedious things in the world. They frustrate me because I don’t want to do them and they aren’t the things I’m the best at. You may not be in a position to hire someone full time yet; maybe you don’t have a whole team supporting you yet, so I’m going to tell you the best thing you can do. Your first hire should be a VA.\n\nWhat is a VA?\n\nA VA is a virtual assistant. It’s easy to say “hire someone full time” but when you’re building a business you don’t have the budget. It takes a lot of work to find the right person and a lot of things go with hiring somebody. Hiring a virtual assistant does so many things.\n\nThe biggest thing I can tell you as an entrepreneur who is building their business is focus on what you do best and delegate the rest. Make a list of all the tedious things you have to do every day. Write down everything you could use a virtual assistant for. It might be answering phones, handling your inbox, helping set up the SEO, proof reading, booking appointments, creating spreadsheets etc.\n\nIt doesn’t have to be one VA. You can do it on an hourly basis or a task basis etc. A VA doesn’t mean the person is across town and I have to interview them. I actually have a team of people across the globe that work with me every day.\n\nFiverr\n\nTranscription is something we need a lot, but not every day. I went to a website, found someone I love and locked them in and use them all the time (I actually have two of them that do it). The website is Fiverr.com. Everything on there is five dollars. You can get graphics done; have someone touch up your SEO, etc. A lot of them don’t have much experience but some of them have college degrees. A lot of them are in other countries so five dollars is a lot more to them than it is to us. Someone in Jamaica does my transcription and I pay five dollars for every ten minutes of audio. For an hour long show for twenty or thirty dollars you can have somebody transcribe it perfectly.\n\nUpworks.com\n\nAnother great one is upworks.com. I found someone there who is phenomenal. You can find something in almost every category in any country. You might want a publicist or someone who is good with package design. You can find people to do video voice over’s, people to record videos for you, people to do testimonials, people to visit your website and get the likes up. The key with upworks is because someone is working remotely you start worrying about how can I control them? If I hire an employee 40 hours a week I have to take care of all the taxes etc and with these services I don’t have to. I also don’t have to keep them busy. They are on a clock to do a project. You can do flat rate per project or ongoing.", "duration": "10:03", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-017-Your-First-Hire-Should-Be-A-VA.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1480942854, "title": "Five Types of Facebook Posts", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nToday we’re going to talk about some of the types of Facebook posts you can do quickly to get the most engagement out of them and get the most out of being on social media. You might have a lot of followers but they aren’t all interactive. The same applies even on your personal page with your friends. You can have a lot of friends but you aren’t going to see all their posts because on Facebook they look to see who is interactive. The more someone likes and comments the more it’s going to show up in additional newsfeeds of your friends or followers and grow organically.\n\nFive Types of Facebook Posts\n\n\n \tHumorous or inspirational quotes. Have a lot of these stored in a word document so you can copy and paste when you’re in a hurry. These are the easiest thing to post because they bring a smile to people’s faces and they like that.\n \tQuestions. For example “I’m going to the beach this weekend, what are you doing?” Your followers just learned a little about you and they can share what they are doing too.Ask yes or no questions. If you are launching a new product or anything you can post “do you like A or B better?” You will get interaction as well as great feedback from your customers.No matter what people post if nobody comments or likes it Facebook says it’s not that important and we’re not going to show it to that many people. You will often see questions or comments where people will say do you like this or that? It’s hot out here today, is it cold where you are? Everytime people respond and comment the interactions go way up. If they just like it it’s rated at one level, comments go even further and if they share it on their page it’s even stronger.\n \tA picture is worth a thousand words but on Facebook it’s worth a million. You can use different sites to create a lot of graphics. I use one called Canva. In seconds I can create an image and hit a button and it will automatically resize it to fit all the different social media. Don’t go to Google and steal images. You want images you took or have the rights to. On our website we list a couple places where you can download some for free and some for $1.00 a piece. Don’t steal other people’s images or you can get in trouble. Imprint your logo (subtly) at the bottom of the picture.\n \tVideos are another quick one. Do some demos of your product, some heartfelt videos of you describing you what you do, your elevator pitch or share tips. Keep them in the 1-3 minute range (1-2 is preferred).\n \tHold contests (such as a Trivia question) where people can get some kind of benefit from answering.Call to action. We talk often about 80 percent of the time being engaging and 20 percent selling. What do you want the person who is following you to do next? The key is to be engaging and have fun.", "duration": "10:09", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-015-5-Types-Of-Facebook-Posts.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1480597226, "title": "Inspiring Guest Dr. Joyce “The Dream Maker”", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nWe have an inspiring guest today, Dr. Joyce Knudsen. She’s an entrepreneur who changes people’s lives. They call her the dream maker because she makes people’s dreams come true.\n\nAbout Dr. Joyce\n\nThe main thing Dr. Joyce does is inspire people to do things they don’t think they can then walk them through the process of how to do that.\n\nExample\n\nDr. Joyce helped a professor at Vanderbilt who was smart and had everything except she didn’t have the right look. She looked more like someone going to the store on a Sunday in her slippers than a professor at Vanderbilt. Dr. Joyce helped her with her outside appearance by taking her to a beauty shop and taking her shopping. She also taught her things to say and do in the communication world that would get her even further than she already was. When Dr. Joyce was invited to be on a talk show in Nashville she invited her to come with her. It was great; she was beaming and had so much more confidence.\n\nAha moment\n\nDr. Joyce’s “aha” moment started when she was a little girl. She came from a poor family with seven children. They were not given opportunities. She learned that sometimes the things we can’t change end up changing us. She decided she wanted to become someone who could help people look and feel great so they could accomplish what they wanted by getting that other stuff out of the way.\n\nBiggest obstacle\n\nThe biggest obstacle for Dr. Joyce was money. Her parents sent her to beauty school because there wasn’t money for college. She would work a year and go to school for a year and did this until she graduated. She didn’t get her PHD until she was 52. She wasn’t going to stop. She kept going and learning because that’s what you need to do if you want to keep being successful.\n\nAdvice\n\nYou need to connect with the people that you’re talking to. People like Dr. Joyce because she connects with them, she cares about them and she wants to help them. Everyone else is either trying to sell you something or trying to talk you into something they are doing. She doesn’t do any of that. Everything she says is about trying to sell her. When people like you they will buy from you. The first thing is you have to form that relationship so they will like you, otherwise they don’t even know you. Just be real and be who you are and people will like that person.\n\nFear\n\nDr. Joyce is vision impaired so she’s not supposed to be doing anything she is doing. She’s been doing it since she was two and hasn’t stopped. What good does it do to feel sorry for yourself? Around 80 percent or more people don’t have good self esteem. A lot of people let the negative or fear of how they will be perceived get in their way and they just need to overcome that. No one is going to come to you and change things; you have to make the change yourself.\n\nContacting Dr. Joyce\n\nDr. Joyce website is www.DrJoyceNudson.com", "duration": "10:15", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-019-Dr-Joyce-1.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1480338033, "title": "Five Social Media Mistakes that Could Hurt Your Business", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nSocial media is critical to building your business, but there are so many mistakes people are making without realizing how they are harming their business.\n\nFive Social Media Mistakes\n\n \tDon’t disappear from your social media. Don’t ignore social media. If you can’t do all the social networks then don’t be on them. Get on the ones where your ideal customer is and then be active and have fun on a couple of the networks. You don’t have to be everything to everybody.There is no point in setting up a Facebook, Twitter, Instagram or whatever networks you choose to be on if you’re not going to be active. On Facebook you do not see something from every single friend in the newsfeed, there is no way you could. Facebook will only show posts from someone who is interacting with you. If you stop posting on your business page and come back after a few months it’s going to take awhile to build up that interaction again.\n\n\n \tDon’t always be selling. Everybody in business gets so caught up in trying to sell. People on social media don’t follow you because they want to buy from you; they follow you to learn something from you. When you’re posting your engaging them and teaching them new ways to use your product. They come for the social aspect, not to see an ad. If you’re going to constantly promote and try to sell you are going to lose followers faster than you got them. Don’t constantly sell. 80 percent of what you post should be engaging and fun and 20 percent should be selling.\n\n\n \tPublishing boring content. Don’t bore people with too many selfies. Your family might want to see them now and then but in general they are going to be boring after you have seen a couple of them. If you want to post a picture do something funny. If you make it fun people are going to be more interested. They say a picture is worth a thousand words but in social media it’s worth a million.\n\n\n \tDon’t be too corporate. Don’t try to be too formal. It’s a social network. In the old days if you were an entrepreneur you always wanted to sound big business so people would want to do business with you. Today it is reversed. You want to be personal. People don’t want to do business with big companies anymore; they want to do business with people they can relate to.\n\n\n \tNot replying and responding. When someone makes a comment on one of your posts, like it and let them know you saw it and that you appreciate them. You might want to make a comment now and then. You don’t have to comment on every single one, that takes a lot of time, but a simple click takes seconds.\n\nFinal word of advice\n\nWhen you’re in a hurry say thank you or hit a like but now and then go out of your way to those who are dedicated to you. How would you feel if it were the other way around? Interact with your follows and clients and when posting check the grammar and spelling.", "duration": "9:59", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-014-5-Social-Media-Mistakes-That-Could-Hurt-Your-Business.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1479992451, "title": "Leveraging the Power of Pinterest", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nToday I want to share with you how to get started with Pinterest. You might think of Pinterest as a fun place to go for recipes and looking at different DIY’s but it is one of the greatest places to go to get new clients and get them engaged with you and convert them to actual customers who buy your product or service. Each of the social networks has their reason for being but Pinterest is one of my favorites for converting to actual purchases.\n\n87 percent of the Pinterest audience is female. Women make most of the buying decisions. Women trust Pinterest more than the users of Twitter and Facebook. 47 percent act on Pinterest offers versus 33 percent with Facebook and 31 percent with Twitter. While you still get a great response on Facebook it’s significantly higher on Pinterest.\n\nHow to get started\n\n \tGo to business.pinterest.com, follow through the questions and set up your business\n \tIt will ask for a user name so pick one that’s close to your website name or business name. It’s limited to 15 characters so you may have to abbreviate it.\n \tUse the elevator pitch in the about section like we’ve talked about in other segments.\n \tPut your website address and links to your other social media accounts so when people come to your Pinterest page they can quickly link over.\n \tGet an 800x800 graphic pixel size cover. It’s like a billboard so put the benefits of your company. Visit our website for ways to get that done. You want professional graphics.\n\nBoards\n\nWhen someone goes to Pinterest they will see your billboard across the top and underneath that they will see five boards. A board is like a wall on Facebook. You can create five different boards, each one with a different topic. You can have many boards but when someone comes to your page they will see five across their horizontally and have to scroll down to see others. So these are the five most important ones.\n\nFive board suggestions:\n\n \tAbout you. This is where you put anything that shows off your personality and fun things about you that let people connect with you on a personal level such as quotes, hobbies, etc.\n \tThings of interest. These are things you have found on Pinterest that you think might be of interest to your clients.\n \tAround town. If you’re a local business this is perfect. Start posting things regarding local businesses, restaurants, charities, fun things to do and events.\n \tTips, fun ways or benefits of using your product or service. This is just different fun ways of whatever it is that you do. Give different tips on how they can get the most out of it.\n \tBusiness side. This is where you put the products or services you offer.\n\nTips\n\n \tThe Pinterest graphic has to be beautiful, eye catching and professional.\n \tWrite a description under the graphic\n \tStart with a benefit, grab their attention.\n \tUse hash tags and keywords they will be searching for\n \tLink the pin to your website.\n \tStart getting followers. Email your database email system and let them know you are on Pinterest. Announce it in the newsfeed on Facebook.", "duration": "10:08", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-013-Leveraging-The-Power-of-Pinterest.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1479733243, "title": "Get on Twitter and First 1000 Followers", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nTwitter may not be one of the social media networks you’re on. When people mention social networks they often think of Facebook or Instagram but Twitter is great for business to business, expanding your audience and reaching out. Not being on Twitter is a mistake. I invite you to get on Twitter if you don’t have an account yet. I’ll admit it’s hard to follow but get on there and you’re going to have a blast in no time.\n\nGo to Twitter.com and register your company. Go through the steps and set up your company. It will ask for a user name and you want to choose on that’s similar to your domain name or your business. You do have a limited number of characters so you may have to abbreviate a little or play around with the name.\n\nGraphics\n\nCreate your graphics and make them look professional. There are two graphics here:\n\n \tProfile picture. It’s a 400 x 400 pixel. Every time you tweet that’s what people will see.You want it to be associated with you and branded with you but don’t just use your logo. If you put your logo it looks too corporate. Create a graphic that has you in it. You might also include your logo in there or a banner or bar with colors that tie into your website.\n \tCover picture: This is a 1500 x 500 pixel. When people click on your profile picture it will take them to the top of your Twitter page. This is your cover or main banner across the top. That’s where you want to put more information about your company, different awards or whatever will show who your company is.\n\nSetting up a Twitter page\n\n \tFill out information about your company\n \tUse the elevator pitch we created in a previous segment\n \tMake sure to list your website URL so people can link over to your website\n\nBuilding followers\n\n \tPost inspirational quotes that are related to your business and that will inspire people.\n \tContinue tweeting. It doesn’t have to be every day but don’t go weeks without it.\n \tA website called Tweet Juke Box can be set up to post an endless supply of great quotes\n \tUse the right hash tags and don’t get crazy with them. Use hash tags people are looking for. The website ritetag.com lets you check different words and see how they are doing in the hash tags.\n \tWhen people follow you, follow them back. This is common courtesy and it helps you get more followers. If you don’t like what they post or they don’t post often you can always unfollow them later.\n \tSee who is following your competitors and the influencers in your field. Go through that list and start following those people. You will find a lot of them will start following you back. A great website that helps with that is crowdfire.com. They will help you find influencers in your field so you can start following people.", "duration": "10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-012-Get-On-Twitter-And-First-1000-Followers.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1479387656, "title": "Inspiring Guest Andrea Donsky", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nOur guest today is Andrea Donsky. She is a dear friend of Lisa Davis and co-host with her on Naturally Savvy Radio. She’s the creator of the fantastic websites naturallysavvy.com and thehealthyshopper.ca\n\nAbout Andrea\n\nAndrea runs two companies in a natural and organic world. The first one is www.thehealthyshopper.ca which is a coupon book for natural and organic products based in Canada. They give them out in health food stores across the country.\n\nShe also runs www.naturallysavvy.com which targets the U.S market. They educate people on how to live a healthier lifestyle. It’s about making better choices and finding products that have cleaner ingredients.\n\nAndrea’s “aha” moment\n\nAndrea went to school to become a nutritionist because she was having a lot of stomach issues. She started thinking that she was doing so much research and reading she could not get her hands on enough information to really change her life. She decided if she was going to back to school and change her life why not help others as well and look at the bigger picture? She realized it wasn’t about her. It was about everyone around her that were eating foods everyday that they could be making better decisions about.\n\nBook\n\nAndrea has a book Unjunk your Junk Food: Healthy Alternatives to Conventional Snacks\n\nBiggest challenge\n\nWhen they started their coupon book 16 years ago in the year 2000 it was a new industry and no one was really couponing yet. It was a big challenge teaching companies that they needed to offer coupons for organic and natural products, especially because products are very expensive in Canada. They also had the challenge of educating retailers, the health food stores who carried the coupon books. Getting the word out about the coupon book was an additional challenge.\n\nAdvice\n\nAndrea has a note on the back of an old torn up business card of her husband’s from 16 years ago. When she started her company 16 years ago a woman passed the mantra along to her and said “don’t give up, this is your passion, this is meant to be, do it.”\n\nThe mantra is “My glorious future my heart is open to you. Please come sit in my heart and ____. Thank you for ____.”\n\nFor the first two years Andrea carried that card with her and said that mantra every day. It helped ground her and bring her back into the present. It helped to remind her why she was doing what she was doing.\n\nGoals\n\nThey are a media company that is about getting the word out and educating people. They are an online company and are now also going into the TV realm across the U.S and Canada. Their goals are to keep growing the TV part and the media part and continuing to educate people on living a healthy lifestyle.\n\nContacting Andrea\n\nAndrea’s website is www.naturallysavvy.com and they are naturallysavvy on all the social media.", "duration": "10:07", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-009-Inspiring-Guest-Andrea-Donskey.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1479128429, "title": "Create Your Facebook Page and Get 100 Followers", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nToday we’re going to talk about setting up a business page on Facebook. You probably already have a personal page but it’s important to set up a business page. A lot of people aren’t comfortable sharing business on their personal page and probably shouldn’t anyway. You don’t want people getting personal information you don’t want them to have.\n\nSetting up a business page\n\n \tLog into your Facebook account and click on the little icon or lock in the top right corner.\n \tFollow the steps as it walks you through setting up the page.\n \tWhen it asks you to select a category choose brand or product. Usually they will let you pick your website address at that moment (facebook.com/pagename). If you choose some of the other categories it might not let you name it until you have 25 followers.\n \tPick a name that’s easy for people to remember and one that’s similar to your business or website address.\n\nGraphics\n\nThere are two graphics that are critical:\n\n \tProfile: This is the small icon that everyone is familiar with. Use a picture of yourself so people get to know you. You can also have a graphic created with a bar above and below with the name of the company or something about your product.\n \tCover: This is more of a graphic that’s going to support the page. People see it at the top so treat it like a billboard. Don’t just put a product shot, put some information. Put some of the benefits of why they should want your product up there. Use professional graphics. Often people take any picture and put it up and it will show it’s an amateur site.\n\nLooking professional\n\nThere are several ways to look professional. You don’t have to spend a lot of money. Here are two sites we love.\n\n \tFiverr: you can find almost anything you want for $5.00.\n \tCanva: you can upload pictures and they have predone designs. If you aren’t a graphic artist you can do professional designs perfect size and professional looking.\n\nFill out all the blanks Facebook gives you and don’t forget the about page. This is where people will learn about your company and this is where you want to put your elevator pitch.\n\nMake sure to include your website address, phone number and anything else so they can contact you.\n\nStart posting a few things. When you start asking people to come to the page who is going to want to look at a blank page?\n\n80/20 rule\n\nFollow the 80/20 rule. 80 percent of the time be engaging, don’t sell; provide tips for your users. 20 percent of the time post something related to sales like a special promotion you’re doing.\n\nGetting followers\n\n \tGo to your friend list and invite everyone to like your page.\n \tGo to your closest friends and send them a private message and ask them to like it and share it on their pages.\n \tContinue posting on the newsfeed. People will share them on their pages. You can put at the bottom of the post “if you like this share it”. The more likes and shares the more it goes viral into the various news feeds.\n \tYou have an email list for your business. Take that and send out an announcement that we’re now on Facebook and put a link to it. Offer a special prize or discount to those who come like your page.", "duration": "9:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-011-Create-Your-Facebook-Page-And-Get-100-Followers.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1478782819, "title": "Inspiring Guest Wendi Blum", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nThere are so many different entrepreneurs out there in so many categories. Some are so inspiring because they faced the decisions we’ve had to make and challenges we’ve had to face. That’s why I love these segments where we get to bring on another entrepreneur and talk to them.\n\nToday our guest is Wendi Blum. She’s a globally recognized speaker, a published author, a business strategist, retreat guru, and she’s helping light the way for men and women in leadership, entrepreneurship and empowerment. She does live workshops, online webinars and activation retreats around the world.\n\nWendi’s “aha” moment\n\nWendi had been working in the pharma industry for two decades. She liked what she was doing but still felt like something was missing. It goes back to the roots of passion and purpose. She fell into her career unintentionally like many do. She went to college, got a degree, started thinking about a job, paycheck and building a career. She didn’t know what she didn’t know. She started to want, desire and seek something more. She started on a path of self-development and hired a coach. She started writing out new goals and looking at life and business a little bit differently.\n\nRetreat workshops\n\nWendi focuses on the mindset piece. Helping the client create the vision and get really clear about what they want to create. She is doing two things this month on the topic of momentum. Kicking in momentum, getting results and getting things done.\n\nBiggest challenges\n\nWendi’s biggest challenges were:\n\n \tHow to do it. Where do you begin? Who do you trust?\n \tHow do you overcome the fear? You’re embarking on a brand new journey and exploring new terrain so there is fear of the unknown. There’s also fear of failure, fear of embarrassment if you fail, fear of not knowing where to start and fear of being imperfect and making a mistake. Fear can put roadblocks up everywhere we turn.\n\nWhat gets Wendi out of bed in the morning?\n\nWhat excites Wendi and gets her out of bed in the morning are the stories the clients share and their results and successes. Wendi’s new student client Dennis had a dream for 15 years of writing a book about beauty from the inside out. He came to one of her workshops and then a second one. He mapped out the process within 45 days and just picked up the copies of his new book The Zen of Beauty last week. These are the stories that excite Wendi.\n\nResources\n\nWendi is giving away a business planner as a gift for everyone.\n\nContacting Wendi\n\nWendi’s website is www.wendiblum.com", "duration": "9:56", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-008-Inspiring-Guest-Wendi-Blum.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1478523648, "title": "The Power of Social Media", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nWe all hear the word social media. Many of us are on Facebook but a lot of us are afraid to use the different networks to build our business. Today we’re going to talk about the different social media, why you can use it and how to use it.\n\nSocial media\n\nA lot of people don’t realize how much social media can help your business. For one thing it levels the playing field. In the old days you had to spend a fortune to advertise your company. But today you can get your voice heard through social media. You can outreach not just to get new clients but to engage your current client.\n\nSecurity\n\nYou have to be really clear on your intentions when you go on social media. You might get messages from people who want to talk about more than just whatever kind of business you have. You have to be careful. Make sure you just bring up your business information and don’t give out too much personal information. Don’t use your personal page for business, set up a separate page.\n\nStatistics\n\n \t75 percent of consumers ask their friends on social media before they buy anything. If you’re only sharing with family and friends on your Facebook page you are missing the audience. They are going to go to your competitor. It’s imperative to get out there and start setting up your business pages.\n \t81 percent of people say their friend’s posts directly influence their purchasing decisions.\n \t60 percent of people visit a company Facebook page before buying. Not only are they listening to their friends, they are going to the company business page to see if there are any promotions or discounts before they make a purchase.\n\nYou want to be on all the different networks, have reviews on there, be engaging and people are going to make a judgment about you and see if they should come buy your product.\n\nThe Big Five\n\n \tFacebook: This is the greatest place to engage, keep your clients up to date and post events and promotions. Facebook is also a great way to get to the older clientele, attract them and get them involved.\n \tInstagram: This is almost like a billboard to keep your brand in front of people.\n \tTwitter: This is great for business to business and to gain influence and credibility. It’s not the greatest place for engagement but is a great way to promote yourself if you’re building a business.\n \tLinkedIn: This is a great place to build information and build yourself as an influencer get speaking engagements and find clients.\n \tPinterest: This is not last because it’s the least favorite. When you have consumer products it actually has the highest conversion rate. The reason for this is often it’s the woman making the buying decision and they are following looking for different hash tags or keywords. They find information, search it out, see a picture, little description and if the company links it back over to their website the purchasing page they can have a high conversion of it.", "duration": "10:02", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-010-The-Power-Of-Social-Media.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1478160047, "title": "Gordon Tredgold – The Leader’s Leader – 10MM-006", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nOur guest today is Gordon Tredgold. He’s won an award for the Top 100 Influencer In Digital Transformation. He’s worked for over 25 years in senior leadership positions for Fortune 100 companies. He’s a turnaround expert that companies often call in when they have a failing project. He’s managed teams of up to 1,000 people and departments of hundreds of millions of dollars. He’s someone who truly understands leadership. He’s published three different books; he has over 900 leadership articles, and he contributes to the Huffington Post, Inc, and Entrepreneur.\n\nGordon’s “aha” moment\n\nGordon’s aha moment was when he started writing on leadership and found there was a big demand for it. People started reaching out, connecting and sharing his content. Gordon makes things accessible and puts them in simple easy to learn terms. He learned there was a demand for this skill from companies and people.\n\nGoals\n\nA coaching client asked Gordon to help her with her goals of time management and organization. He told her those aren’t goals; those are the tools you use to achieve your goals. He asked her what goal she was after and she said she didn’t know. He said that’s probably why you aren’t hitting it then. If you don’t know what your goal is your chance of hitting it is pretty low.\n\nGive yourself permission\n\nOnce people understand what it is they want to do a lot of it comes down to giving them permission. A lot of people know what they want to do, but they are afraid to articulate or give themselves permission.\n\nWhat’s stopping you?\n\nWhat’s stopping you is a lack of belief that you are going to be able to do it because you don’t know how to do it. Either a dream is viable or just not feasible (like Gordon’s dream of being an MVP of the NBA as a 5’6 white man over 50). If the dream is viable, then go for it. Most people fail to start. People aren’t afraid of hard work; they are afraid of failure. When people can’t see how they will succeed, it stops them from starting.\n\nFigure out first what you want to do and then how you are going to do it.\n\nGordon’s biggest obstacle\n\nWhen Gordon was 16 when his English teach told him he would never be a writer. This stopped him from being a writer for a long time. He also thought he had to write like William Shakespeare or Charles Dickens, which he couldn’t do. It wasn’t until he decided to stop listening to his old English and just write the way he talks that he became a writer.\n\nOne thing we can’t live without\n\nWe can’t live without belief in ourselves. We can’t outperform our own self-image. You need to find something that’s going to give you positivity about yourself.\n\nContacting Gordon\n\nGordon’s website is www.GordonTredgold.com", "duration": "10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-006-inspiring-guest-gordon-tredgold.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1477900842, "title": "Developing The Perfect Elevator Pitch – 10MM-005", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nWhat do you say when people ask you what you do for a living? Do you turn into a deer caught in headlights? Today we’re going to change that. And I’m going to show you how in 20 seconds you can win people over. I’m going to help you craft a perfect elevator pitch that you can use everywhere you go.\n\nWhat do you want to be known for?\n\nWhat does your business do? Focus on who your ideal client is. Forget all the features and technical jargon and just focus on the benefits and solutions you offer.\n\nNutshell \n\nSometimes there are so many things we do that we really need to get it into that nutshell. A lot of people want to talk about their background etc., and people stop listening. You have to win them over in the first couple seconds. So very simple I’m going to give you a couple of fill in the blanks.\n\nI’m a _________. That’s what you do.\n\nSo in this case, I’m a marketing expert. I’m your online marketing mentor. \n\nI help _____________________(your ideal client or intimate category). In other words, who do you help?\n\nFor me today it’s entrepreneurs. We’re online marketing mentors that help entrepreneurs. \n\nLet’s keep going. I’m a _______. I help ___________. To do what? ________________ In other words, what do we help people do? This is where you want to put in the benefit of your service.\n\nWe help people get new clients and take their business to the next level. \n\nNext, so they can do what? What’s the benefit of all this? _______________________\n\nSo they can earn more revenue, have a successful business, not go out of business, and find more time to spend with their families to achieve their goals and to do what they’re passionate about. \n\n \n\nI’m a ________. \n\nI help _______ to _______ \n\nso they can______.\n\n \n\n \n\n \n\nIf you think of those things,   then be prepared to answer them real quickly.\n\nImagine you and I meeting for the first time and after you ask what I do I say “I’m a marketing mentor. I help entrepreneurs to take their business to the next level so they can be successful.”\n\nBusiness Cards\n\nYour elevator pitch is to engage them and get their attention. If they’re your ideal client, the person is going to engage with you and keep talking. But, it’s all pointless, if you just end the conversation and walk away. Exchange business cards or phone numbers. One of the key elements of an elevator pitch is the very end. Get the information to help follow up. If you are down to your last business card, take a picture and text it to them. By doing this, they have your card, and you now have their phone number.\n\nBe approachable\n\nBe approachable in crowds. If you are looking down at your phone in Starbucks, nobody is going to speak to you. If you are trying to build your business get out of your comfort zone, put your phone away, make eye contact, uncross your arms and wave and smile at people.\n\nKey takeaways\n\n \tPractice it\n \tMemorize it\n \tBe open and approachable and start meeting people everywhere you go.\n\nTemplate\n\nIf you go to the website www.The10MinuteMarketer.com you can download those sentences that are on a template. You can fill in the blanks and practice it and fine tune it so you are comfortable with it.\n\nTo-Do Items\n\n \tVisit the website and download the template.\n \tGet in front of a mirror and practice your elevator pitch", "duration": "10:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-005-perfect-elevator-pitch.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1477555242, "title": "Lisa Beres – Living Her Dream – 10MM-004", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nOur guest Lisa Beres is living her dream. She and her husband have built a business around helping others. She is a healthy home expert, published author and professional speaker. You might have seen her on TV on Rachael Ray, Dr. Oz, Today Show, Fox and Friends and many others. She’s developed a business around improving your health via and has an online program called Change Your Home, Change Your Life.\n\nLisa’s “aha” moment\n\nLisa’s aha moment was a big one. She got really sick from toxins in her newly remodeled home. She thought she was living a healthy life by eating right and exercising, but that is just one piece of the pie. Another huge piece of the pie is the environments in our homes. We spend 90% of our lives indoors, and that is contributing to our health, wellness, energy and long-term illness.\n\nWake up call\n\nLisa became a building biologist through this process. That is the study of how buildings affect your health. She realized the chemicals in her house were directly related to her health and hormones. Many people, men and women, have hormonal issues because these chemicals are hormone disruptors. By cleaning up her environment and learning, she changed her life. She now has better health and more energy than she did before.\n\nWarning signs\n\nSome people get headaches and other warning signs, but other don’t and it sneaks up on them. If you have a lowered immune system, you will notice it quicker than others. We are all being affected whether we get symptoms right away or not. Nobody is immune to toxin overload because we have polluted air, toxic water, and polluted products coming into our home in personal care and cleaning products. If you are getting symptoms, thank your body for telling you. If you aren’t, you should still listen to the experts and make some changes.\n\nBiggest challenge starting the business\n\nThe biggest challenge Lisa and her husband had when they started their business was prioritizing and honing in on what the most important details of the business were. They never wanted to miss an opportunity, so they just said yes to everything. As a result, they bit off more than they could chew and became depleted. They got off track and lost focus on what they started and what their mission was.\n\nHaving a clear, focused business mission is important. It’s nice to have opportunities, but you shouldn’t say yes to all of them. You have to learn how to say no personally and in business.\n\nWhat gets Lisa out of bed in the morning?\n\nThe number one thing that gets Lisa out of bed in the morning is the change she has personally experienced and knowing how much better her quality of life is. She loves waking up every day knowing how much better her life is through the changes she’s made, and she wants to share that with other people. So many people live miserably. They are medicated, loaded up on drugs and sedentary. You don’t have to live like that. It’s an option. You have to choose health. Yes, you have to put a little work into it but you can do it, and Lisa is living proof.\n\nHelpful tip\n\nYou have to become part of a community. Whatever your entrepreneurial focus is, get with like minded people. Lisa joined health-focused groups and networked with them. You need a support system, even if you are working with your spouse as Lisa is. You need a bigger support system.\n\nLisa joined an all women network, with people all over the world. They teach you from the beginning step by step how to start an online business today.\n\nContacting Lisa\n\nLisa’s website is www.thehealthyhomechallenge.com", "duration": "10:12", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-004-inspiring-guest-lisa-beres.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1477296017, "title": "Start Building Your Personal Brand – 10MM-003", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nImagine bypassing the total sales process and having your ideal customers coming to you. By building your personal brand you are transforming yourself into the go-to guru in your field. Today we’re going to share some tips on building a personal brand.\n\nConnect\n\nPeople want to connect with a brand. People want to know somebody cares about them. By positioning your personal brand this way it will help people connect with you.\n\nHave an about me page, start signing all your emails, start posting and sharing your image and getting people to connect with you. Embrace that you are an expert in your field but think of all the things you didn’t know when you first started. Those are your customers.\n\n80/20 Rule\n\nIn social media, 80 percent of your posts need to connect with the audience and only 20 percent should be selling what you do. Put your customer first and be their advocate. They will come to you when they are ready. Don’t worry about selling to them. Connect and let them know you know what their problems are and how you can solve them.\n\nGet a Professional Headshot\n\nWhen it comes to your personal brand it’s imperative to have a great picture of you. It doesn’t have to be a glamour shot, but mybe show something in action. If you are on the radio it could be you in front of a microphone. It’s about health it could be you outdoors doing something healthy.\n\nBe Discoverable Online\n\nSet up a Facebook business page and start posting there. Set up other social media pages, register your domain name and get out there. Don’t hide; you want people to be able to discover you. Once they start learning your name that is your brand and they will start searching for you so make sure you’re able to be found.\n\nWrite Down Your Professional Purpose\n\nWe all got into business for a reason. But what makes you get out of bed every morning? Why do you do what you do? What are you passionate about? That’s most likely the business you are in. Who are you serving? Get a focus on that. When building a professional brand that’s important.\n\nSelf-Awareness\n\nHave self-awareness of what you know and what you have yet to learn. You’re an expert in your field but practice some empathy. You are going to find there are some things you don’t know so if someone comes up with a question you don’t know you don’t have to be a know it all you can easily say that’s a great question I’m going to research and get back to you.\n\nTo-Do List\n\nTake ten minutes and re-listen to this segment and complete the steps above. There’s a lot more fun to come but we’re creating a foundation here. Go through the steps we’ve listed and jot them down and be ready for the next podcast.", "duration": "9:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-003-starting-your-personal-brand.mp3", "type": "episode", "tags": []}, {"seriesId": 1167526085, "seriesTitle": "The 10 Minute Marketer", "pubDate": 1476950403, "title": "Cornell Thomas – Power of Positivity – 10MM-002", "author": "David Pollock - The Go To Guru In Marketing and Lisa Davis", "summary": "Show Summary\n\nIn each segment, we talk about taking your business to the next level and we like to have fun talking about marketing. But, you are not alone. You are not the only entrepreneur out there. We all wonder if we’re the only ones with these obstacles. Today we have an inspirational and motivational guest with us, Cornell Thomas.\n\nCornell’s background\n\nCornell is a former professional basketball player who pulled his Achille's tendon. This took him on a path of coaching kids in basketball. In the last five years, he has discovered his true purpose which is serving others and helping people be motivated and inspired to find their purpose. He has written two books, he travels the world speaking and has two businesses. Crossroads Basketball is his basketball business and his other business is the Power of Positivity LLC.\n\nSocial media\n\nSocial media is a very powerful tool.  Most people are under the assumption that when you're doing social media, that you have to do it for 15 hours a day and that is completely incorrect. Cornell does social media about 15 minutes a day. If done correctly, social media can be a very powerful tool.  It's not as time-consuming as some people make it out to be.\n\nCornell’s “aha” moment\n\nOne day four years ago Cornell was on Facebook and noticed his timeline was full of the most negative garbage he had ever seen. He decided that day he was going to start a new positivity movement. He had a book of positive quotes, and he would post one every day. Even people who were pretty negative started to like the quotes. One day he couldn’t find the book, so he decided to make up his own quote. People still liked it so he decided to forget the book and keep making up his own quotes and people really responded to that.\n\nBiggest challenge\n\nChange your definition of success. Success is different to everybody. If you look at success just in terms of finances, Cornell isn’t a success because he doesn’t live in a mansion or drive a Lamborghini. Society views success as being a millionaire. To Cornell success is helping to change one person’s life for the better every single day. Cornell considers himself a success every day because of his quotes and interaction.\n\nWhat held him back in the beginning was wondering if people wanted to hear his message. It’s the same with business owners who ask who is going to buy this product? If you have this idea, there’s a reason for it. You don’t know the whole planet. Don’t assume people won’t love what you have to offer. Just go out there and believe in yourself and do it.\n\nWhat excites Cornell and keeps him going\n\nWhat keeps Cornell going is knowing that he’s speaking somewhere in front of people he’s never met before.\n\nHelpful tool\n\nWrite down what you want out of life. Write down your goals. Don’t just write them down but go through them every day and read them.\n\nContacting Cornell\n\nCornell’s website is www.powerofpositivity.net", "duration": "10:10", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/86/47/26/8647268d-8af3-4ff7-d14e-481110a889b4/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/the_10_minute_marketer/content.blubrry.com/the_10_minute_marketer/10mm-002-inspiring-guest-cornell-thomas.mp3", "type": "episode", "tags": []}]}