{"series": {"feedUrl": "http://www.bbc.co.uk/programmes/b006qpgr/episodes/downloads.rss", "genres": ["Performing Arts", "Podcasts", "Arts"], "title": "The Archers", "country": "USA", "author": "BBC Radio 4", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "type": "series", "id": 265970428}, "episodes": [{"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488758400, "title": "06/03/2017", "author": "BBC Radio 4", "summary": "Miranda makes herself clear, and Toby arrives just in time.", "duration": "795", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04vfd54.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488672000, "title": "05/03/2017", "author": "BBC Radio 4", "summary": "The B&amp;B guests at Grange Farm want their bed linen changing. Eddie grumbles; they should be charged for extra laundry. Clarrie's sanguine about it, though she does remark that they're getting through a surprising amount of loo roll. Eddie's pleased to receive another enquiry, and gets on to it straight away. \n\nWhile Harrison searches for Roy to enlist him in coaching the female cricket recruits, Lynda collars him about speeding in the village. At nets Roy observes that whilst Molly's not a natural, she has more promise than Lily. He and Harrison agree Anisha has potential. Harrison was hoping for a higher standard, but Roy assures him he's doing all he can. \n\nAt the Health Club, Harrison tries to be pleasant to Miranda, who airily dismisses him. She's waiting to report a fault in the ladies' changing room, but irritable Kirsty's dealing with a phone call. When Kirsty snaps at her, Miranda asks for the name of her manager. When Lynda asks Kirsty about it, Kirsty launches a scathing attack on the hotel's clientele, and then tells Lynda to mind her own business. Later, when Roy offers a kind word, prickly Kirsty spitefully rejects his advice.", "duration": "791", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04vfd4y.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488499200, "title": "03/03/2017", "author": "BBC Radio 4", "summary": "Helen takes Tom to the airport. He has decided to go to the Brazil conference after all. He feels like he's running away again, but Helen assures him he is doing the right thing.\n\nHostess Jennifer steers Lilian out of the way before opening the door to Justin and Miranda. At the soiree, Robert thinks there's no need for Lynda to escalate a complaint about Kirsty's manner at Grey Gables. They also discuss whether the Sterlings know about the B&amp;B set-up at Grange Farm - if not, they don't want to let on and risk having the Grundys evicted. \n\nJim fetches more wine for the Mayor of Felpersham, although is concerned about her intake. He questions Brian about his biodiversity plans for the land he's just bought. \n\nMiranda spots Lilian and tells Justin to at least say hello to her. Later, Justin tenderly helps Lilian with an earring that's come out of her ear. Neither of them realise that Miranda observes the moment. Jennifer thanks Miranda for helping the Mayor who wasn't feeling well. She claims she must have eaten some broccoli. Once Justin and Miranda have left, Jennifer wishes she'd never invited the Mayor. Lilian joins them and is quietly triumphant: she hasn't let them down this evening. Jennifer was worrying about the wrong person all along...", "duration": "793", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szz7d.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488412800, "title": "02/03/2017", "author": "BBC Radio 4", "summary": "Josh is mesmerised by the first \"sold\" sign on his Ambridge Farm Machinery website. David moans about Josh's lack of help with lambing. Ruth reminds him there was a time when David was distracted in the lambing season. David wishes his son was more thoughtful like Lily who has sent a gift to Lynda in apology for almost running her over. \n\nRex has already collected the eggs by the time Josh finds him. They agree how much Rex will get from the sale of the Home Farm plough as long as Rex sticks to spending an hour a day promoting the website. Later, Anisha gets into a taxi and is surprised to find Rex is driving it. She's just had lunch with the stud farm manager who she's hoping will become a client. Rex updates Anisha on the cricket - Harrison wants to hold an EGM to have another look at allowing women to play. \n\nTom looks to get hold of a contact that could help improve Bridge Farm's veg boxes, via Ruth. He tells her about pulling out of going to the Nuffield conference in Brazil. Ruth shares her own experience of miscarriage and tells him it will get easier. Ruth asks if it's not too late to change his mind about pulling out of the conference and the whole scholarship.", "duration": "785", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szy5k.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488326400, "title": "01/03/2017", "author": "BBC Radio 4", "summary": "Fallon takes Jennifer through the menu for her party and Jennifer's impressed with the reference to Zeus and the horn of plenty. She has every confidence in Fallon. Fallon notes the Mayor of Felpersham's allergy to broccoli. Brian's relieved all Jennifer's worries have been quelled and he wonders whether there's any chance of him trying out the food samples. \n\nRex and Anisha secretly get some indoor nets practise in. Anisha doesn't rate herself with the bat - she's much better at bowling. Rex tries to give her some tips. Over a drink afterwards, Anisha tells Rex she's meeting a stud farm manager tomorrow who she'd like to sign up as a client. She needs to justify all the changes she's pushed through with Alistair. Anisha would like to get herself more well-known in the area and Rex suggests joining the cricket team. Anisha is up for it! They promise to keep their practise a secret. \n\nLilian is still trying to persuade Jennifer to let her come to the party. Brian points out that Lilian's absence might get more people talking than her being there. Jennifer reluctantly agrees with Brian but she's still not convinced they can trust Lilian not to cause a scene.", "duration": "802", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szxk1.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488240000, "title": "28/02/2017", "author": "BBC Radio 4", "summary": "Excited Josh shows his Dad his new website. David agrees there's some decent kit on there. But what David really wants is some help in the lambing sheds. To David's annoyance Josh dashes off to pursue another brainwave.\n\nAfter accidentally disturbing the rabbits Eddie's after, Josh has to work hard for Eddie's agreement to help promote Ambridge Farm Machinery. As Eddie points out, there's a lot of money in second hand kit. He manages to secure an offer of several good bottles of anything he likes in return for finding Josh the right customers. \n\nAnnoyed Lynda's worked out that the couple who recently cancelled with her is now staying at Grange Farm. She is quickly defeated when Eddie assures that the Sterlings are on board with B&amp;B at Grange Farm. Lynda's woes continue when she has a near miss with speeding Lily. She laments the plague of bad driving in the village; it's time something was done.\n\nKirsty and Tom share their troubles. Tom explains that not only has he cancelled his place at the Nuffield conference in Brazil he's pulled out of the scholarship altogether. Kirsty wishes he'd think again. But Tom's decided; that door is definitely closed.", "duration": "791", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szx0c.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488153600, "title": "27/02/2017", "author": "BBC Radio 4", "summary": "Work's begun on updating the vet practice at the Stables. Lynda's impressed - it will feel much less oppressive. Alistair tries to encourage her to take out a health care plan for the llamas but she's not interested. Alistair has to admit the practice's website needs updating - he's agreed with Anisha to have it completely redesigned, and to increase their social media presence. Shula thinks Anisha's open day idea is great, and well timed. \n\nEmma wants to pick Jim's brains. She's struggling to interpret Jennifer's land theme for her party. Jim has the germ of an idea and after some research he tells Emma about Zeus and the horn of plenty - a cornucopia, symbolising the products of a rich and fertile land. Emma's inspired; she knows Fallon will love it. She thanks Jim, he's a life-saver! \n\nKirsty's getting to grips with her first day back at work since her miscarriage. She's focused on all the tasks she has in hand but Lynda gently points out she has missed one. She offers to help but Kirsty insists she's fine. Lynda worries about Kirsty's overly bright enthusiasm; she should give herself time to grieve. But Kirsty's adamant she's dealt with it. She's sick of everyone treating her like she's made of glass. She just wants to do her job and get on with the rest of her life.", "duration": "801", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szw99.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1488067200, "title": "26/02/2017", "author": "BBC Radio 4", "summary": "While Keira watches the pigs, Emma and Eddie discuss how the B&amp;B guests' twitchy dog barked at her after she startled it. Emma's fed up with the guests taking over the Grange Farm kitchen when she's desperate to try out recipes for Jennifer's party. The theme of 'Land' really isn't giving her much to go on. She's afraid the whole thing will be a disaster. When she finds out the Mayor of Felpersham on the guest list too, she's even more downhearted. Eddie's suggests using rabbit which he can get hold of with his ferrets. \n\nJennifer's finding Lilian's endless apologies trying; she feels it's a disingenuous attempt to get round her because Lilian wants an invitation to the party. Adam doesn't want the details and tries to get on with his work. Jennifer continues to agonise about the catering, Miranda and the guest list, but busy Adam leaves her to it.\n\nTony's worked out a rota at Bridge Farm to free up Tom but he would rather be keeping busy. He's having second thoughts about his Nuffield trip. He's lost all enthusiasm for the conference since Kirsty's miscarriage. Tony advises Tom not to rush into anything. But Tom makes up his mind; he's not going to Brazil.", "duration": "795", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04szvqy.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487894400, "title": "24/02/2017", "author": "BBC Radio 4", "summary": "Jill and Carol enjoy whiling away an afternoon discussing - and watching - classic films. By the time David comes in, expecting to be fed, there are no flapjacks for him to snack on and dinner is nowhere near ready. \n\nLilian isn't surprised that Fallon and her team are struggling to come up with ideas for the catering for the Home Farm party. Jennifer's theme is rather general. Jennifer insists she's made it all perfectly clear. Nothing they have suggested so far is quite right. They're just not thinking outside of the box.\n\nJustin's very impressed Lilian's managed to track down Russell Dankworth from Environmental Health. Justin declares her the full package: brains and beauty. With Miranda away for the afternoon, he suggests they go back to the Dower House. But Lilian thinks Home Farm will be safer. \n\nWhen Jennifer arrives home she walks in on Justin and Lilian catches them in flagrante! Aghast, Jennifer's horrified for her reputation, and that of Lilian. She points out it won't be long before everyone in the village knows about the affair. What if Peggy finds out? If Lilian doesn't start behaving herself, Jennifer doesn't want her in her house any more - or at her party!", "duration": "794", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sxnt1.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487808000, "title": "23/02/2017", "author": "BBC Radio 4", "summary": "Roy and Lynda speculate on the future of the cricket team after its AGM last night. Lynda asks after Kirsty and wonders about visiting her. Roy thinks that would be a good idea. \n\nAs Eddie accepts another B&amp;B booking, Joe hopes the Sterlings know the score. Eddie assures him that Oliver's said they can have a many friends as they like to stay at Grange Farm. Joe cautions that's not the same thing at all. Eddie wins him round by suggesting Joe might earn some good tips. \n\nAt Ambridge Hall, Joe picks up some local attraction leaflets. Lynda remarks she's had an unexpected cancellation for the weekend. Her description of the guests fits Eddie's new booking, and Joe nearly lets it slip before Eddie ushers him away.\n\nHelen coaxes Kirsty to talk. Kirsty admits she hasn't cried much at all. She fears that now her parents know Tom was the father of her baby, they may never forgive him. She feels her problem might be that she never really came to terms with being pregnant. But she quickly moves the conversation on; she just wants to keep going as normal. She's feeling fine, and begs Helen to stop worrying. Other people might want to take things more slowly, but this is what works for her.", "duration": "800", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sxmwy.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487721600, "title": "22/02/2017", "author": "BBC Radio 4", "summary": "Kenton is ready to enact his plan for Freddie's parents' evening to prevent Elizabeth from learning Freddie's true result in his Maths retake. Freddie's not sure his mum will be so easily side-tracked but can't think of anything better. The scheme goes awry; with Freddie's Maths tutor running behind schedule, Kenton still hasn't seen him by the time Elizabeth has finished with Lily's tutors. \n\nJust as Kenton gets to speak to Freddie's tutor, Elizabeth appears and demands to know what's going on. When she finds out the truth she's furious and hurt. How could her own son and brother lie to her? She declares it's hard enough bringing up two children alone, without having to factor in Kenton's antics. Freddie and Kenton are contrite, but Elizabeth bans driving practise and all other contact forthwith.\n\nAlistair doesn't see the need to re-decorate the vet practice waiting area, but Shula's with Anisha on this; image is incredibly important when it comes to clients.\n\nWomen players are on the agenda at the cricket AGM. Harrison has his work cut out. There are murmurs of disapproval and dissent from the off, and he loses the vote. Apologetic Rex promises to try to get Anisha signed up. Harrison reckons if they don't get women on the team, it'll be the death of cricket in Ambridge.", "duration": "779", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sxlnl.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487635200, "title": "21/02/2017", "author": "BBC Radio 4", "summary": "Lilian's walking on eggshells around grumpy Justin. In an effort to gain favour she goes on a mission to trace an elusive environmental health man who holds the key to Justin's latest investment prospect. A clue comes from an unlikely source in the shape of Pat, who recognises the name and may be able to provide a possible lead.\n\nRoy's taken aback when Kirsty arrives home unexpectedly, a little wired and keen to get back to work. Roy feels she should take time to relax, but Kirsty reckons she's got lots of new ideas for the Health Club and wants to get on with them. She doesn't want to talk about what she's been through. \n\nKirsty tracks down Tom, and they share their need for absorbing themselves in work. Kirsty's grateful for Tom's supportive late night texts, and hopes they continue. She accepts an offer from Roy to cook dinner, but first she catches up with Pat, who assures her they all want to look after her. When Kirsty says how sorry she is about what happened, Pat explains gently that no-one holds her responsible. It was just one of those things. Kirsty reiterates that she just wants to put it behind her and get back to normal. That's not too much to ask, is it?", "duration": "794", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sxksf.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487548800, "title": "20/02/2017", "author": "BBC Radio 4", "summary": "News of the theme for Jennifer's party is out: it's 'Land'. Fallon and Harrison agree it doesn't give Fallon much to go on for the catering. She's short on ideas, and Harrison isn't helping. He's preoccupied with trying to enlist women for the cricket team. He's not having much luck with interest for the AGM either. Eddie declares it boring. Eddie's also a bit miffed he isn't invited to the Home Farm party - though he reckons he's happier with a pasty and a pint anyway. \n\nFallon urges preoccupied Jazzer to call Kirsty, now that he's spoken to Tom. Fallon's heard from Kirsty that she's finding it hard being with her parents. Jazzer thinks maybe he will. \n\nWith the Grundys' latest house guests giving them rave reviews, Eddie has an idea for less than thrilled Clarrie. If they give their own bedroom over to guests, they can include en-suite facilities as part of their B&amp;B offer. Clarrie's not happy. She's worried they're taking advantage of the Sterlings' kindness, and that Lynda will be put out by the competition. But Susan points out the extra money will help with the rent, and Clarrie's so good at looking after people, she should just go for it. If they market Grange Farm properly, they could be sitting on a goldmine.", "duration": "790", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sx4x0.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487462400, "title": "19/02/2017", "author": "BBC Radio 4", "summary": "Ruth's worried about stubborn Jill overdoing it. Jill's turned down Jennifer's party invitation - she's got too much to do at home. Ruth enlists Carol's help; perhaps she could pop over and see Jill, as a distraction? Carol does so, but blows her cover by admitting Ruth's concerned about Jill. Jill's exasperated but enjoys a chat with Carol nevertheless. Together they dream up a list of films to satisfy Ben's latest interest. \n\nAlistair's finding all the new admin technology introduced by Anisha a little wearing. He's more for the practical side. However he does admit to Ruth the practice needs updating if it's going to attract new clients. It could be just the kick he needs. He just hopes they're not doing too much too soon.\n\nAs Jennifer checks the party acceptances she's disappointed none of the Brookfield Archers can make it. Amused Lilian sees the party as an opportunity for Brian to show off. Jennifer denies this; and she's anxious to get the tone of the event exactly right. She's worried partying might be insensitive after Kirsty and Tom's news. But Lilian points out cancelling won't help anyone; life has to go on. Then Jennifer has a light-bulb moment regarding a theme. She thanks bewildered Lilian for the inspiration.", "duration": "800", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04sx48b.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487289600, "title": "17/02/2017", "author": "BBC Radio 4", "summary": "Jazzer dishes out some tough love, and Lilian sails close to the wind.", "duration": "792", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s69cv.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487203200, "title": "16/02/2017", "author": "BBC Radio 4", "summary": "Kenton wants to know what's up with distracted Freddie. Freddie admits he's terrified his mum will find out about his bad maths grade at the upcoming parents' evening. Kenton offers to attend in Elizabeth's place while Freddie keeps his mum occupied elsewhere. Freddie's unimpressed, but accepts it's the best they've got.\n\nPat loses her rag with Clarrie, but quickly apologises. She's worried about Tom. Clarrie's supportive and, thinking of Ed and Will's battles, shares her own experience of painful times. She reassures Pat that Tom will be fine; but for now, she just needs to let him be. Grateful Pat gives Clarrie a cake as a thank you for her kindness. Clarrie reminds Pat she's not alone.\n\nBack at Grange Farm, Eddie shows Clarrie the pictures he's taken to promote their B&amp;B offer. Clarrie's conflicted: the house doesn't belong to them, and it would mean a lot of paperwork and hassle, but the money would be useful. Eddie senses victory, but Clarrie will only agree if Caroline and Oliver approve. He later convinces her that the Sterlings are fine with it, and Clarrie capitulates. Eddie's delighted. He's already put the photos online; they'll be hosting their first guests in no time!", "duration": "804", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s68w9.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487116800, "title": "15/02/2017", "author": "BBC Radio 4", "summary": "Eddie's asks Pip if she knows anything about the cost of local B&amp;Bs. She has a friend who rents out a room - apparently it's easy money. Later, Eddie pumps Lynda for information about Ambridge Hall. Lynda states she and Robert are lucky; they have a few loyal repeat clients. Joe's sceptical about Eddie's scheme but Eddie's undeterred. They're sitting on a goldmine at Grange Farm. All they need to do is persuade Clarrie.\n\nAnisha takes a call from Mr Hodge who requests Alistair attends his sick cow instead of her. After some thought, Alistair says Anisha should be the one who goes. If they lose a client, so be it. They need to decide what sort of practice they want to be. \n\nJosh asks Pip to mend a fence he damaged earlier. Reluctant Pip agrees when he offers to do one of her early milking shifts in return. \n\nHarrison seeks Lynda's advice on getting people on board ahead of the cricket AGM. She has some words of wisdom for him, and he's encouraged. His big idea is to get women on the team. Alistair warns him it has been voted down in the past. He suggests recruiting some female players in advance might strengthen Harrison's case. But when Pip turns Harrison down, he wonders whether the team has a future.", "duration": "800", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s68c3.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1487030400, "title": "14/02/2017", "author": "BBC Radio 4", "summary": "Miranda looks over Justin's horses at the Stables. She meets Anisha, who lets slip that she has seen Justin in The Bull with Lilian. Miranda spells out that she is Justin's wife. Later, Miranda and Justin's Valentine's meal is stilted. She thinks the restaurant is twee and asks why Justin still has to be in Ambridge now Berrow Farm Dairy is finished. He promises to spend more time with her in London. \n\nHelen brings a lasagne round for Tom. He's heard from Kirsty that she doesn't want a ceremony for the baby. Helen tries to support him. He describes how this grief is different from how he felt when John died.\n\nAlistair takes a call from Mr Hodge after Anisha treated one of his bulls. He wants Alistair to go next time. Anisha is adamant that she did a good job. Later, Alistair finds Anisha is still working and asks if she's brooding over the complaint. He assures her it has nothing to do with her capability, and that Mr Hodge is just a tricky customer. Shula wonders if she should have mention's Fallon's Un-Valentine's event to Anisha but Alistair doesn't think she'll be in a party mood. After today, they wonder if Anisha is as tough as they first thought.", "duration": "796", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s67w5.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486944000, "title": "13/02/2017", "author": "BBC Radio 4", "summary": "Tom finds Roy at the hospital who says the baby had been a boy. Tom goes in to see Kirsty who is numb about the miscarriage. She tells Tom he can see the baby if he wants and asks him to leave her.\n\nEddie and Clarrie reflect on hosting Big Eric and Bex. Clarrie finds a £100 with a note from Eric and Bex who were impressed with Grange Farm's hospitality. Clarrie thinks they should return it but Eddie says they don't want to risk offending them... plus it'll help with the next rent payment. Eddie moans to Clarrie about Lynda's demands over the guttering job he agreed to do for her. Then he suggests they start renting out a room regularly, going on the glowing review from Eric and Bex. Clarrie is adamant they can't do it. \n\nRoy and Helen chat - Kirsty's mum is picking up Kirsty later. Helen will help her pack. Tom joins them and asks Helen to come with him to see the baby. Before Kirsty is collected by her mum she worries about the upheaval she is causing other people. Helen wishes she could do more, Kirsty is resigned - it just wasn't meant to be, she says.", "duration": "802", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s66d4.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486857600, "title": "12/02/2017", "author": "BBC Radio 4", "summary": "Kirsty feels unwell. Roy mentions Fallon's Un-Valentine's event at the tea room, an event that will be fun for everyone, not just couples. Suddenly Kirsty cries out in pain. She goes to the bathroom and realises that she is bleeding. Roy takes her to hospital.\n\nJennifer bumps into Miranda, who is looking for somewhere open to buy a newspaper. Jennifer mentions the dinner party that she is going to hold. Miranda is unimpressed so Jennifer talks up the event. After seeing Miranda again in The Bull, Jennifer explains to Brian that she wants to show off to Miranda Elliott. Brian must help keeping Lilian away from Justin at the event - they don't want a disaster. When Brian takes a look at the catering Jennifer is considering he tells her it's getting out of hand. He thinks they should be themselves, do it their way and be proud. Jennifer sees his point and agrees.\n\nRoy and Helen wait nervously while Kirsty is assessed. Tom is trying to get back from Scotland as quickly as he can. Helen joins Kirsty who can't comprehend what is happening. A consultant comes in to do an examination. He tells Kirsty she is having a late miscarriage. Helen refuses to leave Kirsty's side.", "duration": "801", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04s658p.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486684800, "title": "10/02/2017", "author": "BBC Radio 4", "summary": "Helen is angry about what Rob said to Henry before he tried to take Jack. As Helen tucks Henry into bed, she tries to put his mind at rest, telling him that his Daddy just isn't like some other Daddies. Pat tentatively asks whether Henry should see a child counsellor.\nLilian surprises Brian and Jennifer in her silver satin dress. She'll be partnering Justin at tonight's dinner dance in Felpersham, after a last minute cancellation by Miranda, who is instead spending time with her sister in London. Jennifer frets that it now looks like they are condoning Lilian and Justin's affair.\nWhile Lilian is on cloud nine, Jennifer feels awkward at the dinner dance. Justin brings up the Ramsbury broiler unit and learns that Brian knows the local Environmental Health Inspector. Lynda appears - she and Robert are out to celebrate a 5-star review in the B&amp;B guide. As Lilian and Justin dance, Lynda joins Jennifer and Brian. They ask about her B&amp;B success but she's distracted by Lilian and Justin on the dancefloor. Jennifer despairs at Lilian's behaviour - she really doesn't want to see her sister hurt.", "duration": "794", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rn43c.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486598400, "title": "09/02/2017", "author": "BBC Radio 4", "summary": "Helen tells Kirsty about Henry being difficult - he dropped Jack's favourite teddy in the bath on purpose, and is waking up upset in the night. \n\nHelen and Kirsty speculate on the conversation Peggy is having with Tom about his and Kirsty's baby. To Tom's relief, Peggy approves, insisting it's natural for Kirsty to want a child and up to her if she doesn't want a husband too - but Tom must support her. Tom tells his Gran about feeling excited and overwhelmed. Congratulating Kirsty, Peggy warmly gives her a cheque. Helen reassures a stunned Kirsty that she should cash it and not risk offending Peggy. \n\nAnisha turns up at Bridge Farm to deal with a sick pig and Tom leaves her with Jazzer. Jazzer doesn't let Anisha go without demanding an apology for drinking water on Burns Night. He asks her out for a proper drink but she turns him down. \n\nPeggy tells Helen how pleased she is to hear about Rob's departure for America. When Henry upsets Jack by poking him, Peggy offers to talk to Henry and later reveals to Helen what's wrong. Rob had told Henry on the night he tried to take Jack that he's not Henry's real Daddy. So Henry thinks his Daddy didn't want him. It's no wonder Henry is so upset.", "duration": "802", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rn2dd.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486512000, "title": "08/02/2017", "author": "BBC Radio 4", "summary": "In the shop, Kenton warns Jennifer that there has been some gossip in the pub about Lilian and Justin. He admits his ad-libbing in the panto had something to do with it. Later, Kenton reveals to Fallon that Freddie didn't get a C in his Maths re-take after all. \n\nHarrison has still had no luck in recruiting players for cricket, not even the younger ones. David Archer is too busy lambing and Ben isn't interested in team sports. Fallon points out that there is a whole other option Harrison hasn't even considered - letting women play.\n\nLilian and Justin play hookey and treat themselves at Felpersham racecourse. They have a great time, drinking champagne, and Lilian doesn't care about winning or losing. But Justin has bad news - Miranda is coming for the weekend. He's taking Miranda to a dinner dance in Felpersham on Friday, to throw her off the scent - he'll miss Lilian terribly. \n\nJennifer is worried about the affair backfiring on Lilian, accusing Brian of being too complacent. Jennifer tries to tell Lilian to be more careful, but she won't listen. Justin rings and invites Jennifer and Brian to the dinner dance with him and Miranda - his treat and a thank you for their hospitality. Jennifer insists they must go to quash the rumours flying around.", "duration": "802", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rmxc0.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486425600, "title": "07/02/2017", "author": "BBC Radio 4", "summary": "Josh delivers a new bonnet and badge to a delighted Tony for his old Fordson tractor, with Josh emphasising how much digging around he did to find them. Tony baulks at the cost and Rex can't believe Josh's 40% mark up, particularly as Tony is family. Josh mentions to Rex that he saw Toby, who must be grovelling back to Pip. Josh then goes back and revises his price. He offers to get a good price for the Fordson if Tony ever wants to sell - but Tony insists that he's never parting with it. \n\nAlistair's intrigued by Anisha's ideas for the vet practice, ahead of their meeting with the contractor tomorrow. Anisha admits that she cheated at the drinking competition with Jazzer. He advises Anisha to just get on with being a good vet - there's nothing else she can do about the inevitable village gossip about her drinking prowess. Anisha's worried about being perceived as a heavy drinker, so to make amends she speaks to Susan, knowingly asking her to keep her Burns Night strategy a secret. \n\nSusan wastes no time in telling Clarrie Anisha's revelation. Clarrie also has gossip to share, but stops herself as she's sworn to secrecy by Eddie. Susan has heard enough to deduce something about an early morning visitor to the Dower House. Clarrie doesn't need to spell it out - Susan can guess.", "duration": "799", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rmwkx.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486339200, "title": "06/02/2017", "author": "BBC Radio 4", "summary": "Helen thanks Kirsty for being there when she faced down Rob. Helen is still fretting about Henry's behaviour. She doesn't know what's going on in his head. Lynda praises Helen, who mentions how happy Lynda's B&amp;B guests were. Lynda delights in sharing the news of her 5-star review and points out how radiant a rather embarrassed Kirsty looks. Kirsty mentions to Helen that Peggy wants Tom to collect her from the hairdresser's on Thursday. Tom's worried about what Peggy makes of Kirsty's pregnancy \n\nLilian and Justin enjoy waking up together in the Dower House. Miranda will be busy with her charity work, so they have lots of quality time ahead. Justin makes breakfast, and while Lilian nips out - in her fur coat and slippers - to retrieve her phone from the car, she bumps into Eddie, who's delivering firewood. Lilian quickly covers for why she's at the Dower House so early in the morning but then later ponders that Eddie's no fool, so they may need to have a little talk. \n\nEddie congratulates Lynda on her 5-star B&amp;B review and then angles for work by pointing out that Ambridge Hall's guttering is in need of repair. Lilian catches up with Eddie and warns him about spreading rumours. Eddie understands - he'll stick to the story that Lilian and Justin were just having a working breakfast.", "duration": "800", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rmw02.mp3", "type": "episode", "tags": []}, {"seriesId": 265970428, "seriesTitle": "The Archers", "pubDate": 1486252800, "title": "05/02/2017", "author": "BBC Radio 4", "summary": "Pip congratulates Helen after hearing about the showdown between her and Rob. Pip says she'll keep Josh from blabbing but Helen's not bothered who knows the good news - Rob is gone and she has Jack back. Pat tries to stop Helen worrying over Henry - he came into her room last night asking when Daddy was coming back. Helen finds it hard to find the middle ground between lying and telling Henry what Rob was truly like. Afterwards, Henry opens up to Pat while they make brownies, and she reassures him that he will be looked after. \n\nRuth and Pip steel themselves for a full-on season of lambing and calving. Ruth asks about Toby and Pip assures her things are much better between them now. Pip explains that Toby had \"personal stuff\" to deal with when he rushed off to Brighton, but won't tell Ruth what exactly.\n\nHarrison's having nightmares of not being able to field a cricket team and hardly anyone has turned up to indoor nets. Fallon tries to lend him some perspective over it. Later, Harrison calls round to Bridge Farm - the police have traced Rob's passport and found that he took a flight to Minneapolis on Friday. If Rob ever returns he'll be on their radar as a 'person of interest'. Helen realises she no longer has to worry about Rob.", "duration": "798", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music19/v4/35/65/c1/3565c18c-4036-e486-8e73-d92d99fd38e0/source/60x60bb.jpg", "audioUrl": "http://open.live.bbc.co.uk/mediaselector/5/redir/version/2.0/mediaset/audio-nondrm-download/proto/http/vpid/p04rmtkv.mp3", "type": "episode", "tags": []}]}