{"series": {"feedUrl": "http://aidpodcast.libsyn.com/rss", "genres": ["Design", "Podcasts", "Arts", "Visual Arts"], "title": "Adventures In Design", "country": "USA", "author": "Mark Brickey", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "type": "series", "id": 503341322}, "episodes": [{"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1488442379, "title": "539 - Dr. Kuhlken", "author": "", "summary": "<p id=\"yui_3_17_2_1_1487582823282_613409\">Take one, long, slow, deep breath. Bring yourself into the moment and listen as Psychologist Dr. Kuhlken talks about coping with stress and managing anxiety to become a better, balanced version of yourself. You might not even realize it just yet, but there are a lot of stressors in your world that are stacking up and need to be addressed. Mark takes a moment away from art to sit down with Dr. Kuhlken and bring to light how we can maintain our mental health and find more of the beauty in what appears to be an increasingly chaotic world. From de-normalizing the recent steps back we've taken as a culture to learning to listen to others, Dr. Kuhlken helps open new possibilities for us in our world view and how we relate to it. Use this interview as the first positive step towards finding your center of balance or as one continual step further down the path of empathy, acceptance, and introspection. </p> <p><strong>Talking Points</strong></p> <ul> <li>Dr. Kuhlken is qualified to see through Mark's bullshit.</li> <li>Privileged ostrich survival tactics and the politics we are all dealing with.</li> <li>A new, better generation that values equality and fairness.</li> <li>America starts to send a different message to the world.</li> <li>Media consumption, awareness, and the underlying socialization we have yet to overcome.</li> <li>Legitimizing pain in the moment and how for some, this isn't a new issue.</li> <li>Meet The Press and searching for a way to normalize your feelings.</li> <li>Finding companionship for strength and the importance of belonging.</li> <li>Are you addicted to Trump's chaos and does it all come from the media?</li> <li>Achieving balance, practicing mindfulness,  and analyzing your day to do what needs to be done.</li> <li>Career FOMO and developing alternate aspects of your identity.</li> <li>The culmination of so many issues and fatiguing the American people.</li> <li>Coping with anger and finding a way to do something about it.</li> <li>Overcoming the red flags of your addiction.</li> <li>Breaking down \"Grab them by the pussy\" and the ramifications of electing a president who has openly admitted to sexual assault that we overlooked.</li> <li>Victims, survivors, and asking what people identify with.</li> <li>Sitting in the pain.</li> <li>Being a real ally and stepping outside the problematic tendencies of help becoming a selfish action.</li> <li>Working outside your privilege.</li> <li>Getting a pass, internal biases, and increasing exposure.</li> <li>\"Hey... what do you need?\"</li> <li>Listening to the quieter voice in the room and resisting the impulse to jump in.</li> <li>Making effort where your can to connect.</li> <li>Acknowledging discomfort through your empathy while remembering personal identity.</li> <li>Compassion for men.</li> <li>Mark's panic attack and the stress of working for yourself.</li> <li>How getting ahead is just getting you behind.</li> <li>Significant changes that denote if you're going too hard.</li> <li>Cash flow, work balance, and the levels of anxiety that come with being an adult.</li> <li>Defining stressors, riding the rollercoaster, and going down the other side of the bell curve.</li> <li>Setting up steps to alleviate your concern.</li> <li>Defining unproductive worries.</li> <li>Finding Personal validation in and out of your work, the importance of confidence, and remembering humility.</li> <li>Writing a script for success to plan out what you want at the moment and in the future.</li> </ul>", "duration": "01:26:53", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID539i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1488355200, "title": "538 - The Collection with Huck Gee - Part 15: Jesse Hernandez", "author": "", "summary": "<p id=\"yui_3_17_2_1_1487582823282_540412\">Jesse Hernandez brings his urban aztec style to The Collection with Huck Gee and Mark Brickey. Jesse lets us inside his multi-faceted history touching on his involvement on everything from Run The Jewels, his own TV show called Vinyl Addiction, and the fingerprint he left on Farmville. With a career that varied Jesse has still managed to carve out a signature style that brings him clients like Rockstar and Gears Of War. Creativity is limitless with a couple late nights and a work ethic thats hard to match from a talented artists and father of four. Huck Gee unveils his process in developing the world his Dapper Little Scoundrels race through and pulls back the curtain on his work at the fun factory he has pieced together. Two masters at their craft open up and remind us all that their raw abilities are just the start of a long journey to produce truly memorable work.</p> <p><strong>Talking Points</strong></p> <ul> <li>A Robotech kick off with overdubbed storylines and the return of Voltron.</li> <li>Rolling the dice with the Re:Blank and some variations to follow.</li> <li>Birthdays, 5 Points Festivals, and Designer Toy Awards.</li> <li>Fine tuning the roduction process and using Legos as a quick fix.</li> <li>Parking your car in the urban Aztec space.</li> <li>The feathered serpent that led Jesse to his signature space.</li> <li>Making the artwork inside the artwork to keep it interesting from every angle.</li> <li>Complexity balanced with contrast.</li> <li>Drawing inspiration from pinstriping.</li> <li>Fills with no lines to be your own Dunny.</li> <li>Scale and process in Jesse's work and a mural tip from Tristan Eaton.</li> <li>Using the form as a jumping off point for your art in environmental design.</li> <li>Outworking the knock offs and doing it the hard way.</li> <li>Putting in the work, discovering your style, and some real talk.</li> <li>The Real Immigrants hiding behind Alt Right terminology.</li> <li>Americas number one export and keeping things mixed up.</li> <li>Jesse's three tones and discovering his color theory. </li> <li>Client work you can't put your fingerprint on and landing Run The Jewels.</li> <li>Jaguar Skulls, Ozomatli, and Jesse's future in toy design.</li> <li>Why do so many deals fall apart in the toy industry?</li> <li>Keeping it authentic when making culturally sensitive artwork.</li> <li>Family life and balancing a career around it.</li> <li>Hosting Vinyl Addiction, interviewing big names in the game, and making the most of an opportunity while it lasts.</li> <li>Making time for your own stuff amidst client work.</li> <li>Farmville, Blindspot, and flexing outside of your style.</li> <li>Coping with the entertainment bug and putting the cart in front of the horse.</li> <li>Perfectionism and an outsiders perspective of a project.</li> <li>From a draftsman to an illustrator and learning through the process.</li> <li>Going beyond the first step to make a booth you don't take home.</li> <li>Waiting two years to develop the capabilities to make something intricate.</li> <li>Streamlining your dream to make it affordable.</li> <li>Research, variations, and the execution.</li> <li>The schematics of producing dapper little scoundrels.</li> <li>Balancing imagination and practicality.</li> <li>Dreaming in pencil and blueprints in Illustrator.</li> <li>Individualizing a series while staying smart about the form factor.</li> <li>Picking Flynn and the level of anthropomorphic characteristics Huck incorporates.</li> <li>Google image search and collecting inspiration in a folder.</li> <li>Character proportions, 1:1 scale, and Outside The Artboards.</li> <li>Flat paper dolls 3D modeling to resin sculpts.</li> <li>Chassis, engine blocks, and giant wheels that all have to work. </li> <li>Hidden surprises and happy accidents.</li> <li>The strategy behind intricacy at home and mass production elsewhere.</li> <li>Grounding your characters in reality form the beginning.</li> <li>The cautionary tale of Superman and siding with suits or stoners.</li> </ul> <p>TEAM FLYNN</p>", "duration": "01:31:57", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID538i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1488268800, "title": "537 - Benny Gold", "author": "", "summary": "<p id=\"yui_3_17_2_1_1487582823282_395439\">Let the bell toll to announce the second coming of Benny Gold. With the pressures of an uncertain future in a soft market Benny Gold has kept true to his roots and fought hard for what he loves and has pushed his brand farther than he ever dreamed with his first sticker. In the face of adversity he has doubled down with a firm belief in his vision and opened a brand new shop in the heart of San Francisco to further pursue his quest to create. This isn't work. This is true passion. Benny Gold shows us how to use your dreams as your life's compass and maintain a youthful outlook even if the odds or your age seem stacked against you. With no signs of slowing and a promising future filled with one on one interactions, lectures, and plenty of coffee there is a whole lot to unpack with this Florida Keys transplant that rose above his lackadaisical upbringing and made a name for himself. Calm your mind. Calm your heart. Take a deep breath and learn from one of the nicest guys in streetwear, Benny Gold.</p> <p><strong>Talking Points</strong></p> <ul> <li>Opening up a grown up shop on the main drag.</li> <li>Expanding into cut and sew and deciding between domestic or overseas.</li> <li>What is Benny's role in the business now?</li> <li>Delegation, brand name regrets, and understanding success.</li> <li>Staying in the moment piece by piece until the finish line.</li> <li>Benny knows there's always a way and to trust his instincts.</li> <li>Throwing stability out the window and sticking to your dreams.</li> <li>Stress as life's engine.</li> <li>Breaking down the Works For Jerks mantra.</li> <li>Ringing the bell, youth culture, and maintaining sanity through meditation.</li> <li>Age brackets and fighting your DNA.</li> <li>Working through your problems without any crutches on the quest for self empowerment.</li> <li>A life in skateboarding.</li> <li>Gateway friends that deliver you into punk rock and Mr. Gold's solid record collection.</li> <li>Exploring your exploratory nature and missing the age of discovery.</li> <li>Is success easier to attain these days?</li> <li>Staying power, passion, and authenticity.</li> <li>For the love of creativity.</li> <li>Stand alone institutions and finding your passionate tribe.</li> <li>The importance in fighting for yourself and bringing face time back to the experience.</li> <li>Separatism and teaching true acceptance to the next generation.</li> <li>It's a beautiful world so pick yourself back up when you fall.</li> <li>The bosses you accumulate that stand in the way of your vision.</li> <li>Enjoying the moment and the varying degrees of success.</li> <li>Make it all for something. </li> </ul>", "duration": "01:05:41", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID537i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1487756379, "title": "534 - Hammer Time with Ian Perkins", "author": "", "summary": "<p class=\"p1\">In episode two of Hammer Time Mark Brickey, Michael Hammer and Ian Perkins talk about Ian’s relationship with playing guitar for Brian Fallon both on his solo records and with Gas Light Anthem. The guys take a field trip to the Fender Guitar Custom Shop and learn all about the art of guitar making as well as the different levels of guitar craftsmanship. A fun episode that talks about sports, designing luck into your business, that art of manufacturing and allowing yourself to make your dreams come true by simply saying yes and not being motivated by money or tribal tattoos.</p>", "duration": "01:41:51", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID534i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1487664000, "title": "533 - Erik Marinovich", "author": "", "summary": "<p id=\"yui_3_17_2_5_1487655646748_7996\">This is the typography discussion you've been waiting for with Erik Marinovich from Friends Of Type. Erik has brought lettering to life for everyone from Google to Facebook to Ford as his unbridled passion for letterforms brings their messages to a much more vibrant life. What separates Erik from the pack is that he understands the importance of the message itself and how his typework can bring that to life. With one two three typographic hierarchies, a strong grasp on storytelling, and an unwavering passion for his work its no wonder Erik was a key character in this typographic resurgence amidst a vast sea of uninspired type blocks and pre-textured fonts thrown together more haphazardly than Kanye West's sense of fashion. Sit down and learn from one of the best in the business to start transforming your work into the well thought out, impactful piece you want it to be. Consonants and vowels have never had it so good!</p> <p id=\"yui_3_17_2_5_1487655646748_8105\">Talking Points</p> <ul id=\"yui_3_17_2_5_1487655646748_8108\"> <li id=\"yui_3_17_2_5_1487655646748_8107\">Bringing type into the spotlight.</li> <li id=\"yui_3_17_2_5_1487655646748_8110\">Noodling with custom forms and rediscovering lettering.</li> <li id=\"yui_3_17_2_5_1487655646748_8112\">Life experience that influences your design.</li> <li id=\"yui_3_17_2_5_1487655646748_8114\">Original content and the perseverance necessary to become a better creative.</li> <li id=\"yui_3_17_2_5_1487655646748_8116\">Macro and micro views.</li> <li id=\"yui_3_17_2_5_1487655646748_8118\">Waiting until the last minute to live in the moment and discover your process.</li> <li id=\"yui_3_17_2_5_1487655646748_8120\">Making type talk and losing your loyalty to style.</li> <li id=\"yui_3_17_2_5_1487655646748_8122\">The One Two Three Hierarchy and type instead of typography.</li> <li id=\"yui_3_17_2_5_1487655646748_8124\">Erik Mood Board as a starting point and solving specific problems.</li> <li id=\"yui_3_17_2_5_1487655646748_8126\">From Point A to Point Paid.</li> <li id=\"yui_3_17_2_5_1487655646748_8128\">Untrained eyes that break you out of tunnel vision.</li> <li id=\"yui_3_17_2_5_1487655646748_8130\">Owning the \"the\" and the importance of representation in the corporate world to explain your value in the marketplace.</li> <li id=\"yui_3_17_2_5_1487655646748_8132\">Giving in to what your best at and becoming a Billy.</li> <li>Type or illustrations of type?</li> <li id=\"yui_3_17_2_5_1487655646748_8134\">The evolution of Blogs, social media, and fixing things at 7000% zoom.</li> <li id=\"yui_3_17_2_5_1487655646748_8136\">Thirty Day Challenges that will kick you in the ass and spark inspiration.</li> <li>Keeping your finger on the pulse of what you like and injecting that directly into your work.</li> <li>Do you have something for actually say?</li> <li>Collecting what you feel in the moment to be the best storyteller you can be.</li> <li>Four things you have to do versus the one thing you want to do and recalibrating your toolset for optimal workflow.</li> <li>Less likes as a metric for what's working better.</li> <li>Learning through your eyes of your children and finding the bird.</li> <li>Custom made letters and the worst misspellings of all time.</li> <li>Jaded from excessive signage and trimming the fat.</li> <li id=\"yui_3_17_2_5_1487655646748_8151\">Dream things to hang in your office and a 1:1 scale brontosaurus.</li> </ul>", "duration": "01:06:15", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID533i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1487232000, "title": "532 - The State Of Creativity with Shane Valentino, Paco De Leon, and Dave Kloc", "author": "", "summary": "<p id=\"yui_3_17_2_1_1486972514974_430381\">The State Of Creativity is the latest AID Live from Los Angeles installment where Mark has brought together three creative professionals from different walks of life to discuss where we are and where things will be going. It seems like current events will continually raise the stakes on democracy with issues that demand our attention and understanding and that can really take its toll on  most of us. Shane Valentino comes to us from the world of film, Paco De Leon has an unshakeable grasp on finance, and Dave Kloc brings his Andy Richter-ing to new peaks as our guests bring insight, intelligence, and inspiration for anyone's uncertain future in the creative forces. This AID Live is  a motivational boost to stand up, be heard, and carve your niche out of the resources and community you have around you. Whether your already digging the ditch or waiting for the opening you've been searching for, The State Of Creativity is an incredible resource to find your way through a difficult time ahead.</p> <p>Talking Points</p> <ul> <li>Taking logs to a fire while you resist and relax.</li> <li>Keeping your forearms tight and Dave Kloc's pre printing ritual.</li> <li>The ACLU collab that raised close to $5,000 from a Hissing Booth.</li> <li>Meeting the Madonna of finance and lighting up the internet.</li> <li>Financial literacy and separating bookkeepers from accountants.</li> <li>What's the worst question Paco gets?</li> <li>Bringing accountability back to the masses, pie allocation, and lumpy cash flow. </li> <li>Saving for the financial rainy days ahead and a helpful firewall to keep you honest.</li> <li>The Anarchy Skills you need and practical advice about your money that you need even more.</li> <li>Seeing past the doom and gloom and picking up some of the shattered pieces.</li> <li>The strategy behind moving to New York and the simultaneous careers that leave you room for better work. </li> <li>Multiple metrics that keep the dream alive.</li> <li>The zeitgeist (literally) behind the scenes and the positive discourse that came out of the election.</li> <li>Waiting for the face of resistance from Hollywood and the time it takes to find a voice.</li> <li>Giving back to the world and still feeling like an asshole.</li> <li>News resources, the fine line of binging, and fighting the urge to parrot what you've heard.</li> <li>Searching for a different perspective and discovering your empathy.</li> <li>Maintaining motivation in tough times and the pendulum swing between emotion and action.</li> <li>Creating tension and finding the enemy. </li> <li>Shaming creatives stay out of politics and the dangerous us versus them mentality. </li> <li>Front of the class and back of the class kids.</li> <li>The many levels art and creativity function at.</li> </ul>", "duration": "01:01:03", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID532i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1487145600, "title": "531 - January Poster Countdown with Mitch Putnam", "author": "", "summary": "<p id=\"yui_3_17_2_1_1486972514974_350487\">The Poster Countdown returns with Mitch Putnam back on the mic and Mark Brickey making the selections as they rank the best of the best from the month of January. These two image aficionados critique what makes each poster great and brings to light the tips and tricks that set each image apart. From image sources to compositional choices, no stone is left unturned as all ten choices from OMGposters.com get put through the ringer to give you more insight and greater foresight when you sit down to create. Mitch and Mark also offer up well kept industry secrets about crafting a career in the creative world and the business behind every great artist. January is jam packed with incredible picks that push the poster community to achieve new heights and continually refine an art form that has captured the imagination of millions of people. Throw in a couple of indie hits and some pop power plays and you have an ultimate countdown like none before it's existence.</p> <p><strong>Talking Points</strong></p> <ul> <li>Are you too close to someones else's signature style?</li> <li>Trends in design and influencing the next generation.</li> <li>The three levels of composition that can make a poster great.</li> <li>Straight glass breakage and source image politics.</li> <li>Are you building an interesting image?</li> <li>Real world elements and levels of originality.</li> <li>New views and compliments form the neck down.</li> <li>Gauging the proper amount of detail.</li> <li>Developing your own style and sticking to it.</li> <li>Unearthing the magic of your own style.</li> <li>Achieving new levels of depth with CMYK.</li> <li>Making and breaking your own rules within a piece.</li> <li>The career you have and the career you think you want.</li> <li>Working within scarcity.</li> <li>A Jay Ryan world  and his wife's children's books.</li> <li>Working through the offbeat hits and licensing strategies.</li> <li>The insane middle ground of film purgatory.</li> <li>Type, layout, and composition.</li> <li>Our generation finds its voice.</li> <li>Finding motivation from competition.</li> <li>A little news about an unnamed poster show.</li> <li>Nailing the concept.</li> <li>Relying on imagery to move units.</li> <li>Starting your story in the middle to maintain attention.</li> <li>Behind Killian Eng.</li> <li>A lesson in overprinting and using your gut to find the appropriate model for a poster release.</li> <li>Deliberately leaving money on the table to line your pockets later.</li> <li>The artist, the title, and the quality.</li> <li>Studying the past to predict the future.</li> <li>Leveling up in a career and capturing the quiet that snow brings.</li> <li>Guided by our libidos.</li> <li>Becoming sexually aware through art and Johnny Appleporn out in the woods.</li> <li>The giclee creation process.</li> <li>Mondo Fan Fury and the fast entry of a rising star.</li> <li>Cementing a new artist's place.</li> <li>The future of Mondo and The Vacvvm.</li> <li>Planning out Mondo Con 2017 and reverse engineering the work to be done.</li> <li>Double dipping.</li> <li>AID in MN.</li> </ul> <p>TEAM WE COUNT DOWN EVERYTHING<br /> TEAM LEO</p> <p>Final Score: Pop 12 / Indie 8</p>", "duration": "55:48", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID531i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1487059200, "title": "530 - Skinner: Part Two", "author": "", "summary": "<p id=\"yui_3_17_2_1_1486972514974_97112\">Skinner returns to take you on an emotional rollercoaster that will exercise your demons and help you make peace with the world at large. Underneath the wild facade of lizard on lizard art is a complex artist working through what makes us all human and an unending search for truth. Mark and Skinner connect through a humanizing interview that we all need to hear to start reconnecting with the people around us. By sharing the life experiences that shaped these two creative powerhouses we can further understand the artist behind the work and the motivations underneath everything. Halfway through things get flipped and Mark find himself in a Skinnerview of his own and lets us in a little deeper to his own past as well. Come bond with a straight edge adult and a wild man vaping the night away talking about everything from the Krull Experience to understanding the momentum of your own heart.</p> <p><strong>Talking Points</strong></p> <ul> <li>Noticing the world around you and your reactions to it.</li> <li>The mechanisms we use to acknowledge people that could seem like an overcompensation.</li> <li>What do you have to lose form someone else's resistance?</li> <li>Opening your heart and the effects of staying on defense mode.</li> <li>Dealing with where your mind goes and keeping your perspective while making lizard on top of lizard art.</li> <li>Depression, anxiety, and the momentum of your heart.</li> <li>Psychological breakdowns and how our idealistic nature goes up against our narcissistic nature.</li> <li>Attaining freedom from suffering.</li> <li>Survival instincts, work ethic, and the non stop cycle of making the next thing to try and bring you happiness.</li> <li>The search for truth and a hopeful shift in the social norm.</li> <li>Jazz in the creative mind.</li> <li>High workouts.</li> <li>A case for and against marijuana.</li> <li>Emotional interpretations, staying in the zone, and not messing with a good thing.</li> <li>A lot of different kinds of abandonment and the common thread that bonds us all.</li> <li>Going Broprah and deciding whether to leave a light on for certain people.</li> <li>One of my parents is dead to me (literally and figuratively) and wanting to change what you can't control.</li> <li>Telling a stranger the stories of your life and taking the power back.</li> <li>Would you trade in your pain for a cool parent?</li> <li>The Krull Experience at Disneyland and being the Bootleg Kid.</li> <li>Toilet paper mummies and the oddities of a child's memories.</li> <li>Watching Hulk Hogan hve sex and making a website for Jake The Snake.</li> <li>The greatness of Bill Burr.</li> <li>Hitting the \"professional artists\" quota.</li> <li>Rising above the regurgitated shit from major media outlets.</li> <li>Skinner's acting chops and his silver screen goals.</li> <li>Idiot. Idiot. Idiot.</li> <li>Money, the Gambler's lifestyle, and investing in yourself.</li> <li>Peaking with Willie Nelson and Wee Man.</li> <li>Funding long term projects that go directly to your audience to give you the ultimate bargaining chip.</li> <li>Finding opportunity in the chaos.</li> </ul> <p>TEAM BROPRAH AND DR. PHILDO</p>", "duration": "01:15:06", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID530i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1486548000, "title": "527 - The DKNG Show: Chapter 7", "author": "", "summary": "<p id=\"yui_3_17_2_1_1486519238775_105994\">The DKNG triumphantly returns for its second year still leading the charge on all things design. Dan and Nathan have been busy since we heard from them doing everything from giant catalogues to product design to character development. Mark takes us into the belly of the beast to go over all projects DKNG has pushed out the door since we rang in 2017. How do they determine billing on their projects? How do they interact with their clients across an entire project? How do they plan out their design work? How do they do what they do so damn well? Step back inside the inner workings of one of the hardest working design studios out there and see why Dan and Nathan continue to stay at the top of their game as leaders in the industry.</p> <p><strong>Talking Points</strong></p> <ul> <li>Reinventing the holiday card over the last four years and changing the oil on the Death Star.</li> <li>B2B catalog at epic proportions with tons of data, style guides, and a lot of backs and forths.</li> <li>Figuring out billable hours for developing sixty pages. </li> <li>Pie slices and pumping the breaks on two hundred and fifty small pieces that make up larger projects.</li> <li>Letting your fans grow up, get jobs, and hire you.</li> <li>Leaning last year's functional system and fixing more surface level design issues.</li> <li>Remembering the purpose of the project.</li> <li>New spins on old to semi old ideas or keeping what works as a standard.</li> <li>A moment on Mark's off brand thighs.</li> <li>Signature style, hand drawn illustration, and discovering the paintbrush tool.</li> <li>Googling thirteen year old girl proportions and the fine line to get it just right.</li> <li>Finding a client that feeds you all their customer facing design needs.</li> <li>Typographic hierarchy and unique purposes.</li> <li>Layering data into good design.</li> <li>Four tiers of confidence that make things easy to read and still leaves some flexible room for change.</li> <li>Treating data in steps and one of the best tricks in the book.</li> <li>Keeping MXPX and The Jesus and Mary Chain the same sizenand the problem solving skills behind typography.</li> <li>The many players involved in working on a licensing deal and establishing first contact. </li> <li>Tonal lighting to bring your illustrations to life and using two separate types of light. </li> <li>Showing a feeling instead of the details and turning the lights on in a bar at the end of the night.</li> <li>Logo placement and tangents.</li> <li>Making it all to deliberately lose some of it.</li> <li>Symmetrical elements and layering more shapes.</li> <li>The process in making a DKNG original illustration and the lego pieces they add in.</li> <li>One tiny part at a time and finishing all over the place. </li> <li>Creating actual space in the classic Star Wars style.</li> <li>How much is enough to make you want more?</li> <li>Are you a painter or a designer?</li> <li>Mark's process on the Fantasyland print versus Dan's process on creating a piece.</li> <li>Going past the threshold on building real world gravity into every piece.</li> <li>Logos and limitations up in lights.</li> <li>The allure of signs that aren't structurally sound and the realistic storytelling behind it. </li> <li>Setting a bar you're comfortable with.</li> <li>Creating feelings and the science behind it that is our job to understand.</li> <li>The importance of a good mockup to help bridge the gap in your client's imagination.</li> <li>Playing rhythm guitar to improve the feel of the room instead of stroking your design ego o the lead guitar.</li> </ul>", "duration": "01:05:27", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID527i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1486454400, "title": "526 - Jay Weinberg", "author": "", "summary": "<p id=\"yui_3_17_2_1_1486114253947_121822\">Jay Weinberg has toured the world and been knee deep in live music for as long as he can remember. From Against Me! to sold out stadiums with The Boss to Slipknot, Jay has kept his passion for percussion at the forefront of his life. These hard days and longer nights taught him everything he knows about artistic expression, finding your place in the world, and doing it as best as you can. On AID 526 we get a look behind the mask at an accomplished young man who went from a teenager filling his fathers shoes to inspiring the next generation of creatives by breaking down the barriers between artist and audience. There is a fire and determination in Jay Weinberg to accomplish whatever he sets his mind to and that energy is dangerously contagious across this entire interview. Just remember, everything is Spinal Tap.</p> <p><strong>Talking Points</strong></p> <ul> <li>Watching your dad transform into the drummer of the E Street Band and hanging with uncle Bruce.</li> <li>Seeking your own influences and drawing parallels while learning to see things from an outside perspective.</li> <li>Connecting with the universe through the arts.</li> <li>How much pressure can you handle as a goalie and as a drummer?</li> <li>Breaking down barriers to see musicians as people.</li> <li>Math, emotion, and doing the job at a \"Do Or Die\" level.</li> <li>Going beyond the music and getting into your mask.</li> <li>A muscle memory audition for Slipknot.</li> <li>When the curtain rises for the very first time.</li> <li>How the body shuts down in a live environment and the horrible comedown afterwords.</li> <li>What's in Jay's ear to stay tight?</li> <li>Unique thumbprints and chasing the perfect feeling.</li> <li>Running with your own thing makes you bulletproof to the ups and downs of the industry.</li> <li>Getting kicked into the deep end in front of thousands of die hard fans.</li> <li>Is age an issue on and off stage?</li> <li>Feedback from Max and translating drumming across generations.</li> <li>Avoiding Madball and your first van tour.</li> <li>Non stop shows with Against Me! and getting kicked out of Madison Square Garden. </li> <li>Supporting your support system and watching Tom become Laura.</li> <li>Relation, Empathy, and being a human in the face of diversity.</li> <li>German Highway WiFi, taking exams on a Blackberry, and calling in to drop out.</li> <li>Leaps of faith and following the rabbit hole while looking for a job job.</li> <li>Giving back to the legacy that helped shape your life.</li> <li>Everything is Spinal Tap.</li> <li>Marrying the loves of your life on a circular canvas and an odd surface. </li> <li>Literally watching paint dry for an event .</li> <li>Obtaining your dreams and realizing your potential in VFW Halls.</li> <li>Getting down to the bare necessities for Slipknot.</li> <li>Keeping cool on the road.</li> </ul>", "duration": "01:16:19", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID526i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1484726400, "title": "515 - Biggie", "author": "", "summary": "<p id=\"yui_3_17_2_1_1484606266389_211955\">Biggie brings his business savior-faire back to Adventures In Design and pulls the curtain even farther back on a successful mindset. Once the romantic idea of starting a business has worn off there is still the day to day ditch digging that most people shy away from. Biggie is the first one there with a shovel, ready to go, and inspiring everyone else to get started. This episode is filled with business and productivity advice that can help you with your focus, motivation, and ability to finish. Biggie is beginning to reap the rewards of his hard work and we can all  learn from his discipline and drive to bring you to the same place... no matter which hallway you choose.</p> <p><strong>Talking Points</strong></p> <ul id=\"yui_3_17_2_1_1484606266389_211942\"> <li>Recapping 2016 for Good Fight and Biggie's life.</li> <li>The insane sci-fi concepts involved with human birth.</li> <li>What records are dropping in 2017?</li> <li>Romantic inceptions versus realistic expectations.</li> <li>Focusing on your goals and not getting sidetracked.</li> <li>Are you wired for multi tasking?</li> <li>Moderating your pie in the sky ideas with your daily goals.</li> <li>Avoiding complacency being the lion ready to go at the top of the hill.</li> <li>Keeping your employees motivated, thinking about yourself, and being fair.</li> <li>Delegation, communication, and being as hands off as possible.</li> <li>Inspiring the inner sect.</li> <li>Vision and inspiration.</li> <li>Looking ahead to plan out success.</li> <li>Keeping an eye on both your responsibilities and your employee's responsibilities.</li> <li>Touching on the Three C's and some impressive organization.</li> <li>Finding time to workout in a busy schedule.</li> <li>Energy upticks form working out.</li> <li>Shoestring Fries and Burpee Pull Ups.</li> <li>Using benchmarks to compare your life's progress.</li> <li>Overcoming the guilt in rewarding yourself.</li> <li id=\"yui_3_17_2_1_1484606266389_211941\">Living within your worst potential means and the wisdom in frugality.</li> <li>Poster framing as a metaphor for everything else in life.</li> <li>The flip side of the struggle and self parking cars.</li> <li>Watch wormholes that represent straight cash money.</li> <li>Paying your dues, taking lumps, and reaping your rewards.</li> <li>2 Hallways. 1 Place.</li> </ul>", "duration": "01:18:31", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID515i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1484207612, "title": "513 - Shop Talk with David Smith & Kloc", "author": "", "summary": "<p id=\"yui_3_17_2_1_1484159917482_66378\">The Double Dave bonanza on Shop Talk continues but this time we have David Smith and Dave Kloc breaking down the week with Mark. Everyone on today's episode brings their perspectives on financial strategies and how the ebb and flow of a Net 30 lifestyle can wear on you. Also Dave, Dave and Mark have all recently dealt with some professional pivots in their careers and the mental fortitude it takes to make it through an uncertain time in life that comes to just about everyone. This Shop Talk gets deep at a moment's notice and always knows how to come back up for some light hearted air so be ready for a rollercoaster of emotions similar to the one you're most likely on financially if you're a freelancer. Now let's go find that guy with the twenty grand and get another paddle in the water.</p> <p><strong>Talking Points</strong></p> <ul> <li>The difference between small corporations, big dollar, and the freelance life.</li> <li>Getting emo in LA with all it's isolation.</li> <li>Choosing happiness over financial comfort.</li> <li>The rollercoaster of the grind or being chained to your paycheck.</li> <li>Financial strategies, multiple bank accounts, and staying ready for tax season.</li> <li>Buying equipment that you've earned.</li> <li>How one project should greenlight the next two.</li> <li>The Net 30 or Net 60 that can sabotage your motivation.</li> <li>Money, work, and the emotional side of getting paid (what you're worth).</li> <li>Both sides of the fence on privilege.</li> <li>The first VHS you ever watched.</li> <li>Bad money and more paddles in the river.</li> <li>Is working with the big boys even worth it?</li> <li>Building blocks versus road blocks.</li> <li>Natural selection in the creative community.</li> <li>Decreasing the distance between whats in your head and whats on the page.</li> <li>Professional pivots.</li> <li>Design past branding and the the importance of the right connections.</li> <li>Staying innovative when you;re an OB.</li> <li>The luxury of moving on from something once you're bored with it.</li> <li>What is crucial in your balance of life?</li> <li>Setting up boundaries and the mental shift it has on productivity.</li> <li>Does everyone feel behind? Does anyone feel respected?</li> <li>Getting stuck and living in the moment to appreciate what you have.</li> <li>Fighting for different results.</li> <li>Who can't you let down?</li> <li>Strength of character, sacrifice, and being kind.</li> <li>Making your work ethic less volatile than your bank account.</li> <li>The success of investing in yourself emotionally.</li> </ul>", "duration": "46:01", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID513i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1481703598, "title": "503 - 3rd Tube of Christmas - Donate To Feeding Long Beach", "author": "", "summary": "<h1 class=\"text-align-center\" id=\"yui_3_17_2_1_1481699634285_681\"> <a href=\"http://www.adventuresindesignmarket.com/donate\">THE 12 TUBES OF CHRISTMAS</a><br /> <a href=\"http://www.adventuresindesignmarket.com/donate\"><strong>TUBE 3 - DONATE<br /> FEEDING LONG BEACH</strong></a></h1> <h3 class=\"text-align-center\"><em>For Our 2nd Annual Holiday Fundraiser We Have Decide To Help Homeless And Hungry People In Need.<br /> We Will Be Asking For Your Donations From Now Until Sunday At Midnight.<br /> 110% Of The Money Raised Will Go To <a href=\"https://www.facebook.com/HelpUsFeedLongBeach/\" target=\"_blank\">Feeding Long Beach</a>.</em><br /> <em>The Brickey Family Will Match Your Donation By 10%</em><br /> <br /> <em>We Will Purchase Toiletries, Underwear, Socks, Plastic Bags (For Food Distribution)<br /> And Other Basic Supplies That You And I Take For Granted But Could Greatly Help A Person In Need.</em><br /> <br /> <em>Watch The Shopping On Instagram Live And Look To This Page For A Copy Of The Receipt Of Purchase.<br /> <br /> <strong>By Donating Your Name May Be Randomly Selected To Win One Of The Following Donated Prizes</strong></em></h3> <p class=\"text-align-center\"><strong><em>$100 Gift Card From Mondo</em></strong></p> <p class=\"text-align-center\"><strong><em>$100 Gift Card From Mitch Putnam of Posters and Toys or The VACVVM</em></strong></p> <p class=\"text-align-center\"><strong><em>$50 Gift Card From PinGameStrong.com</em></strong></p> <p class=\"text-align-center\"><strong><em>Win 1 of 5 DKNG Polar Bear Prints courtesy of  Adventures In Design</em></strong></p> <p class=\"text-align-center\"><strong><em>A Years Subscription To The Circle of Trust</em></strong></p> <p class=\"text-align-center\"><strong><em>$100 Gift Card For The Adventures In Design Store<br /> *On AID/COT Merchandise Only</em></strong></p>", "duration": "01:10:48", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/aidpodcast/AID503i.m4a?dest-id=86759", "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1419366600, "title": "Episode 18  \"A Very AID Christmas Special\" AID18 \"A Very AID Christmas Special\" LIVE From Chicago November 30th, 2012 feat. Landland, The Letterform, Mat Daly & James Flames", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">The third installment of LIVE AID shows brings us back to Chicago at Schubas. Where a near sold out studio audience was treated to the rowdiest, raunchiest and most sincere podcast yet to be recorded LIVE by Adventures In Design. This episode truly is an ADVENTURE for the ears with the best interview of the year by Lanland, a honest and funny chit chat with the Letterform and interesting behind the scenes look at Renegade Craft Fair through the words of co-owner Mat Daly. The show kicks off with some very rowdy nonsense by Mark & Billy and bookends nicely with a very heartfelt Shop Talk featuring James Flames, where for a minute you forget that the boys are sitting on a stage, in a very crowded room, because quite honestly it starts to sound like three great friends discussing their careers along with hopes and dreams for the new year. Sit back in enjoy the BEST episode yet of Adventures In Design! Merry Christmas and Happy Holidays To All! </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">For More About This Episode Visit <a href=\"http://aidpodcast.libsyn.com/AIDpodcast.com\" target=\"_self\">AIDpodcast.com</a></p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["the", "john", "james", "new", "york", "design", "minnesota", "hero", "graphic", "daly", "league", "craft", "bird", "delicious", "mat", "chicago", "studio", "buffalo", "illustration", "brooklyn", "fair", "flames", "minneapolis", "machine", "illinois", "handmade", "renegade", "printmaking", "silkscreen", "posters", "goods", "bungaloo", "vogl", "landland"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1411410442, "title": "Episode 45 Mark McDevitt and Robert Lee of Methane Studios “It’s Not Too Late To Change What You’ve Become”", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Mark McDevitt and Robert Lee of Methane Studios stop by for a inspiring interview and fun shop talk. For two guys that are known to be the funniest guys in design world we get them to actually get deep before they give us some of the best punchlines in the industry. Mark, Billy and James share a bucket of popcorn, have on air staff meeting and decide the fate of Adventures In Design’s future. In this podcasting choose your own adventure, what Adventure In Design will you choose? </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1408548219, "title": "Episode 44 \"The Interview\" featuring Graham Erwin", "author": "", "summary": "<p>Ohio born Graham Erwin joins the Circle of Trust for a interview like no other Adventures In Design has hosted yet. Join Graham while he's cross examined by Mark, Billy and James. Also on this episode Adventures In Design goes to war with a rival gang, the boys debate big payday versus big opportunity and play who has too much paper.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1406678879, "title": "Episode 43 - \"Big Billy Style\" With Special Guest Sean Mort", "author": "", "summary": "<p>Summer insanity has reached and all time high on our schedules, so this week we're recording AID43 live on YouTube for anyone to watch and to participate along with. Mark, Billy, James and very special guest Sean Mort will do a show where we take listener questions live on air with us and let the audience vote in real time who wins the \"wit off\" between Billy & Sean.</p>\n<p> </p>\n<p>(This podcast can be watched in it's entirety on demand via our YouTube channel)</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["dan", "of", "james", "art", "design", "adobe", "mark", "show", "beach", "hero", "graphic", "calendar", "in", "billy", "los", "league", "long", "angeles", "craft", "french", "louisville", "delicious", "paper", "adventures", "sean", "chicago", "illustration", "circle", "trust", "print", "flames", "gallery", "prints", "handmade", "gig", "poster", "printmaking"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1405391945, "title": "Epiosde 42 - \"Stinky Banana\" feat. Gary Booth of Phone Booth Gallery and Dan Kuhlken", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">On episode 42 our first ever art gallery owner Gary Booth of the Phone Booth Gallery stops by to talk about successfully opening up a gallery, doing mobile shows and discusses the overall business model of art galleries. In a friendly exchange Mark brings up all of the negative things he’s ever had to say about art galleries and Gary offers back some similar views, but also a couple of new perspectives on artists and galleries working together. Dan Kuhlken of DKNG stops by Shop Talk, where the guys talk about time management, hidden traps in flash sales and always striving to make Pinkerton.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["dan", "time", "of", "james", "art", "design", "adobe", "gary", "mark", "show", "beach", "hero", "movies", "graphic", "calendar", "in", "billy", "management", "sales", "flash", "los", "league", "long", "angeles", "craft", "french", "louisville", "delicious", "paper", "adventures", "chicago", "illustrator", "illustration", "phone", "boys", "icon", "circle", "trust"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1404188488, "title": "Episode 41 feat. Jeral Tidwell \"It's So Dumb, It's Almost Genius\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 13px; font-family: Helvetica;\">Hear the episode described by founder Billy Baumann as the most important 30 minutes in the entire history of Adventures In Design. Illustrator Jeral Tidwell, also known as Human Tree, stops by and tells the gang about the fine art of copyrighting your own artwork and how doing this properly has resulted in six figure pay days. That’s right I said six figures. All of this legal advice and so much more is waiting for you on this Adventure In Design. </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "james", "art", "design", "adobe", "mark", "show", "beach", "hero", "movies", "graphic", "in", "billy", "law", "los", "league", "long", "angeles", "craft", "french", "human", "louisville", "delicious", "paper", "adventures", "your", "chicago", "illustrator", "illustration", "tree", "circle", "trust", "print", "flames", "prints", "copyright", "artwork"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1402977615, "title": "Episode 40 feat. Charles S. Anderson and Dan Stiles - \"There Is No Disengagement\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Design legend Charles S. Anderson founder of CSA Images stops by and talks about his love of collecting the collectors, space pod monkeys and how the industry has changed over the last 40 years. Old friend and AID alumni Dan Stiles sits in for a informative Shop Talk that focuses on cease and desist letters, knowing your value in negotiating, plus advice on the career long dilemma of budgeting your time. All of this and so much more is waiting for you on episode 40 of Adventures In Design.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["dan", "of", "james", "art", "design", "adobe", "mark", "anderson", "show", "charles", "hero", "movies", "images", "graphic", "in", "billy", "league", "craft", "french", "delicious", "paper", "adventures", "portland", "chicago", "illustrator", "illustration", "circle", "trust", "print", "flames", "prints", "csa", "handmade", "gig", "poster", "printmaking"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1401768778, "title": "Episode 39 “Faking It” feat. The Directors of “Sign Painters” Documentary Faythe Levine & Sam Macon", "author": "", "summary": "<p style=\"margin: 0px; font-size: 14px; font-family: 'Lucida Grande'; color: #474747;\"><strong>Classic AID is back on the podcasting airwaves featuring old favorites like “Hire, Fire or Retire”, “Dog Stories” and the instant classic “Billy Time”. Plus the filmmakers Faythe Levine & Sam Macon stop by to talk to the Circle of Trust about their new documentary “Sign Painters”. This episode was made possible by Jakprints.com.</strong></p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "james", "art", "design", "adobe", "show", "hero", "movies", "graphic", "in", "documentary", "league", "craft", "delicious", "adventures", "filmmaking", "sam", "painting", "chicago", "illustrator", "illustration", "circle", "trust", "print", "flames", "prints", "sign", "levine", "handmade", "gig", "poster", "printmaking", "silkscreen", "posters"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1400565818, "title": "Episode 38 Jakprints Presents “The Podumentary Trilogy: Part III - Return of the Podcast\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 15px; font-family: Helvetica;\">Adventures In Design sails the high seas of Austin, Texas during the 2014 media gathering known as SXSW. This episode features a wide range of AID’s friends, as well as one on one recorded phone calls to wrap up all of the good times of this year’s annual migration to the countries largest festival. This episode was sponsored by jakprints.com.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["james", "art", "design", "kevin", "show", "hero", "movies", "graphic", "in", "martin", "league", "craft", "delicious", "adventures", "chicago", "studio", "illustrator", "illustration", "tong", "mondo", "print", "flames", "sxsw", "mitch", "prints", "putnam", "handmade", "gig", "poster", "printmaking", "silkscreen", "omg", "posters", "ansin", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1395805000, "title": "Episode 37 Jakprints Presents “The Podumentary Trilogy: Part II – The Madness of Mondo”", "author": "", "summary": "<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">The Adventures In Design saga continues with part II of our trilogy with an episode dedicated to the other end of the independent printmaking world during our visit to Austin’s SXSW media festival the collectable limited edition sensation known as Mondo. Listen as we document the fanatic world of poster collecting through the eyes and hearts of the artists, the company and the passionate fans.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong>AID37 Cast & Credits</strong></p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong>Special Thanks -</strong> To all of our friends at Flatstock that allowed us to record their thoughts and good times.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://www.etsy.com/shop/HeroDesignStudio\" target=\"_blank\"><strong>Hero Design Studio</strong></a> - Mark Brickey;  hosting, editing and packaging the show.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://deliciousdesignleague.com/\" target=\"_blank\"><strong>Delicious Design League</strong></a> - Billy Baumann; co-hosting and graphics.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://www.jamesflames.com/\" target=\"_blank\"><strong>James Flames</strong></a> - James Flames; on air producer, mastering and mixing the episode.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://www.jakprints.com/circleoftrust\" target=\"_blank\"><strong>Jakprints</strong> </a>- The official official printer of The Circle of Trust. Use our coupon code and save today.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://www.printed-matters.com/\" target=\"_blank\"><strong>Printed-Matters</strong></a> - Andy Rench for creating this website.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong><a href=\"http://www.mondotees.com\">Mondo</a> </strong>- Thanks for helping us capture their bizarre world with a private gallery viewing and for setting up interviews.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://www.expressobeans.com/\"><strong>Expresso Beans</strong></a> - Stop by and check out the world of print collecting.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong><a href=\"http://www.omgposters.com\">OMG Posters </a></strong>- Mitch Putnam for his time, helping setup this episode and over all support of AID.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong><a href=\"http://martinansin.com/\">Martin Ansin</a> </strong>- Our favorite illustrator / graphic designer from South America.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><a href=\"http://tragicsunshine.com\"><strong>Kevin Tong</strong> </a>- A Poster Man and regular friend to the show.</p>\n<p style=\"color: #333333; font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\"><strong><a href=\"http://open.spotify.com/user/markbrickey/playlist/0eXugnPXW0hCAI2FfDSqBc\" target=\"_blank\">Soundtrack </a> - </strong>Is available on Spotify.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["james", "art", "design", "kevin", "show", "hero", "movies", "graphic", "in", "martin", "league", "craft", "delicious", "adventures", "chicago", "studio", "illustrator", "illustration", "tong", "mondo", "print", "flames", "mitch", "prints", "putnam", "handmade", "gig", "poster", "printmaking", "silkscreen", "omg", "posters", "ansin", "flatstock", "pwints"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1395198334, "title": "Episode 36 Jakprints Presents \"The Podumentary Trilogy: Part I - Friendship and Flatstock\"", "author": "", "summary": "<p>Epiosde I of the Podumentary Triolgy is string of random converstaions and recordings on March 13-14, 2014. Showcasing the fun of Frienship and Flatstock. Where as the epiosde may be light on industry insight, it's heavy on good times. Pull out your latest project, put the headphones on and let the friends of Adventures In Design keep you company for the next two plus hours.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["art", "design", "in", "adventures", "texas", "illustration", "sxsw", "austin", "flatstock", "jakprints"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1394169540, "title": "Adventures In Design - Live Series Episode 01", "author": "", "summary": "<p>This low-fi episode will be available for a limited time only. We hope you enjoy this temporary format while our new recording studio is being built.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1387355100, "title": "Episode 34 A Very AID Christmas Special Volume: II \"The Three Kings of Bullshit\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">The second Christmas installment of Adventures In Design brings us sentimental Christmas stories of the past, Mark's top 5 poster designers of 2013 and the story of Christmas as read by British designer Sean Mort. Enjoy this soon to be holiday classic with someone you love! </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1386227533, "title": "Episode 33 DKNG \"Driving Mr Kuhlken\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Billy Baumann has disappeared and the boys from DKNG stop by to help James Flames and Mark \"Hollywood\" Brickey deal with the grief of not being able to find their lovable little mascot. So all aboard the Billy Train for the thirty third voyage of Adventures In Design… Just don't let Mr Kuhlken drive and we'll all make it to the next episode.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "new", "york", "art", "design", "adobe", "show", "beach", "episode", "graphic", "in", "star", "wars", "education", "review", "los", "long", "angeles", "craft", "students", "california", "crafting", "adventures", "7", "chicago", "race", "buffalo", "illustrator", "illustration", "anne", "benjamin", "circle", "share", "portfolio", "skill", "trust", "prints"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1385442000, "title": "Episode 32 Don Pendleton \"Gleaming The Cubism\"", "author": "", "summary": "<p style=\"margin: 0px;\">It's time to give thanks during our 32<sup>nd</sup> episode of Adventures in Design, “Gleaming The Cubism\".  We've whipped up a delectable episode for your eardrums to feast upon this Thanksgiving.  James, Billy, and Mark share what they are thankful for this year, making everyone feel good from top to bottom. </p>\n<p style=\"margin: 0px;\"> </p>\n<p style=\"margin: 0px;\">Mark gets nostalgic over missing out on Dairy Queen Blizzards this year, and he reveals that he has an ongoing issue with sprinkles.  (It's a lifestyle choice, really.) He can, however, get into the sport of arguing.  James and Billy try to convince Mark that it's okay to watch TV show previews, but he's just not that interested in what they have to say.  Rather, our outspoken host bluntly reveals his stance on bullying, and how it helped shape him into becoming the World's Best Podcaster as he is known today.<br /> <br /> Our guest is the prolific artist known for his legendary body of skateboard graphics, Don Pendleton.  Don began skateboarding in the mid eighties at the age of 14, and has been a part of skateboarding culture for over 20 years, 15 of which have been dedicated to producing skateboard art.  Mark and Don talk about the culture of action sports and the connection between art and skateboarding.  The Do-It-Yourself approach was a homemade outlet for creativity, offering up fresh opportunities to develop new tricks, to make music in bands, and more. <br /> <br /> As you prepare to gather around your family this Thanksgiving, pull up a chair next to your uncle Buck, put on your headphones, and share your holiday with us instead.  Our shop talk will get you into the spirit of Thanksgiving as Mark tells a story about committing food adultery. And as many of you get a few days off work, the work for us hardly ever ends.  James discusses what its like working on the weekends, and how there's solidarity in numbers.  Plus, we've got a grand announcement at the end of the show that you won't wanna miss!  May the future be with you...</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "steve", "new", "york", "art", "design", "adobe", "show", "industries", "beach", "episode", "rob", "workshop", "graphic", "in", "star", "wars", "alien", "education", "world", "review", "los", "long", "angeles", "craft", "students", "california", "crafting", "adventures", "neil", "7", "chicago", "race", "buffalo", "illustrator", "illustration", "nine", "don"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1383632600, "title": "Episode 31 Daniel Danger \"50 Shades of Blue\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: 'Times New Roman';\"><span style=\"letter-spacing: 0.0px;\">AID 31 is so full of industry insiders and design related discussions, it's nearly overwhelming, but before we dive in, Mark shares with us his relationship issues with Monday Night Football. Billy reveals his great idea for a new and improved team name for St. Louis, including his perspectives on  crappy logo designs.  One thing we know for certain, whoever dresses up as Tom Brady this Halloween is getting slapped in the face.  Billy tells a spooky story filled with death and mystery to get us into the spirit, while James plans to become a neighborhood favorite for trick-or-treaters, giving away full-sized candy bars this year. <br /> </span></p>\n<p style=\"margin: 0px; font-size: 12px; font-family: 'Times New Roman';\"><span style=\"letter-spacing: 0.0px;\"><br />Everyone's excited for our extensive interview with the one and only Daniel Danger.  He reveals his “Sting Method” for maintaining stamina while creating his signature, heavily-illustrated prints.  We talk limited editions, timed-editions, dropping out of school, Cowboys and Aliens, and we don't stop there. Just what makes Daniel so Dangerous, anyway?  We're bringing you a colossal, 31</span><span style=\"font-size: 8px; letter-spacing: 0px;\"><sup>st</sup></span><span style=\"letter-spacing: 0.0px;\"> episode of Adventures in Design,  loaded with design and illustration info and a man-sized appetite for full-sized Snickers.  </span></p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "new", "york", "art", "design", "adobe", "show", "beach", "graphic", "in", "education", "review", "los", "long", "angeles", "craft", "students", "california", "crafting", "adventures", "chicago", "race", "buffalo", "illustrator", "illustration", "daniel", "danger", "anne", "benjamin", "circle", "portfolio", "trust", "prints", "poster", "printmaking"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1382419260, "title": "Episode 30 \"XXX\" Featuring Matt Taylor", "author": "", "summary": "<p>AID XXX is cumming your way!  This is our filthiest, raunchiest episode yet.  We talk about jerkin' it, discuss porn preferences, and visualize those wide-angle money-shots in our thirtieth episode of Adventures in Design.  This invasive and provocatively bold episode is like none like we've ever had before.  We promise that it will get your creative juices flowing (though, we make no apologies for any other juices). Billy shares his experiences with accidental porn at work, and we discover Mark's pavlovian reaction to sexually explicit materials.  Is James Flames wearing pants?  (We'll never tell.) \u2028</p>\n<p>From across the pond, we are so pleased to welcome our friend, Matt Taylor, feather hat and all.  We talk design, clients, and the WWF. (You know, wrestling. The real stuff. Not some animal bullshit.)\u2028We're so excited to be back in the studio that we just don't want this episode to ever end.  The musk is seeping through the airwaves. Join us for an extended listen of our “dirty thirty” episode.   Have your tissues on standby, AID XXX is going to blow you...away. \u2028</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["love", "of", "new", "york", "art", "design", "adobe", "food", "show", "beach", "matt", "network", "graphic", "in", "education", "review", "taylor", "los", "long", "porn", "angeles", "craft", "students", "california", "crafting", "adventures", "foodie", "chicago", "race", "buffalo", "illustrator", "illustration", "i", "anne", "benjamin", "circle", "dust"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1381212769, "title": "Episode 29 \"Spacephobia\" from Notstock at Minot State University", "author": "", "summary": "<p style=\"margin: 0px; font-size: 18px; font-family: 'Times New Roman';\">Are you hungry for design? Mark “Babyface” Brickey has a cobra-like appetite for countin' burgers and estimating dead cats in our 29<sup>th,</sup> succulent episode of Adventures in Design. Join us as our three favorite “Big Cheeseburgers”, Mark, Billy, and James, get a hearty education in the arts at Minot State University.  Discover Mark's love/hate relationship with poetry, find out what you can learn from the elegant piece of cinema known as 8 Mile, and encounter travel lessons regarding the proper use of double beds in your hotel room.  We'll be web-slingin' from topic to topic, from the Death Star to Jurassic Park.  Plus, great music is woven throughout this lively episode by local, Folk/Americana band, Wild Hands.</p>\n<p style=\"margin: 0px; font-size: 18px; font-family: 'Times New Roman';\"><br /> We've gotta admit, North Dakota has some of the nicest people in the real, 48 states, but where are all the fucking buildings here?  Is it just us, or is there such a thing as too much space?  I'm afraid we're experiencing early symptoms of 'Spaceophobia'.  The only cure?  Surrounding our artsy-fartsy, city hearts with some truly, down-home guests for a casual chat about design culture here in the “Magic City”.<br /> <br /> We begin with Bill Harbort and Laurie Geller, co-founders and “Fathers” of Notstock, an entertaining, multi-day, arts event hosted by Minot State University.  Laurie discusses the mission of Notstock and how area schools and the community are becoming engaged in the arts, while we ask Bill to talk with us about his passion for American muscle cars and the direct influence these majestic pieces of machinery have on his work.<br /> <br /> Next, Dan Sharbono and Alyssa Weyrauch Sharbono, creative team of 62 Doors Gallery and Studios discuss the adaptability of artists, how environmental setbacks and the growing oil industry are swiftly shaping the landscape for artists seeking space in Minot, and more.   <br /> <br /> Shop Talk is bigger and better than ever, jam-packed with essential design resources. The boys unlock the secrets behind Delicious Design League's registration process and add expert advice on film placement when burning your screens.  The boys keep you informed about issues developing in the printmaking arena as the process gain popularity in the craft fair circuit. Billy gives James art direction on his horrible, gig poster concepts, and finally, we welcome our friend Takuma to the couch to discuss Japanese culture and refrigerators with us.  Join us for maniacal laughs down at the student union, The Beaverchomp, the almost certainly fictional name for what we imagine colleges like name these sorts of things, for an indispensable 29th edition of Adventures in Design. </p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["dan", "of", "new", "york", "art", "design", "adobe", "show", "beach", "space", "graphic", "studios", "in", "muscle", "north", "park", "hell", "education", "poetry", "slam", "wild", "cats", "review", "los", "cars", "long", "angeles", "craft", "students", "university", "california", "crafting", "cat", "artists", "adventures", "state", "bill", "dead", "chicago", "race"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1379400979, "title": "Episode 28 \"LIVE from Weapons of Mass Creation Festival\" feat. Jason Teegarden-Downs, Adam Garcia, Jeff Finley", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: 'Times New Roman';\">We're coming at you Live from the Weapons of Mass Creation Fest in Cleveland as your host, Mark Brickey takes the wheel in this inspirational, 28<sup>th</sup> episode of Adventures in Design.  Jason Teegarden-Downs, Adam Garcia, and Jeff Finley join us for a chat about their humble beginnings, and the boys discuss the advantages/disadvantages of wooden versus metal silkscreen frames, vacuum suction, and dull squeegees.  Mark participates in a mini Spelling Bee, and the crowd goes crazy when he brings out the clippers. James talks about the happiness he finds through the success of others, and Billy addresses a key flaw in the 'living each day like it's your last' mentality.  There's singing. There's hair.  And we don't care.  Join us for another exciting episode of Adventures in Design. </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1376370627, "title": "Episode 27 \"The Road To Weapons of Mass Creation\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: 'Times New Roman';\">Adventures in Design goes off the rails as the boys prepare for their journey to the Weapons of Mass Creation Fest in Cleveland.  No subject is too off-topic.  The boys talk food, from chicken sandwiches to Pop Tarts, and everyone learns an important lesson about washing your mustache after a fresh fish taco.  Stay tuned for an exciting announcement regarding the Billy Bowl, learn successful business strategies for designers, including an authentic look at how important attachment is to your original key imagery.  We say “yes” to having too much fun.  All this and more on the Road to WMCFest, AID Episode 27.</p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1375246380, "title": "Episode 26 Live From Galerie F in Chicago, Feat: Sean Mort, Zissou Tasseff-Elenkoff and Dan MacAdam", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Adventures In Design returns to Chicago for the 3rd live recording in the city that would probably be considered the home for AID. This time around broadcasting from a very warm and sweaty Galerie F on the eve of Flatstock 40, Pitchfork Music Festival and the galley's opening for their one year anniversary show featuring all European poster artists making prints inspired by the works of <span style=\"font-size: 13px; font-family: Arial; color: #232323;\">British novelist Roald Dahl. As self appointed ambassadors of freedom, the AID crew welcomes on the show UK poster designer illustrator Sean Mort, Galerie F owner </span><span style=\"font-family: 'Lucida Grande';\">Zissou Tasseff-Elenkoff and Chicago poster legend Dan MacAdam of Crosshair. A fun rowdy adventure pleasurable for adult children of all ages. </span></p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["the", "of", "john", "new", "york", "art", "design", "adobe", "fire", "kevin", "ohio", "show", "beach", "movies", "music", "graphic", "in", "a", "education", "media", "review", "los", "long", "angeles", "craft", "students", "california", "crafting", "go", "adventures", "wrestling", "sean", "chicago", "race", "promo", "buffalo", "illustrator", "illustration", "cut"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1373956945, "title": "Episode 25 Tom Whalen \"World's Greatest Design Podcast\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Just a year and half ago, the first episode of Adventures in Design was released. One of the first things ever heard on the show was \"Worst Podcast Ever\". Fast forward to today and the show starts of boasting \"World's Greatest Design Podcast\", but don't worry soon there after the conversation shifts to being the best at podcasting is close to being useless (even while celebrating great success the boys can still keep it humble). Switching over to their famous random chit chat the guys all marvel at how manly Billy is for building a staircase on the back of his house, Mark talks about accidentally stumbling into a Sea Festival, talking to podcast listeners in the wild, what they each look for in picking a guests for the show and of course they guys all rally around the future fun of their August appearance in Cleveland for Weapons of Mass Creation. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Illustrator Tom Whalen stops by the show to let everyone know that his career is just as fun as it seems on French paper. Tom goes into his origin story and explains how stumbled upon his minimalistic design style while in art school. Mark explains to Tom that Steamboat Willy was the first ever Mickey Mouse cartoon as the team discusses Southern California's love for Disneyland and they all talk about the scene at comic shows. A good discussion breaks out on is taking the higher moral road the best way to \"kickstart\" a career or do short cuts pay off professionally. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">During the world famous Shop Talk segment the topics range from the rich getting richer, is Obey a cool brand or not, taking your eye off the career ball and losing momentum quickly, Mark offers relationship advice and where to go to meet women when you're a designer, the ongoing discussion of timed edition prints and collect ability, a open hate session on Will Smith, the pleasure in making customers happy versus clients, Eagles football, how to explain pricing models to your clients, always asking for a deposit upfront, how getting paid upfront sucks for motivation and lastly a nice thank you to everyone for helping the show reach 100,000 downloads! All of this and a couple of surprises are awaiting you on your next Adventure In Design. </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["the", "of", "john", "paul", "new", "york", "art", "design", "adobe", "fire", "disneyland", "mickey", "kevin", "ohio", "frank", "show", "beach", "movies", "music", "graphic", "in", "a", "education", "media", "army", "cats", "review", "los", "long", "angeles", "craft", "students", "california", "crafting", "go", "mouse", "adventures", "smith", "wrestling", "sean"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1372151507, "title": "Episode 24 Dan Ibarra of Aesthetic Apparatus  \"Schoolhaus Rock\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Episode 24 starts of with a big announcement that will change the sound of the show, for the first time EVER we find our Adventure In Design starting of with not just 2 voices but 3, that's right the  announcement that James Flames will be joining the show as a full time on air personality/producer. This is great news for all the Team James Flames people out there in podcast land. Not only do the boys introduce a new full time me member to the show but they also introduce a new design game that will certainly sweep the design community by storm Hire, Retire & Fire. Watch your ass could you easily be the next person to get fired by the maniacs at Adventures in Design. Speaking of getting hired, the guys talk about their upcoming live shows at Gallery F in Chicago this July and their headlining appearance in August at Weapons of Mass Creation Festival in Cleveland, Ohio. You can hear the excitement building as the AID summer tour season is quickly approaching, make sure you check out one of this summer's LIVE show recordings or invite the podcast to come out to your city for a design experience like none other on planet earth. If you really want a unique listener experience you can always go out to eat with Mark, in episode 24 Billy and James talk about some of their favorite times out on the road breaking bread and coeds with Mark. However, sharing a dinner out on the town isn't the only way to enjoy some time with Mr. Brickey, you can always instead just ask him to spell words for you, which can be hours on entertainment. Lastly, what wouldn't an episode of the show be without some good ol fashioned complaining about shitty Kickstarter campaigns.</p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Next up Dan Ibarra, from Aesthetic Apparatus, makes his third appearance on the show to introduce the Circle of Trust to Schoolha.us the new group-mentorship program by AA. Dan quickly informs everyone to the new way of thinking going on over at camp AA and Dan also defines that 3 or more people are needed to have a crew. Explaining what they feel is wrong with the current design education process Dan gives a glimpse into the different methods of learning and team building that they hope to create with Schoolha.us. Having a goal and wanting to learn is the key dynamic to being a successful part of the Schoolha.us program, simply put you learn what you want to learn and when you feel you're done, you're done… No more \"force feeding\" style of studio education. Learn more by visiting their new website here: http://schoolha.us As with all things Adventures In Design, eventually the guys debate on the long term effects that Schoolha.us may have on Aesthetic Apparatus. So even if you're a well seasoned pro, you can hopefully relate to the delicate balance of being selfless/selfish with your career, doing what you love and what you have to do, to make a honest living. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Keeping with the educational theme of Schoolha.us during Shop Talk the crew all discuss what they do and don't want to see in student portfolios and their expectations in conversation during the interview process. Moving over to their own work, more specifically showing new work to clients, the guys all discuss managing early client expectations and trying to not let folks leap to ridiculous conclusions on early rounds of work. Also, a lengthy discussion occurs when Mark shares his frustration with clients simply changing their minds and really the scope of projects in the middle of a ongoing job and how this can really effect the designer's bottom line if they don't take up for themselves. Comparing clients to 3 year olds, double taking your way out of jam and standing up for good design are just a few of the bullet points in possibly the longest ever AID discussion on dealing with those that hire you to do what you do… and to hopefully do it well.</p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Every now and again the show even talks about the art of design… Billy initiates a very interesting conversation on a recent Man of Steel poster curated by Mondo. Everyone takes a turn talking about designer influence and paying tribute while still leaving your own fingerprints on your work. See attached graphic below to visually see the conversation about his print and it's rich history and ever richer future. </p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["of", "new", "york", "art", "design", "adobe", "fire", "kevin", "ohio", "show", "beach", "aaron", "rob", "movies", "music", "graphic", "in", "a", "education", "media", "army", "cats", "review", "taylor", "jones", "los", "long", "angeles", "craft", "students", "california", "crafting", "go", "ken", "adventures", "wrestling", "sean", "chicago", "race", "promo", "buffalo"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1370316600, "title": "Episode 23 Ken Taylor  \"Creme on the Cake\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Episode 23 gets to the point pretty damn fast, the episode is all about the interview with Australian illustrator designer Ken Taylor. Ken is known for having a strong body of poster work for the movie, music and art gallery world. He's a regular listener to the show, and president of the Australian Circle of Trust, making him fit right into the conversation with Mark and Billy. Over the span of a 100 minutes the boys cover: How Ken Taylor got his start in Australia and eventually became a well known name in the US poster scene, debate the difference between designing music, movie and art posters, Ken talks about his process and getting lost in the details while working, the amount of time he spends making these pieces, properly pricing jobs, negotiating with clients and Ken even talks about buying and trading posters at Flatstock in Austin, Texas and lastly what posters he has hanging on his own walls at home.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["the", "of", "new", "york", "art", "black", "design", "adobe", "kevin", "frank", "mark", "show", "charles", "beach", "rob", "movies", "music", "graphic", "status", "in", "a", "brothers", "early", "gordon", "burns", "tyler", "taylor", "san", "francisco", "jones", "los", "long", "angeles", "craft", "california", "french", "crafting", "paper", "youth", "ken", "adventures"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1366250449, "title": "Episode 22 feat. Fraser Davidson and James Flames \"The Infographic of Trust\"", "author": "", "summary": "<p> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">British designer/animator Fraser Davidson swings by the show to talk about how \"magic\" makes the budget go up and his exploration of love for sports design and branding. James Flames joins the boys in Shop Talk where Mark puts Billy and James against one another to take on rounds of betting on the Info Graphic of Trust, a listener survey conducted earlier this year by Tom Booth. All of this and more is waiting for you on the 22nd voyage of the Adventures In Design rocket ship!!</p>\n<p> </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["james", "design", "printing", "mark", "hero", "graphic", "screen", "billy", "los", "league", "angeles", "delicious", "chicago", "studio", "illustration", "flames", "davidson", "fraser", "gig", "baumann", "posters", "brickey"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1364186295, "title": "Episode 21 feat. Morning Breath \"How Do I Do What You Do\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Mark & Billy are back from their personal hiatus and have a lot to catch up on! Joined in the studio with Brooklyn based pals Doug & Jason from Morning Breath, the gang cruises through the history of Think Skateboards, how Thrasher Magazine owns everything and try to figure out why LL Cool J doesn't have a Chapstick endorsement? Album cover art, hating contracts, working to pay the bills, hat lessons, healthy girls and so many more topics are waiting for you on Episode 21 of Adventures In Design!! </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "mark", "hero", "graphic", "morning", "league", "delicious", "skateboarding", "studio", "breath", "silkscreen", "posters", "brickey"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1361250854, "title": "Episode 20 \"A Tale of Two Brickeys\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Episode 20 \"A Tale of Two Brickeys\"  - Recorded in two parts. Act one of Mark and Billy's latest adventure was recorded on the eve of Mark's cross country flight to find a new home in Southern California. The show starts with a lengthy, super late, Super Bowl commercial critique where Mark & Billy rate their favorite billion dollars ads and then rant on all those that they hated during America's largest annual Television event. The show then takes a turn where Mark shed's insight into his nervousness and fears for what lies ahead for him the next day. On the eve of a life long dream, to relocate to the Los Angeles area, Mark looks to Billy for insight into Billy's move to Chicago. In one of the more genuine segments of the show's history, Adventures In Design starts to sound much more like two great friends talking on the phone, rather than a recorded podcast for the public. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Act two was recorded one week later where we find out the results of Mark's cross country dreams and find our host in a very different state of mind than we did in act one. Due to a couple of technical problems we find Mark and Billy joined by a surprise guest, non other than James Flames. The known AID trio sits back and have their usual Shop Talk rants and raves where they discuss being interviewed for books, finding an agent, managing supply and demand and whatever else pops into their heads. All while being joined by a very special guest, the talented Dan Kuhklen of DKNG Studios. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Recorded in 5 different cities and edited while flying from coast to coast, the newest Adventure In Design is indeed the tale of two sides of the human mind… The fear of failure and the celebration of succeeding. If you have ever been scared to relocate for your path in life, may this episode be your companion. </p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "graphic", "illustration", "moving", "gig", "posters"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1359514560, "title": "Episode 19 \"Broadcasting Live From A Basement In Cheektowaga, NY\"", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">The 19th adventure takes off with Mark broadcasting \"live\" from his in-laws fiery warm basement in Cheektowaga, NY. Now that Mark is officially homeless, and has nothing but time on his hands, during a 4 month break from design, he and Billy catch up on what they have both been doing since we last found them at the end of November 2012. They also talk about the victory in launching their new show website AIDpodcast.com and how getting that project off of the ground has been a blessing. While discussing Mark's upcoming cross country road trip Billy comes up with the genius idea that they should gather design questions for Mark to ask of strangers along the way from New York  to California. After a heated discussion of standardized goalie masks in the NHL the boys need to cool their jets and take a music break before getting a James Flames hosted shop talk going. In the midst of the audio break, due to not currently having a phone line, Mark shares a classic telemarketer call where a accidental wrong number leads to one memorable email address. The call was made in 2003 long before Adventures In Design had hit the airwaves or Hero had ever even printed their first poster.</p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">James Flames joins the show for his fourth show appearance and third time sitting in on Shop Talk. Out of the gate Mark complains about how shitty CG cartoons are these days, Billy offers some contemporary children's cartoons worthy of checking out and then the whole gang reminisces on watching TV after school back in the day. The gang also tries to figure out the exact label for what it is they all do for a living, which for the fist time in show history, leaves everyone speechless. Even though no one seems to know the exact label the guys share a discussion on how almost everyone's New Year's Design Resolutions where hitting the same themes, the boys debate whether one can ever truly have a proper life balance while owning their own business. Mark and Billy confess their South By Southwest secrets to James and he's not happy with what he hears. </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\"> </p>\n<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">In a interactive media loop, the podcast comments on recent blog drama that has taken place on their website AIDpodcast.com where Calm The Ham and couple of internet tumbleweeds get called out in the discussion. Joking about their new self proclaimed stance as the \"TMZ\" or \"60 Minutes\" of the poster world, the discussion goes deep into exploring why some people may choose to be \"inspired by\" and why others just get greedy, and can't seem to exist in the gray areas of the law. In a weird twist of commentary Mark and Billy debate what their level of customer service should be to those that stop by the website or listen to the show. Then in a moment of loosing his mind Mark decides that designers should start sticking together in the same way that cops do! All of this and more is awaiting you through the brotherhood of design known as Adventures In Design Episode 19. </p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["james", "design", "mark", "hero", "billy", "league", "delicious", "studio", "illustration", "flames", "baumann", "brickey"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1353992340, "title": "Episode 17 \"Epic Never Happens\" LIVE from Masthead Gallery in Philadelphia, PA", "author": "", "summary": "<p>Episode No.17 finds our Hero, Mark, being held hostage in a warehouse located in Philadelphia, PA where a squeegee biker gang called The Awesome Dudes have taken him and local shop owner Shawn Hileman as their prisoners. Can Billy use the power of the internet to disarm the threat before it reaches EPIC levels? Along with the help of Kevin Mercer, Billy races against time to free Mark from the Awesome Dudes deadly grip and save the Masthead Gallery.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "graphic", "making", "philadelphia", "print", "gig", "silkscreen", "posters"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1352360145, "title": "Episode 16 \"Live From West Virginia University\" featuring the WVU printmaking department.", "author": "", "summary": "<p style=\"margin: 0px; font-size: 12px; font-family: Helvetica;\">Episode 16 finds Mark & Billy live in the great state of West Virginia where they attempt to entertain the WVU printmaking department in Morgantown. AID flips the script on episode 16 by having Mark & Billy sit on the hot seat as they're interviewed by the printmaking students at WVU. </p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "university", "west", "making", "wrestling", "illustration", "iron", "virginia", "print", "printmaking", "silkscreen", "posters", "sheik"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1350476232, "title": "Episode 15 \"Live From Chicago\" featuring Jay Ryan, Shawn Smith and Little Friends of Printmaking", "author": "", "summary": "<p><span class=\"Apple-style-span\" style=\"border-collapse: separate; font-family: Helvetica; border-spacing: 0px; font-size: medium;\">Mark and Billy triumphantly return live on stage from Schubas in Chicago. Joined by an all-star cast of Illustrator and poster design friends: Jay Ryan and Little Friends of Printmaking, as well as multimedia artist Shawn Smith of Shawnimals. As the guys navigate their way through their first live podcast you'll hear rousing tales of frustration and inspiration from the front lines of the design world, an audience participated Shop talk Q&amp;A session, and the most unexpected few rounds of \"The Newlywed Game\" ever played. All this, and everything in between on this LIVE episode of Adventures in Design.  </span></p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["the", "design", "graphic", "bird", "toys", "illustration", "vinyl", "machine", "printmaking", "posters", "shawnimals", "collectable"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1347917422, "title": "Episode 14 \"The Hum of Hate\" featuring Dan Ibarra of Aesthetic Apparatus", "author": "", "summary": "<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">“The Hum of Hate”…If shitting out nuggets of wisdom we’re a paid gig, Mark and Billy would be living the good life out in Beverly Hills with Will Smith and the guy who played Balki Bartakamous on Perfect Strangers.  Welcome back faithful listeners to adventure no.14 a.k.a. The Hum of Hate…Truer words have never been spoken about design, and about life really. But like they do every episode, the guys set out to examine the details surrounding this sentiment. </span></p>\n<p style=\"margin: 0px;\"> </p>\n<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">At the top of the show we are treated to some select stories about Billy’s rapidly approaching wedding (congrats Billy, by the way), and Mark goes off on a rant about his contempt for those who wish to reduce the mustache to a mere novelty. While most men with handlebar mustaches look like they should be engaged in almost constant conversation about kazoos, I must side with Mark on this one (Mark was in my wedding and one of three handlebar mustachioed men including myself). Next up is a rousing edition of “Mark fucks with Telemarketers” in where a very willing salesman seems way too aroused at the prospect of being drawn by an “artist” over the phone. On to my favorite part of the show <em>Shop Talk</em>, this is where bullshit artists like me get the real scoop on what’s goes on in the world of graphic design. Joining the guys this week is none other than the inimitable Dan Ibarra of Aesthetic Apparatus. Fresh off a new Typeface release and knee deep in the middle of creating a line of gift-able items called “Haute Crap”, Dan helps weigh in on a few key issues. The guys answer some listener questions about the economy of using a 3</span><span style=\"font-size: 8px; letter-spacing: 0px;\"><sup>rd</sup></span><span style=\"letter-spacing: 0.0px;\"> party printer from the standpoint of the struggling designer, and Dan makes some great points about the value of the passion that is required in order to have a successful business----that and making sure you don’t squander all your profits on cocaine. Things start to heat up when Billy reveals just how much he judges other poster artist’s ability…errrr…umm, inability to properly screen-print, causing what is sure to be an instant loss in newbie poster artist listenership. Bringing the topic back into the realm of Simplify vs. Detailed, the guys compare the work of two prominent poster artists, Jason Munn and Aaron Horkey. Through this debate, we are reminded of the benefits of both schools of design thought to the point where both artists’ work can be equally appreciated. Finally, the guys discuss the economy and the ethics of submitting your work to a Gallery show, is it worth your time and effort as an artist? Fuck if I know, I just write the copy. </span></p>\n<p style=\"margin: 0px;\"> </p>\n<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">Don’t forget that the live show is September 26</span><span style=\"font-size: 8px; letter-spacing: 0px;\"><sup>th</sup></span><span style=\"letter-spacing: 0.0px;\">, 2012. If you are in the Chicago area and can make it out, your participation would be much appreciated. Ticket sales and other info after the jump. Adios for now.</span></p>\n<div> </div>\n<div>\n<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">A few notes:</span></p>\n<p style=\"margin: 0px;\"> </p>\n<p style=\"margin: 0px;\"><span style=\"font-family: Symbol; letter-spacing: 0px;\">♦</span><span style=\"letter-spacing: 0.0px;\"> Mark does an amazing Native-American accent</span></p>\n<p style=\"margin: 0px;\"><span style=\"font-family: Symbol; letter-spacing: 0px;\">♦</span><span style=\"letter-spacing: 0.0px;\"> New Zealand and Australia are the same place</span></p>\n<p style=\"margin: 0px;\"><span style=\"font-family: Symbol; letter-spacing: 0px;\">♦</span><span style=\"letter-spacing: 0.0px;\"> Billy is only single for a few more weeks (pregnant strippers are his fav)</span></p>\n<p style=\"margin: 0px;\"><span style=\"font-family: Symbol; letter-spacing: 0px;\">♦</span><span style=\"letter-spacing: 0.0px;\"> Dan is good at stroking……egos</span></p>\n<p style=\"margin: 0px;\"> </p>\n<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">Patrick M.</span></p>\n<p style=\"margin: 0px;\"><span style=\"letter-spacing: 0.0px;\">A.I.D. Reporter on the Beat  </span></p>\n</div>\n<div><span style=\"letter-spacing: 0.0px;\"> </span></div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["art", "design", "hero", "graphic", "league", "delicious", "studio", "illustration"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1345509718, "title": "Episode 13 \"Blow Sunshine Up Their Skirts\" featuring Kevin Tong", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica;\">Featuring famed poster designer & illustrator Kevin Tong. Mark & Billy try to get into Kevin's well protected ego to see if he thinks of himself as a success in the art scene. The boys pick their favorite ways to die, as well a shop talk that looks deeply into the fear of failure, projecting success but keeping it real at the same time and lastly a detailed suggestion of pricing out that next non prof gig that you get asked to do. All this and more awaits you on the this episode Adventures In Design.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "kevin", "graphic", "punk", "business", "entrepreneur", "illustration", "tong", "sunshine", "print", "gig", "silkscreen", "posters", "tragic", "illustrators", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1343710618, "title": "Episode 12 \"Designers Just Wanna Have Fun\" featuring James Flames", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica;\">Mark & Billy reveal who their first sponsor is. The second installment  of guys only. The boys reminisce about the old days of professional wrestling, not being able to sing and being open minded on partying with people that are different than you.  No interview on this episode just a mega long Shop Talk, with the first ever sit in guest, the talented James Flames. This episode of Shop Talk covers design topics like carpal tunnel syndrome, \"inspired by\" art prints and art shows.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "graphic", "punk", "business", "french", "paper", "entrepreneur", "illustration", "print", "wacom", "gig", "silkscreen", "posters", "illustrators", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1341350820, "title": "Episode 11 \"Standing On The Shoulders Of Giants\" featuring Raymond E. Biesinger", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Georgia;\">Episode 11 kicks off with the normal nonsense that has started to define the start of the show… The design podcast that takes at least 10-15 minutes before they actually even start talking about design. In the chitter chatter of non design related topics you'll hear about rescuing dogs and the first ever guy's only segment featuring \"Uncle Brickey's Recipe For Perfect Summer Balls\". This time around the Circle of Trust goes north of the border to Montreal, Quebec to interview Raymond Biesinger a international man of editorial illustration. Raymond, a regular listener of the show, fits in well as the third wheel and openly talks about how he got into making editorial illustration his main design discipline and at times being the in the sweet spot of turning down 2-3 jobs for every one job that he agrees to. Raymond also shines a little light on to getting clients to \"Auction for your time\" and about how important it is for him to make sure that his client projects provide enough finical security so that he can afford to get involved in his own passion projects that normally have little to no money attached to them. A great honest and modest interview that intelligently explains the difference between illustration and design careers, his love of history and 101 things you probably didn't know about Canada. During the world famous \"shop talk\" segment, the show covers the topics of how the creative process works for Mark & Billy individually, advice on when to price a project and how to react to unsettling feedback from your clients. Plus, where to sell your prints online, thoughts on the poster collector website Expresso Beans, advice on picking a good art festival, all of these topics and many more are waiting for you on this episode of Adventures In Design.</p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1340198822, "title": "Episode 10 \"This Currency Doesn't Add Up\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Georgia;\">A I D E-XTREME! The most E-XTREME Adventures In Design yet!!! Mark & Billy, as always, go over a wide range of non-design related topics, but somehow find themselves ranting and raging on how they may have picked the worst industry in the world to be a part of. The boys are joined in the studio by long time friend John Solimine from <a href=\"http://www.spikepress.com/\"><span style=\"color: #123cee;\">Spike Press</span></a>. John is a Brooklyn-based designer who recently just finished his first iOS app titled <a href=\"http://itunes.apple.com/us/app/dragon-brush/id525049909?mt=8\"><span style=\"color: #123cee;\">Dragon Brush</span></a>. The interview that follows is a very honest and realistic depiction of what it takes for illustrators to create long-term projects with little to no money attached, thus creating a true labor of love.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "press", "graphic", "halloween", "punk", "business", "dragon", "mountain", "soccer", "spike", "entrepreneur", "soda", "illustration", "bull", "brooklyn", "terrier", "print", "brush", "gig", "silkscreen", "dew", "posters", "illustrators", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1339084800, "title": "Episode 9 \"What's Inside You\"", "author": "", "summary": "<p style=\"font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">Mark and Billy are back with their ninth episode and this time around they have Mitch Putnam & Rob Jones in the studio with them. Mitch Putnam run's the popular poster blog <a href=\"http://omgposters.com/\" target=\"_blank\">omgposters.com</a> and Rob Jones is a Grammy winning, seasoned poster veteran who is probably most known for his ongoing working relationship with Jack White and all of Jack's musical projects. Mitch & Rob are also 2/3 of the poster powerhouse Mondo, the company that releases some of the finest posters in our art movement. Mondo acts as the middle man between big movie studios and amazing DIY illustrator /designers around the globe. With these four highway men in the studio together, the conversation covers the past, present, and future of poster making, as well as what goes into creating original artwork for various medias, like movies, bands, etc. Aside from this fascinating look into one of the biggest names in today's poster world, episode 9 as always, covers a wide range of design, business and personal topics that Mark and Billy have encountered since the last time they sat down to have this conversation with you.</p>\n<div> </div>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "frank", "rob", "movies", "movie", "graphic", "jack", "punk", "business", "fab", "jones", "white", "entrepreneur", "illustration", "mondo", "sale", "print", "stripes", "shepard", "gig", "silkscreen", "omg", "posters", "illustrators", "fairey", "flatstock", "kozik"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1337863447, "title": "Episode 8 \"One Frame At A Time\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Georgia;\">Episode No.8 covers, as always, a wide spectrum of topics ranging from Billy's new-found love of public transit and Mark's new-found love of Southern California. The Adventures In Design boys discuss 5 brands that make magic, debate the differences between freelance & agency work, give advice on getting started at the local level in the gig poster world, the first ever on air art critique of poster designer Lance Lester and talk about making a contract out of your mistakes. All of this and more on Episode No.8 of Adventures In Design is waiting for you on your favorite podcasting device!</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "graphic", "punk", "business", "entrepreneur", "illustration", "print", "gig", "silkscreen", "posters", "illustrators", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1335904552, "title": "Episode 7 \"Want For More\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica;\">Mark & Billy are joined by illustrator James Flames, Allison Glancey and Craig Seder known as Strawberryluna and Mike King from Crash America. Portions were recorded during Flatstock at SXSW in Austin, Texas. This is a podcast about the people who have let good design and bad dreams destroy their lives. Enjoy!!! </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "rock", "small", "graphic", "punk", "business", "entrepreneur", "illustration", "print", "gig", "silkscreen", "posters", "illustrators", "flatstock"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1334212898, "title": "Episode 6 \"Mark and Billy's Infinite Playlist\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica;\">Designer Mark Brickey, member of Hero Design Studio, meets Delicious Design League's Billy Baumann when he asks him to be his podcast cohost for five minutes. Along the way they learn about Print Mafia, John Vogl of The Bungaloo, life, death and they even learn something about themselves. It's a cross country road trip they'll never forget! Filmed on location during SXSW (South By Southwest) in Austin, Texas.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "printing", "hero", "graphic", "screen", "league", "delicious", "studio", "illustration", "print", "sxsw", "gig", "mafia", "posters", "flatstock", "bungaloo"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1331232390, "title": "Episode 5 \"The Brotherhood of the Traveling Poster\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 9.0px 0.0px; font: 13.0px Verdana; color: #333233;\">Three best friends Mark, Billy and Dan Stiles hatch a plan to stay connected with one another as their lives start off in different directions: they pass around a secondhand poster that fits each of their design styles perfectly.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["dan", "design", "hero", "graphic", "humor", "league", "delicious", "studio", "illustration", "gig", "printmaking", "stiles", "posters"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1329888118, "title": "Episode 4 \"Celebrate Your Obsessions\"", "author": "", "summary": "<p style=\"margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px Helvetica;\">Mark and Billy make a new friend Aaron Draplin and he teaches them the true meaning of snowboarding… antics ensue. </p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["art", "design", "rock", "graphic", "punk", "illustration", "gig", "posters"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1328259663, "title": "Episode 3 \"I Fear No Monday\"", "author": "", "summary": "<p><span style=\"font-size: small;\">Mark's feeling down about the lack of podcasting popularity, Billy tries to cheer him up by inviting Dan & Michael from Aesthetic Apparatus to join them on a skiing trip... antics ensue.</span></p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "burger", "diy", "graphic", "king", "concert", "illustration", "gig", "printmaking", "posters", "silkscreening"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1326869085, "title": "Episode 2 \"Sun Room\"", "author": "", "summary": "<p>Mark & Billy get invited into the Sonnenzimmer with their new friends Nick & Nadine... Somehow Billy gets locked out, antics ensue.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "hero", "graphic", "league", "delicious", "studio", "illustration", "gig", "posters", "desgin", "sonnenzimmer"]}, {"seriesId": 503341322, "seriesTitle": "Adventures In Design", "pubDate": 1325707200, "title": "Pilot", "author": "", "summary": "<p>\"Pilot\" Mark and Billy stumble upon the idea of making a podcast about design... only to find out that they're not very good at it.</p>", "duration": "", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music4/v4/13/7c/e3/137ce3c4-99a4-f9ee-5e5c-23a82c8e9705/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["design", "hero", "graphic", "screen", "league", "delicious", "chicago", "studio", "buffalo", "illustration", "sxsw", "silk", "gig", "posters"]}]}