{"series": {"feedUrl": "http://feeds.feedburner.com/OffCameraWithSamJones", "genres": ["Arts", "Podcasts"], "title": "Off Camera with Sam Jones", "country": "USA", "author": "PodcastOne", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "type": "series", "id": 642483864}, "episodes": [{"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1488441660, "title": "92. Gillian Jacobs", "author": "", "summary": "It took a minute or 92 for people who watched Gillian Jacobs' stunning performance in Don't Think Twice to connect her with Community's Britta Perry. That she could inhabit such different roles so believably without ever having trained in comedy or improv is a tribute to her talent. Whether it's a tribute to Julliard is up for debate. A quirky, independent kid jettisoned by friends who saw her as a drag on their popularity, Jacobs threw herself into theater; later, Julliard almost threw her back out. It took her awhile to realize control can't fix an alcoholic parent or a conventional performance. But eventually, the kid who comes home with gum in her hair may also come home with a stronger sense of self. We talk to Jacobs about scaring herself silly, hanging out at celeb hot spots like the La Brea Tar Pits and playing the sex and drug addicted wrecking ball Mickey on Netflixs Love. Which we love.", "duration": "01:02:36", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP092_Jacobs_seg1_1717511.mp3?awCollectionId=905&awEpisodeId=1717511", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 92. Gillian Jacobs Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1487872860, "title": "91. Sam Richardson", "author": "Sam Richardson", "summary": "If youve seen Veep, you likely know Richard Splett, which could mean you know Sam Richardson. It more likely means you know what it is to be so convinced by a performance that youre unsure where the actor stops and the character begins. How does an artist make that happen, especially when hes the newcomer to one of the most talent-packed comedies on TV?  Well, it might be a stretch to say Richardson grew up on the mean streets of Detroit, but growing up on the citys tough comedy stages taught him a thing or two. Now, Motor City serves as backdrop and inspiration for his own TV show. We discuss the parallels between playing a pitchman on Detroiters and actually pitching Detroiters, and how growing up between two countries inspired its unique take on race and traditional sitcom relationships. He also explains why a fake laugh is no courtesy, but a crime against humanity.", "duration": "1:02:48", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3304750/3304750_2017-02-23-125450.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 91. Sam Richardson Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1487268900, "title": "90. Kenneth Lonergan", "author": "Kenneth Lonergan", "summary": "Let's face it, Kenneth Lonergan will never be the Mr. Rogers of Hollywood. He's learned (kind of) to placate studio brass, but mourns the days when writers and directors had more artistic control (Nobody told John Ford to make Grapes of Wrath less depressing), and wishes he could just be left alone, trusted to deliver great films on his own timeline. After Manchester By the Sea, maybe that will finally happen. He's proven three times now that no writer possesses a keener ear for dialogue, no director a better sense of story, and no observer of life a more merciless grip on how it really works. The subject of his films? Us. Human beings. So why are they called small? Its not often we get inside the head of someone who's given so much thought to his craft and the world he makes it in. We didn't emerge unscathed, but we also didn't leave without hope.", "duration": "1:05:00", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3302291/3302291_2017-02-16-130631.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 90. Kenneth Lonergan Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1486627260, "title": "89. David Oyelowo", "author": "David Oyelowo", "summary": "It has been said that David Oyelowo makes film stardom look as easy as laughter, and it is a joy to watch such a truthful and talented artist find success. But friends, it was not easy. He had to stand up to a much-loved father who had different ideas for his career. When he tried to build on his UK success with the fascinating real-life story of an unknown boxer, he was told viewers wouldn't be interested in people they knew nothing about (that would be black people). Feeling his only chance to move forward was in the U.S., he uprooted his family and struggled to get his breakout role in Selma. His agents were told, David Oyelowo is not Dr. King. Someone higher up told him otherwise. We talk about characters and character, storytelling, and why who does the telling really matters. Yes, he's a joy to watch. And to talk with.", "duration": "1:18:43", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3296095/3296095_2017-02-08-190435.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 89. David Oyelowo Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1486022460, "title": "88. Elijah Wood", "author": "Elijah Wood", "summary": "When you start acting - and very successfully - at eight, its easy to be jaded, obnoxious, or in rehab by the time you're say, 12. Elijah Wood ran the gauntlet of childhood fame unscathed (thanks, Mom), only to sign on at 18 to what no one, including Peter Jackson, knew would be one of the most massively successful cinema franchises ever. He could've gone a number of ways from there, the most obvious being spending the rest of his career trying to top The Lord of the Rings. But that's not really Wood's deal. He chooses interesting filmmakers over star-making roles, loves fulfilling his compulsion to get weird, wonderful stories out in the world, and calls Fantastic Fest his favorite week of the year. Artist? Explorer? Definitely. Calculating careerist? Not so much. \"If I'd thought strategically, I might be in a different place, but I'm so happy being where I am.\" For someone with no strategy, he's one of the smartest guys we know.", "duration": "1:03:03", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3289496/3289496_2017-02-01-162936.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 88. Elijah Wood Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1485417660, "title": "87. Ricky Carmichael", "author": "Ricky Carmichael", "summary": "Ricky Carmichael would like to be able to explain what made him The GOAT. The work - figuratively and often literally backbreaking - is a given. But how do you explain split-second instinct, something that you just do? You can't. So motocross fans and riders everywhere just sat back and watched in awe as he won race after race. It was, after all, what he was expected to do - and did do - from the age of six. He might've made it look easy, but it wasn't. Nor was it always happy. Carmichael talks about his motivation, the strategies he used to beat the best riders in the business, and his decision to retire from racing at 27 (not that there was much left for him to accomplish besides possibly paralyzing himself). Now, he's seeking his challenges on the other side of the handlebars and finding new joy in the sport that made him a legend.", "duration": "1:08:37", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3283466/3283466_2017-01-25-213506.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 87. Ricky Carmichael Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1484812860, "title": "86. Aaron Paul", "author": "Aaron Paul", "summary": "If you'd happened to be skulking the seamier alleyways of Albuquerque around 2008, looking to bum a 3:00 a.m. cigarette - or perhaps a more powerful stimulant - you might've encountered a guy who looked a lot like Aaron Paul. He was looking to score an understanding of the role that changed his life. It was one he'd fought ten Ramen-fueled years for, and he was going to give it everything he had. Extreme research, maybe, but the connection he forges to each character he embodies is so deep, we not only believe them, but feel their every blow, doubt and happiness as our own. In acting parlance, it's called commitment. In Paul's case, love seems the better word. He cherishes and cares for his characters as friends, and embraces his job with the joy of someone who gets to prove time and again that he's really good at the only thing he's ever wanted to do. We talk about his road from small-town Idaho to sin-filled L.A., his fateful audition for Breaking Bad, and The Path almost not taken. And, why you probably don't want to mess with his mom.", "duration": "1:00:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP086_Paul_seg2_1703303.mp3?awCollectionId=905&awEpisodeId=1703303", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 86. Aaron Paul Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1484208060, "title": "85. Rachel Bloom", "author": "Rachel Bloom", "summary": "Rachel Bloom remembers it all. The childhood neuroses, her first taste of humiliation at the hands of a stranger, the awkward locker room glances and every middle-school taunt. She also remembers how her talent and love of theater could erase so much of it. As they say, its all material. Material, as it turned out, for Crazy Ex-Girlfriend, one of the most original, subversive and strangely uplifting shows on network TV. Her rollercoaster journey there can be traced from a copy of The Martian Chronicles through stints as a singing/floating waitress and one hostile writers room. Bloom fills us in on her life-changing shift from musical theater to comedy, how structure informs creativity, and the show that for all its darkness, offers viewers an empowering, entertaining invitation to discuss our common, but not commonly discussed issues and insecurities. What motivates us to write the show is the pursuit of true inner happiness, which often defies not only stereotype, but what you think should make you happy. We might just break into song.", "duration": "1:03:55", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP085_Bloom_seg2_1700527.mp3?awCollectionId=905&awEpisodeId=1700527", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 85. Rachel Bloom Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1482998460, "title": "84. Greta Gerwig", "author": "Greta Gerwig", "summary": "Fortunately, Greta Gerwig was never comfortable being the charming, likeable ingénue who exists (in Hollywood, anyway) to be adored and/or saved by a male lead. When she came to the realization that she probably couldn't sit by the pool and wait for the scripts to roll in, she decided she had the power to write them herself. Creating your own destiny can be a lot of work, but there's comfort in knowing the result will ring true not only to you, but also to the artists whose work you find most exciting.  It's also the best way to use your own peculiarities and gifts, which in Gerwig's case include a rare lack of artifice, a writerly ear for dialogue, and a way of turning the standard story tropes a few degrees askew. As you'll gather from the following pages, she actually is quite charming and likeable. Just don't tell her you \"liked\" Hamlet.", "duration": "00:00", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP084_Gerwig_seg2_1697063.mp3?awCollectionId=905&awEpisodeId=1697063", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 84. Greta Gerwig Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1482393660, "title": "83. Andrew Garfield", "author": "Andrew Garfield", "summary": "It's hard to come by any better example of a true artist-and split personality-than Andrew Garfield. He came out of the womb  as \"a lunatic, a wild animal, a clown,\" who couldn't hang with rules, threatened to tear up our studio, and regularly butted heads with a father who wanted him to choose a \"safe\" career. He's also piled up acclaim for consistently soulful, vulnerable performances in a career full of uncannily successful projects. He admits to having both a Caligula-like ego, and an \"inner accountant\" who reminds him he'll never be enough. He loves a scene one day and is horrified by it the next. It makes you wonder how he's able to survive as an actor; and also how he could ever survive any other way. Garfield muses on working with directors as diverse as Scorsese, Gibson and Fincher, why he loves acting, and the role of storyteller in celebrity culture. You will never see Death of a Salesman or listen to \"Vincent\" the same way again.", "duration": "1:00:26", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP083_Garfield_seg2_1697055.mp3?awCollectionId=905&awEpisodeId=1697055", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 83. Andrew Garfield Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1481788860, "title": "82. Riz Ahmed", "author": "Riz Ahmed", "summary": "When you grow up ping-ponging between three very different worlds on one very small island, you learn a lot about your place - or lack thereof - in life. Turns out you also learn a lot about acting. Not that Riz Ahmed ever assumed that was an option; despite the joy he found in school plays, he took a look at the entertainment cultural complex and just didn't see playing Taxi Driver Number Three as a feasible way to make a living. Then again, he didn't see much future as a desk jockey either, and over the last 10 years, he's built one of the most diverse and acclaimed artistic careers we've ever had the pleasure of digging into. He's come to realize that specific personal experience resonates across all borders, and why shouldn't it? As he points out, we're all mongrels in one way or another. We sit down with Riz to talk about how his culture informs his art, how life is likely to change after The Night Of and Star Wars, and how one night in a London club taught him that the place where you think you don't belong is exactly the place where you should be.", "duration": "1:00:48", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP082_Ahmed_seg2_1696370.mp3?awCollectionId=905&awEpisodeId=1696370", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 82. Riz Ahmed Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1481184060, "title": "81. Michael Shannon", "author": "Michael Shannon", "summary": "Michael Shannon is not here to entertain you or amaze you with the awesomeness of his performances (though that's usually what winds up happening). So why go into acting, let alone do ten films this calendar year? In the beginning, theater was a way to get a few things off his chest without being told to shut up. Even though he maintains that it's a mystery how anyone acts, time and experience have taught him why: Plain and simple, he's here to help somebody tell a story; and if that story can provide a fuller experience of life for him or his audience, all the better. To do that, \"You have to be able to understand people that you otherwise wouldn't even attempt to understand.\" These days, maybe that's not bad advice for any of us. Shannon shares how the art he found to avoid pain turned into a career, and what he loves about it today. He still has a few things to get off his chest (like people who watch Hitchcock films on iPhones), so read on before you invite him to your next fish fry.", "duration": "01:01:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP081_Shannon_seg2_1694392.mp3?awCollectionId=905&awEpisodeId=1694392", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 81. Michael Shannon Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1480579260, "title": "80. Mackenzie Davis", "author": "Mackenzie Davis", "summary": "Mamas, don't let your babies grow up to be actors. At least not until they've had a nice chat with Mackenzie Davis. A late bloomer who was always \"too loud, too tall and unable to figure out the secret potion of femininity\" would seem a ready-made victim for an industry that tells aspiring actors they should be \"grateful for whatever garbage role we give you, until you become famous.\" Instead, Davis has managed to become famous (and rather quickly) in roles that crush the Bechdel Test, and in the process, set an example for any artist who loves and values both herself and her work. It hasn't been a bump-free road, and as the Halt and Catch Fire star has barely left the starting gate, it's one she's still navigating. That's what makes it all the more interesting - and inspiring - to watch.", "duration": "59:57", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP080_Davis_seg2_1693446.mp3?awCollectionId=905&awEpisodeId=1693446", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 80. Mackenzie Davis Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1479888060, "title": "79. Rob Lowe", "author": "Rob Lowe", "summary": "If you've watched Rob Lowe in St. Elmo's Fire, About Last Night, The West Wing and Parks and Recreation, you know he's got some acting chops. As it turns out, he's also a skilled writer with an intimate voice and a gift for setting a scene. Maybe that shouldn't have surprised me, coming from a guy who cites David Niven as his model memoirist. A raconteur without good stories is just a guy who talks a lot, but Rob's whole life is made of tales that you'll inhale like Häagen-Dazs - some with disbelief, some with laughter, and all with sympathy that might surprise you. He figures anyone can write about being on a hit show, so you might find it more interesting to hear what it's like to be on one that's going down the toilet.\n\nThere's the one about the casting director who begged him not to give up on his lifelong dream of acting until his 18th birthday - the very day he was cast in Francis Ford Coppola's The Outsiders. Or the one about bumping Tiananmen Square off the front pages before entering rehab. But for going viral, you can't beat the one about a sober, loving dad who tries to contain his emotions as he sends his first son to college. But we'll let him tell you, because he is, after all, a storyteller - by profession and by nature.\n\nRob always knew he was more than a pretty face, but too many times, his looks blinded the business to just how much more.  Luckily, Lowe knows how to take a punch (who else calls his celebrity roast \"the greatest night of my life\"?) and go on working, creating and risking. And The Grinder is perfect proof that he should; if you haven't seen it go to Netflix and watch all 22 episodes now - you can send us a thank you note later. \n\nYou won't want to miss a minute of this episode, unless your head is especially susceptible to exploding. If so, you might just want to mute the part about the dead guy strapped to the chair.", "duration": "1:01:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP079_Lowe_seg2_1692485.mp3?awCollectionId=905&awEpisodeId=1692485", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 79. Rob Lowe Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1479369660, "title": "78. Mike Colter", "author": "Mike Colter", "summary": "Like a lot of superpowers, the chip on Mike Colter's shoulder isn't visible, but it's there when he needs it. Cursed with a stable home and supportive parents, he often manufactured his own chips to keep himself motivated as an actor (which he planned on being from the age of eight). But later, the chips got real: Acting teachers who told him he wouldn't make it. Years of broke-ass struggle pursuing his art. Agents who said he could only play one kind of role. Well, throw obstacles at a guy like Colter and he'll thank you for them - before smashing them to pieces. He's at a point now where he could be kicking back and enjoying the ability to pay for groceries, but he has something else to prove: If you think you know who Luke Cage is, you don't. We'd add that if you think you've seen everything this actor can do, you haven't. Not by a long shot.", "duration": "54:49", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP078_Colter_seg2_1691705.mp3?awCollectionId=905&awEpisodeId=1691705", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 78. Mike Colter Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1478678460, "title": "77. Thandie Newton", "author": "Thandie Newton", "summary": "One of the most joyful and rewarding experiences we can have as humans is the discovery of something we passionately love to do-- and even better, the discovery that we're really good at it. For Thandie Newton, that revelation came as a naïve 16-year-old on her first film set. It also came with a horrific experience of abuse. Unfortunately, and incredibly, it was not the last one dealt her by the business she loved. So she had a choice. Be a victim, or do something about it. Newton fought hard for herself, and then seemingly couldn't stop. As she's achieved success, she's used her position to champion women and children not only in her industry, but throughout the world. It wasn't easy finding her voice, but now that she has, look out. Here, she uses it in one of our most wide-ranging, honest and inspiring conversations yet.", "duration": "54:31", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP077_Newton_seg2_1690122.mp3?awCollectionId=905&awEpisodeId=1690122", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 77. Thandie Newton Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1478070060, "title": "76. Mark Duplass", "author": "Mark Duplass", "summary": "Mark Duplass says that early on, he and his brother Jay wanted to be the Coen brothers. After 10 painful years of failure and self-doubt, he realized they were much better off being the Duplass brothers. Sticking to their shared gut got them promoted to Hollywood, where Mark found that success came with too many strings-and meetings-attached. That's when his creative genius (he calls it \"fear of making a bad movie\") turned to the business itself. What emerged was a model for making films exactly the way he wants to, while earning enough to keep making them. As they say, if you want something done right (not to mention better, faster, and cheaper) do it yourself. Could he be any happier? Yeah, probably- if we stuck him in a grimy old 110-degree shed with a drum kit and a Walkman.", "duration": "1:00:57", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP076_Duplass_seg2_1689056.mp3?awCollectionId=905&awEpisodeId=1689056", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 76. Mark Duplass Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1477551660, "title": "75. Ewan McGregor", "author": "Ewan McGregor", "summary": "You might not have recognized Ewan McGregor in his very first stage role, since he was in blackface and a turban, but it likely thrilled him as much as any role he has embodied since. The chance to do anything on a stage in front of people-even if it was just moving a chair-was magical. Some (okay, most) would say dropping out of school at 16 with no prospects or training to pursue acting was a risk. But audiences worldwide witnessed the payoff as he quickly became one of the most successful and versatile actors around, happy and creatively fulfilled. Except for the one story he wanted so badly to tell that he gambled again-this time as a director. If it meant a Scotsman taking on the greatest living American writer, well, where there's no risk, there's usually no magic. And for McGregor, where there's no magic, there's usually no point.", "duration": "1:00:32", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP075_McGegor_seg2_1687953.mp3?awCollectionId=905&awEpisodeId=1687953", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 75. Ewan McGregor Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1476946860, "title": "74. Nick Offerman", "author": "Nick Offerman", "summary": "Nick Offerman will never, ever, have enough time. But then, he's not much inclined to put his feet up. Like most creatively restless artists, his interests abound. But for Offerman, they're not hobbies; they'e disciplines to be studied, mastered and revered for the values they represent. Juggling it all requires defining your priorities and being clear on who you are. Parks and Recreation's comedic secret weapon has built a career, canoes, and a soapbox for sharing lessons so simple we seem to have forgotten them. He joins us to talk about writing, ranting and why he loves his new film The Founder, despite having called its subjects \"purveyors of the McShit Sandwich.\" He also shares why he won't be playing Ron Swanson knockoffs for the next 10 years. That's fine with us, as long as he keeps playing Nick Offerman. You read on for an inspiring, thought-provoking conversation; we're going to go build some birdhouses.", "duration": "57:28", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP074_Offerman_seg2_1686707.mp3?awCollectionId=905&awEpisodeId=1686707", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 74. Nick Offerman Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1476255660, "title": "73. Kate Beckinsale", "author": "Kate Beckinsale", "summary": "There are a few things people forgot to tell young Kate Beckinsale about being an actor: Not every film experience is Much Ado About Nothing; most minors working in foreign countries have chaperones; and, don a pair of rubber trousers at your own risk. Oh well, you learn. And keep learning, if you view yourself as a life-long artistic apprentice. Beckinsale talks to us about the impact of sudden family loss on her life and career, why she chose Russian and French over drama school, and what made her decide to come to the U.S. when things were going just fine in the U.K. She also shares lessons learned (through both tears and laughs) on films as diverse as Emma, Underworld, Nothing But the Truth and Love & Friendship. Beckinsale's path was never conventional and rarely easy, which seems to be exactly how she wants it. It also makes her one of the most intriguing actors-make that people-we know.", "duration": "57:26", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP073_Beckinsale_seg2_1685145.mp3?awCollectionId=905&awEpisodeId=1685145", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 73. Kate Beckinsale Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1475737260, "title": "72. Mindy Kaling", "author": "Mindy Kaling", "summary": "Ever since banging out plays on her mom's typewriter at age six, Mindy Kaling wanted to be a comedy writer. That line of study wasn't on offer at her college, but Dartmouth taught her at least two things: If you hole up in your dorm and deconstruct Woody Allen films, you discover what works. And, in a town where there's nothing to do but drink and sled, almost any crazy play you writer can pack a theater. It can also launch your Hollywood dream career quicker than you ever imagined. But when the first show that hires you is getting creamed, and someone else is cast in the pilot you wrote for you, about you, and named after you, well, that's when you see what you're really made of. Here, Kaling plays herself in a conversation about that first fateful play, race and gender in comedy, and why it's totally cool to love your parents.", "duration": "56:57", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP072_Kaling_1682793.mp3?awCollectionId=905&awEpisodeId=1682793", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 72. Mindy Kaling Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1475132460, "title": "71. Vince Vaughn", "author": "Vince Vaughn", "summary": "It's a funny thing, how we're taught from a young age to wait for permission-to be excused, to have a cookie, even to pursue a dream. But what if there's no one around to grant it? Early on, Vince Vaughn decided not to ask for permission to skip school for auditions, to talk to the ladies, or to move to L.A. to be an actor. That just-do-it approach worked well for creating his breakout in Swingers, and his hilarious turns in films like Old School and Wedding Crashers. Vaughn joined us to share the stories behind some of his most iconic films, his decision to take on more dramatic roles in True Detective and Hacksaw Ridge, and the importance of challenging what you know-especially when you're already pretty damn successful. When you combine a well-documented gift for gab with a philosopher's spirit, this is the conversation you get. Enjoy, and take some notes.", "duration": "58:19", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3058933/3058933_2016-09-28-214533.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 71. Vince Vaughn Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1474527660, "title": "70. Adam Scott", "author": "Adam Scott", "summary": "Like a lot of kids, Adam Scott loved movies, but it was a 5-inch black and white TV and David Letterman that really blew his mind and cemented his secret plan to become an actor. When he finally arrived in L.A., it seemed the welcome mat had gone missing. Fifteen years and countless auditions later, roles in Step Brothers, Parks and Recreation and indies like The Vicious Kind have made him one of the busiest and most versatile actors around. Now in a position to choose and make projects that resonate with his own sensibility, he's also added producing to his busy schedule. In our chat, he talks about overcoming nerves, the amazing stuff you can learn on YouTube, and why he's so excited about chasing new creative material. Maybe it's because, like a certain band, he still hasn't found what he's looking for.", "duration": "55:37", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://serve.castfire.com/audio/3029507/3029507_2016-09-20-181907.64k.mp3?ad_params=zones%3DPreroll%2CPreroll2%2CMidroll%2CMidroll2%2CMidroll3%2CMidroll4%2CPostroll%2CPostroll2%7Cstation_id%3D4546", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 70. Adam Scott Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1473922860, "title": "69. Todd Phillips", "author": "Todd Phillips", "summary": "Imagine yourself in a cage being pelted with spit and various other disagreeable bio-wastes. That would be a fairly bad day for anyone, except maybe Todd Phillips, who comes from the \"by any means necessary\" school of filmmaking. Photography was a way into film school, dropping out of film school was a way into documentaries, and documentaries were a way into Sundance, and... Well, if you meet Ivan Reitman on the street and he asks you if you can write, you do what's necessary. After making The Hangover series and Due Date in a five-year span, netting Warner Brothers a tidy $1.7 billion in the process, Phillips no longer needs to resort to extremes to make movies. But that doesn't mean he has nothing to prove. Take his upcoming film War Dogs, where he proves that you can remove most of the gags from a buddy movie, mix in a complex political issue and still create a provocative and entertaining film. One we urge you to see in a theater with some of your fellow human beings.", "duration": "1:00:01", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCamera_EP069_Phillips_seg2_1674597.mp3?awCollectionId=905&awEpisodeId=1674597", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 69. Todd Phillips Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1466665260, "title": "68. Luke Wilson", "author": "Luke Wilson", "summary": "Luke Wilson is not an actor who works hard to grab your attention. Maybe his natural screen presence is why he plays \"average guy\" roles so much better than the average guy. But it's his less mainstream work that reveals him to be a truly nuanced actor who absolutely loves what he does. Wilson's Dallas childhood, populated with cultural figures like Jim Lehrer, writer John Graves, Richard Avedon, and his own parents, was certainly far from average. That tight, idyllic Tenenbaum-esque world included brothers Andrew and Owen and close friend Wes Anderson (Woody Harrelson, FYI-your admission request is pending). Herein, Wilson shares Sisyphean tales of making films like Bottle Rocket and Satellite Beach and his transition to playing more dramatic roles. Famously laid back, he admits there are times when winging it doesn't pay off-like when you're in an elevator with Gene Hackman and a falcon. Unlike his filmic cohort Dignan, Wilson never had a grand plan for his career; but when you're making art for the purest possible reasons, you don't really need one.", "duration": "01:00:23", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP068_Wilson_seg2_1657955.mp3?awCollectionId=905&awEpisodeId=1657955", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 68. Luke Wilson Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1466060460, "title": "67. Thomas Middleditch", "author": "Thomas Middleditch", "summary": "We really wanted in, just to see what goes on in there. The quick, pinging pinball machine that is Thomas Middleditch's brain seems a veritable bouncy house of voices, characters and jokes that might spit you out exhausted and a bit queasy, but having thoroughly enjoyed the ride. Long before landing the lead on HBO's Silicon Valley, he paid his dues in improv, sketch and standup, all while writing and making hopeful, hilarious use of the Internet. But Middleditch knows the most effective humor has bass notes of sadness, and his early years reverberated with them.\n\nIn our talk, he opens up about the effects of a rather lonely and picked-upon childhood. If he rebounded with a bit of arrogance, well, sometimes hubris is the only thing that keeps you going in the face of half-empty theaters and failed auditions. Looking back, he says he doesn't regret a moment of his roundabout career path through the cafeterias, dog parks and high seas of comedy. To our followers, we extend an invite to board the Off Camera Fun Cruise with First Mate Tom Middleditch. To Darren Lindsay (wherever you are), we extend a kick in the arse.", "duration": "59:14", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP067_Middleditch_seg2_1657067.mp3?awCollectionId=905&awEpisodeId=1657067", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 67. Thomas Middleditch Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1465455660, "title": "66. Imogen Poots", "author": "Imogen Poots", "summary": "Imogen Poots has the resume of an actor twice her age and the chops to match. When you've worked with Peter Bogdanovich, Terrence Malick, Richard Linklater, and Cary Fukunaga, all by the time you're 27, your bulb would have to be sputtering pretty badly if you didn't learn a thing or two about your craft. Poots is smart, sure, but more importantly, wise. Smart is trying to choose good projects; wise is knowing the outcome isn't guaranteed and thriving on that uncertainty. (A good tip for surviving not only Hollywood, but life in general.) Smart is knowing the size of the bra that wardrobe hands you on day one of a shoot can signal a creative issue; wise is knowing, \"You're here on Earth for a hot second, so you may as well spend your time doing something you  believe in.\" Even though her career has consisted mostly of films, Poots believed in Cameron Crowe's Roadies enough to make an open-ended commitment to a TV series, and she's chosen well. Turns out music-albums, please-is a treasure she hoards and enjoys sparingly, wanting to preserve her sheer enjoyment of its magic. Which is kind of how we felt about this conversation.", "duration": "1:01:20", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP066_Poots_seg2_1655561.mp3?awCollectionId=905&awEpisodeId=1655561", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 66. Imogen Poots Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1464850860, "title": "Off Camera - 65. Kathryn Hahn", "author": "Kathryn Hahn", "summary": "Kathryn Hahn swears she is horrible at selling herself, but these days, Hollywood sure seems to be buying. With film and TV roles multiplying in both quantity and scope, she's proven herself among the most versatile, funny and increasingly acclaimed actors working today. That has to give you some confidence, right? Well, maybe. It's taken Hahn a minute to find and own herself and her talent, and she says she's still figuring it out; but at this point, she's wise enough to know what she values not only in the projects she takes on, but in life. As well she should--given the opportunities she's had to work with and learn from some of the best, including Will Ferrell, Jill Soloway, Jeffrey Tambor, and her six-year-old daughter. In this issue, Hahn describes the smell of too much comedic gas (sweaty), the role childhood plays in art (crucial), and how Catholicism screws up everything (we're officially going to hell now). All, while proving that the best conversations happen with guests who bring two mugs to an interview.", "duration": "56:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP063_Hahn_seg2_1653561.mp3?awCollectionId=905&awEpisodeId=1653561", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 65. Kathryn Hahn Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1464246060, "title": "64. Keegan-Michael Key", "author": "Keegan-Michael Key", "summary": "Keegan-Michael Key doesn't encourage people to make decisions out of fear, but it did work for him-at least for a while. Fear of being left behind and not accepted made him decide that making people laugh could come in handy some day. And fear of uncharted artistic territory resulted in a U-turn towards a career he never could've imagined for himself. Yet this is a guy who somehow found the confidence to turn down his second shot at Saturday Night Live-most sketch comics' very reason for existence. Now, as the lead in Don't Think Twice, he gets to flex new acting muscles, or perhaps better put, give the old ones a rest.   \n\nKeegan's insights about nature versus nurture, code-switching, and decision-making are worth the read alone, but you'll be completely sucked in by his observations on the high-wire act that is improvisational comedy. It's a world we rarely get a good look inside of, and one that becomes more fascinating the more you explore it. To unravel its mysteries, you can go see Don't Think Twice, or read this issue. We hope you'll do both.", "duration": "58:09", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP064_Key_seg2_1652647.mp3?awCollectionId=905&awEpisodeId=1652647", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones 64. Keegan-Michael Key Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1463686320, "title": "Off Camera - 63. Krysten Ritter", "author": "Krysten Ritter", "summary": "Though it's probably not what Shakespeare meant when he had Hamlet pondering \"...the slings and arrows of outrageous fortune,\" it's a phrase that comes to mind in pondering the fortune of Krysten Ritter. For years, she's patiently taken every small, prescribed, and hard-fought step to acting-mall discovery, modeling, commercials, countless 'friend' roles and a couple of cancelled shows-before landing the lead in Marvel's Jessica Jones on Netflix, a role Rolling Stone called \"...the sort of conflicted, damaged anti-heroine who's right in Ritter's sweet spot.\" Ritter didn't mind the journey, believing each step prepared her for the next. But nothing quite prepared her for Jessica Jones. With exponential opportunities, success (and minor injuries) came an outrageous new schedule, responsibility, and fame that she's still learning how to handle without throwing up or fainting dead away. But she'll take every arrow in the quiver if it means continuing to do what she loves. Ritter talks about her tough but formative adolescence, being at the forefront of an unprecedented new TV format, and why you might want to pick up a pack of Post-Its the next time you're at the store.", "duration": "00:57:06", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP063_Ritter_seg2_1651263.mp3?awCollectionId=905&awEpisodeId=1651263", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 63. Krysten Ritter Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1463036460, "title": "Off Camera - 62. The Edge", "author": "", "summary": "At least once, and hopefully many times, each of us has experienced the rush of being completely transported by a musical experience - one concert, one song, or even a single riff. For 15-year-old Dave Evans, Moment One was playing guitar (loudly) for his classmates in a high school auditorium with a band of three friends. One of those friends thought maybe the band could become as big as The Beatles. Evans' reaction? \"Yeah, right.\"  How U2 struggled out of Dublin's small music scene and actually became the world's biggest band is one of the best stories in rock, but even more amazing is how they've managed to stay that way for decades. Equally proud and humble about the journey, The Edge recounts it from the inside, sharing the origins of his iconic guitar sound, the unique songwriting process that both confounds and inspires him, and how the band chased - and then adjusted to - success. And, why success is never a good place to stop.", "duration": "1:00:38", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP062_EDGE_seg2_1650029.mp3?awCollectionId=905&awEpisodeId=1650029", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 62. The Edge Click on this item for more information."]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1462431660, "title": "Off Camera - 61. Glen Hansard", "author": "", "summary": "Despite his promising start as a vendor of illegal fireworks, there was never much question that Glen Hansard's street trade would be anything but busking music-a practice, it's safe to bet, would never be outlawed in his hometown of Dublin, Ireland, where it's also apparently not illegal to leave school at 13 to take it up. He rose to decent acclaim in his rock band The Frames, but it was a no-budget, quickly shot little film called Once that changed the trajectory of his life and fame. At height of that success, he began work on his latest and most deeply felt album, only to be told his songs were essentially no good. If there's one cliché we're happy Hansard perpetuates, it's that the Irish are delightful storytellers. The singer, songwriter, and reluctant actor talks about his complicated family life, the folly of courting the muse, and the risk of tunnel-career-vision. He also divulges how you can sell the same piano four times and improve your songwriting by replacing words like \"heart\" and \"love\" with... something a bit less romantic.", "duration": "1:00:38", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP061_HANSARD_seg2_1648620.mp3?awCollectionId=905&awEpisodeId=1648620", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 61. Glen Hansard Off Camera - 61. Glen Hansard"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1461826860, "title": "Off Camera - 60. Titus Welliver", "author": "", "summary": "To quote noir crime master Raymond Chandler, \"When in doubt, have a man come through the door with a gun in his hand.\" Given that Titus Welliver was once put on a \"Nastiest Villains of All Time\" list, we weren't sure what to expect when the Bosch star stopped by for a visit. Turns out he's a lot less ominous than you might think, not to mention a lovely and intelligent guy. Above all, he's a keen observer of internal and external environments and the people who inhabit them-a trait common to great detectives, and great actors. Luckily he's a bit less stoic than his alter ego, and offered up a fascinating, honest conversation on the lessons of his challenging childhood, how he approached the delicate business of inhabiting a character that already lived in the imagination of thousands of fans, and how picking up a paintbrush after 25 years changed his relationship with his father, a well-known artist. He also offered up some impressions that are hilariously spot on-just ask Christopher Walken. Or maybe, don't.", "duration": "01:00:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/2738736_2016-04-27-185136.64k_1647430.mp3?awCollectionId=905&awEpisodeId=1647430", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 60. Titus Welliver Off Camera - 60. Titus Welliver"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1461308460, "title": "Off Camera - 59. Bob Odenkirk", "author": "", "summary": "It's hard to believe now that Breaking Bad was clinging to life for its first two seasons, but that was just long enough for Bob Odenkirk to be offered a turn as its lawyer-to-the-shady, Saul Goodman.  Odenkirk didn't see fit to memorize his lines before starting;  he just requested that Saul sport a comb-over.  If that seems a flippant approach to a role that wound up changing his career, you can't blame him.  Years of \"getting my ass kicked in Hollywood\" have gifted him with remarkable sangfroid.  He just does what he's always done - work hard and write funny stuff.  Simple, right?  Well, anyone can work hard, but very few can distill all existence into absurdly, exquisitely true moments.  We talk to the co-creator of \"the most influential flop on TV\" (i.e., Mr. Show) about the turn his career has taken, what Bryan Cranston taught him about taking on a series lead, and how not to dress for an audition.  He also reveals his never-ending source of comic fodder:  \"People are fucking ridiculous.\"  Be insulted if you want, but be honest - you're laughing right along with him.", "duration": "01:16:13", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://aw.noxsolutions.com/launchpod/offcamera/mp3/OffCameraEP059_ODENKIRK_Seg2_1644857.mp3?awCollectionId=905&awEpisodeId=1644857", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 59. Bob Odenkirk Off Camera - 59. Bob Odenkirk"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1460602260, "title": "Off Camera - 58. Richard Linklater", "author": "offcamera", "summary": "Off Camera - 58. Richard Linklater by offcamera", "duration": "01:02:24", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/258900216-offcamera-58-richard-linklater.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 58. Richard Linklater Off Camera - 58. Richard Linklater"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1459987680, "title": "Off Camera - 57. Kristen Bell", "author": "offcamera", "summary": "Off Camera - 57. Kristen Bell by offcamera", "duration": "01:01:41", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/257705398-offcamera-57-kristen-bell.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 57. Kristen Bell Off Camera - 57. Kristen Bell"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1459373940, "title": "Off Camera - 56. Don Cheadle", "author": "offcamera", "summary": "Off Camera - 56. Don Cheadle by offcamera", "duration": "01:00:30", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/256339534-offcamera-56-don-cheadle.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 56. Don Cheadle Off Camera - 56. Don Cheadle"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1458783600, "title": "Off Camera - 55. Michelle Monaghan", "author": "offcamera", "summary": "Off Camera - 55. Michelle Monaghan by offcamera", "duration": "00:59:40", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/254737848-offcamera-oc_michelle_monaghan_podcast.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 55. Michelle Monaghan Off Camera - 55. Michelle Monaghan"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1458237000, "title": "Off Camera - 54. Dan Patrick", "author": "offcamera", "summary": "Off Camera - 54. Dan Patrick by offcamera", "duration": "00:57:39", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/252388744-offcamera-off-camera-54-dan-patrick.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 54. Dan Patrick Off Camera - 54. Dan Patrick"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1457578080, "title": "Off Camera - 53. Joanne Froggatt", "author": "offcamera", "summary": "Off Camera - 53. Joanne Froggatt by offcamera", "duration": "00:56:08", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/251114021-offcamera-off-camera-55-joanne-froggatt.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 53. Joanne Froggatt Off Camera - 53. Joanne Froggatt"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1454552580, "title": "Off Camera - 52.5 Sam Jones", "author": "offcamera", "summary": "Off Camera - 52.5 Sam Jones by offcamera", "duration": "01:02:46", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/245344262-offcamera-off-camera-545-sam-jones.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 52.5 Sam Jones Off Camera - 52.5 Sam Jones"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1453956840, "title": "Off Camera - 52. Matt Berninger", "author": "offcamera", "summary": "For someone who admits that \"relaxed\" is not his natural setting, The National frontman Matt Berninger seems pretty okay with himself. What's more, he seems pretty okay with anyone else seeing him for who he is, even when he's perhaps not at his best. But more on that later.\n\nBerninger and the band came late to careers in indie rock, and without the youth or cool that serves as the usual currency of that scene. He was doing well in his nice desk job as an ad agency creative director, but as he told The Telegraph, \"Once I entertained the thought that maybe I wouldn't ever have to go and sit in conference rooms with MasterCard to discuss web ads again, I couldn't shake it.\" As a family man, was he confident he could make a living in his new chosen profession? And what of the fact that his music experience comprised absorbing large amounts of vinyl and live shows versus the more tried-and-true approach of actually playing an instrument or reading music? Neither mattered much, really; he's a guy that enjoys climbing out on the thin branches.\n\nIf Berninger and The National did come to rock late in the game, they came to it not only more confident in who they were as artists, but also more tolerant - and even appreciative - of the failures, though there haven't been many to date. After a lot of rehearsal space toil (there's only so much magic in art, folks), their complex, biting songs gained traction with each new release, from their self-titled breakout to subsequent successes like Boxer, High Violet and Trouble Will Find Me. In 2015, Pitchfork mused about the \"surprisingly long shadow\" the band has come to cast over alt-rock. \"The National have emerged as a big-tent indie mainstay because their widescreen melancholia has proven durable and difficult to emulate.\"\n\nFor a former ad man, there's probably some good irony to be mined in all The National songs that have landed in commercials, TV shows and even political campaigns, even if it hasn't brought them widespread fame or magazine covers. Ascendance has come through their giant base of live-show fans, many of who were looking forward to the band's first documentary in 2014. Instead, they got Mistaken For Strangers, a film The Guardian called \"a nail-biting, cringe-inducing study of self-destruction and fraternal love, a film full of emotional explosions...and how you can find beauty in disaster.\" A few of those emotional explosions are courtesy of Berninger as he deals with his younger brother's attempt to be The National's assistant tour manager while also shooting a film about the band. If, as Berninger says, \"I wasn't trying to hide what an asshole I am,\" he also doesn't mask a very human need to love and understand the people he's closest to.\n\nUnderstanding his unusual approach to finding melodies and lyrics that stick is harder, though we certainly make the attempt in this conversation. He's constantly throwing out one set of musical chemicals in search of another and is more tempted than terrified at the prospect of a flop. Six acclaimed albums and one well-reviewed side project in, he says he's just in middle of figuring out how to be a songwriter. For Berninger, the magic trick seems to be in staying there.", "duration": "00:56:50", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/244174954-offcamera-off-camera-54-matt-berninger.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 52. Matt Berninger Off Camera - 52. Matt Berninger"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1453344540, "title": "Off Camera - 51. Tim Robbins", "author": "offcamera", "summary": "At 6' 5\", Tim Robbins is the tallest actor ever to win an Academy Award, but until they start handing out statuettes for height alone, he'll have to be content with a regular old Oscar and slew of Golden Globes recognizing his talent. Cutting such an imposing figure could've made it easy for Hollywood to serve him up time and again as the loveable, lumbering galoot he played so successfully in his breakout role as Bull Durham's \"Nuke\" LaLoosh. But even a passing glance at his long filmography is a startling reminder that Robbins is an artist whose physicality is completely overshadowed by his versatility. He plays innocent and shrewd, hero and scoundrel, with such careful shadings and intelligence that watching him, we're kept tantalizingly off balance. His boyish, wide-open countenance can conceal a menace that's all the more disturbing because it's felt more than seen. In other words, Robbins is a master manipulator - he's playing us, but gleefully and with the best of intentions. He's the naïve screwball in the Coen brothers' Hudsucker Proxy, and the new neighbor in Arlington Roadwho's so nice and normal that we can never quite put a finger on why something about him just doesn't seem right.\n\nThough inarguably well deserved, the acclaim he's received for his astounding performances in films like The Shawshank Redemption,Mystic River and The Player can make it too easy to overlook some of his most important contributions to his craft, as well as how he's chosen to shape his career. While still in college he founded The Actors' Gang, which changed the landscape and status of L.A. theater and created an incubator for both great plays and talented young actors. His passion for theater also pervaded the chaotically joyous, collaborative spirit of Bob Roberts, a film Robbins wrote, directed and starred in his early 30's. Long before \"mockumentary\" became common film vocabulary, it incisively and uproariously presaged the media's trivialization of politics. Come to think of it, it's mandatory election year viewing. Though he admits his success has put him in a position to pick and choose, Robbins has always been an admirable purist, writing, directing, producing and acting in only the projects that speak to his sense of moral and artistic integrity. He knows his legacy may not matter to the public, but it matters to him.\n\nThat integrity - and his standing as one of our true auteurs - prompted Robert Altman to call him the second coming of Orson Welles. High praise; but like Welles, his standards don't frequently align with those of his industry, making his film projects increasingly rare. Our conversation reminded us of the treasure we have in Robbins, and as much as we hate to bother a 6' 5\" former hockey player, we respectfully demand more.", "duration": "01:00:32", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/242999851-offcamera-off-camera-53-tim-robbins.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 51. Tim Robbins Off Camera - 51. Tim Robbins"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1452745080, "title": "Off Camera - 50. Aubrey Plaza", "author": "offcamera", "summary": "When the notoriously poker-faced Aubrey Plaza says that she's wanted to be an actor since she was 13 and thus isn't surprised it's happening, or that perhaps the universe responded to her acting daydreams, you have to wonder, does she really mean that?\nUnderstandably, Aubrey Plaza used to hate the word \"deadpan,\" as associated as it's become with the detached, almost unreadable delivery she's cultivated as characters like Julie Powers in Scott Pilgrim vs. the World, Darius in Safety Not Guaranteed and perhaps most famously, Parks and Recreation's wryly impassive April Ludgate. Then her Ned Rifle director Hal Hartley cast the term in a different light: maybe it occasionally serves a character to drop lines with a certain lack of personal involvement. Though no one expects much from a zombie in the way of emoting, The Guardian said of Life After Beth, \"...Plaza steals the show with one foot in the grave, her rotting heroine ricocheting between adolescent snarkiness and cadaverous rage...\" When you think about it, it takes a certain amount of equanimity to put a line out there and let it sit without telegraphing what we're supposed to think about it or how we're supposed to react. If that means viewers remain a bit off balance, all the better to hold our attention while we supply our own context.\n\nBut back to those comments. She was (we're pretty sure) quite sincere, though Plaza herself likely had more to do with moving her career along than the universe. Philosophically, she seems to fall somewhere between fatalism and determinism. When her mom introduced her to Saturday Night Live, young Aubrey decided it was her dream job. When she looked up cast member bios and saw standup comedy as the common thread among her idols, she went promptly into improv, and later actually interned at SNL. Shortly after, she started growing the career she's still building today with drolly arresting roles in films like Funny People and About Alex and The To Do List, often playing younger, still-at-that-awkward-stage characters. Perceptive viewers of her arc on the recently-ended Parks and Recreation might have noticed Plaza's very intentional efforts to add layers and different choices to April Ludgate,  without any overreaching departures from the essence of her character. Now able to poke her head up take a look around after six seasons on Parks, Plaza plans to continue her attempt \"...to be considered a well-rounded actor, not a weirdo.\" That starts next year with Dirty Grandpa and Mike and Dave Need Wedding Dates.\n\nGiven her peppy, workmanlike embrace of masturbation (The To Do List), doll parts (Playing It Cool), and, um, quirky guest appearances (any number of talk shows), she's demonstrated she's unafraid to attempt almost anything, including being herself - no small feat in her line of work. If part of the outrageousness allows her to remain a bit of an enigma, we can live with that. What we most want to see is what Plaza does next, because if there's one thing that's obvious, the woman's capable of almost anything.", "duration": "01:03:39", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/241875257-offcamera-off-camera-52-aubrey-plaza.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 50. Aubrey Plaza Off Camera - 50. Aubrey Plaza"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1450321140, "title": "Off Camera - 49. Linda Cardellini", "author": "offcamera", "summary": "Every successful actor will tell you how lucky they are to do what they get to do; it's pretty standard actor PR speak, and in most cases, probably true. Still, it's genuinely refreshing to come across someone who seems to be happier practicing her craft the longer she does it. Linda Cardellini believed her dad when he told her it would be possible to build a rollercoaster in their back yard. Perhaps that's where she got the \"screw-loose optimism\" responsible for making her think she could be an actress in the first place, and what led her to L.A. to audition for roles she thought (or was actually told) she wouldn't get, one being her breakout series Freaks and Geeks. She even managed to find a small moment of pleasure in the rather sudden late-night announcement of its cancellation. And she believes there's benefit to be found in even the most nerve-racking auditions.\n\nIt's a testament to Freaks and Geeks and Cardellini herself that she's still best known (and rightfully lauded) for work on a show that was cancelled after just 18 episodes in 1999, not even beating the 10th season of Cops in the ratings. The show was unusual and ahead of its time in ways too numerous to mention, all of which probably boil down to its just being too good for TV at the time. On the bright side, the current streaming, watch-when-you-want age that enabled its phenomenal post-cancellation embrace gives us hope that such honest, sui generisshows and the people who create them will endure. Recalls Freakswriter Paul Feig, \"Lindsay Weir was the only character not based on someone I knew, but Linda Cardellini was the exact person I had in my head.\" Chalk that up to her innate ability (at 24) to bring an authenticity to a teenage character that completely matched the spirit of the show. \"Life is filled with moments where you have to sit alone with yourself, and the show let us do that in a way that wasn't normal at the time,\" she told Vanity Fair. \"You don't know what to say or do, so you have to sit there in that uncomfortableness.\"\n\nFor a more recent example of her instinct for telling a story through silences and a complete lack of vanity, seek out the extraordinaryReturn, and you'll be way ahead of the deprived people who are bound to stumble across and love it years from now. As her career progresses, she's reflecting the experience and motivations of a widening range of grown-up women with roles in Mad Men, Welcome to Me, 2016's The Founder and yes, even Avengers: Age of Ultron, which prompted theWashington Post to praise the calmness, clarity and wisdom of her performance - in a superhero movie. It's a maturity she seems to find satisfying, and one that will likely ensure a long future as an artist.\n\nAnd the optimism just gets worse from here. As someone whose stated acting ambition is working with as many of her peers as possible to observe their approach, she's landed in a series of jackpots, the latest of which is Bloodline with Sissy Spacek and Sam Shepard. So if you don't like happy stories, stop here. And definitely don't see her in the slightly sweet, slightly off-kilter, full-on funny Daddy's Home this Christmas. But if like Cardellini, you believe the best is still to come, read on.", "duration": "01:03:31", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/237919198-offcamera-off-camera-51-linda-cardellini.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 49. Linda Cardellini Off Camera - 49. Linda Cardellini"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1449721260, "title": "Off Camera - 48. Bill Lawrence", "author": "offcamera", "summary": "Have complete confidence in each decision you make. If you're wrong, have complete confidence in the next one. You could stop reading here and have all the advice you need from one of the most talented, inventive writers and producers in the TV business today. But that would be a mistake, because Bill Lawrence, as you might suspect of one of the most prolific creators of network sitcoms, tells a great story. Many great stories, actually. He was one of the youngest writers ever hired for Friends on its first season, and created Spin City at the ripe old age of 26. He went on to write, create and/or produce Scrubs,Cougar Town and Undateable - the show NBC said wasn't \"a good fit with our brand\" and subsequently went on to renew for three seasons running (that one's a particularly good story).\n\nAs early as high school, Lawrence had visions of being a standup comedian until he figured out other people were better at delivering his material than he was. Though he says he'll always be a comic at heart, he had too many ideas and too much confidence not to take his \"spec script scam\" out to Hollywood, where he quickly progressed from writing shows to running them to producing them, working with some of the best mentors in the business along the way.\n\nBut here's the thing about Bill, who at this point is a pretty successful guy with a nice pool and his own busy production company. Like any true and restless creative, he can't resist a challenge or pushing on walls - in case of Undateable, the fourth wall. When NBC's marketing commitment for the show seemed more likely to doom than promote it, Lawrence launched a grass-roots, whistle-stop bus tour that included throwing himself (a \"below-mediocre comic\") into standup shows with a lineup of some of the best comedians in the business. Cue the flop sweat. After experimenting with a live broadcast ofUndateable, which involves on-the-fly live script changes and re-directing of actors during commercial breaks, he decided to do the whole third season that way, essentially creating a live scripted comedy-variety show hybrid. Ideas that would have most execs downing Costco-size doses of Pepto-Bismol just don't seem to faze him; in fact, in a sort of meta way, he seems to make navigating the business sound like a sitcom itself.\n\nSo tune in as Lawrence discusses what it takes to succeed as a TV writer, the inner workings of pitching, producing and marketing shows in the shifting TV landscape, and two shows he and George Clooney decided would never work: Friends and ER. Like he said, just have confidence in the next decision...", "duration": "01:01:33", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/236889726-offcamera-off-camera-50-bill-lawrence.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 48. Bill Lawrence Off Camera - 48. Bill Lawrence"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1449111840, "title": "Off Camera - 47. Paul Dano", "author": "offcamera", "summary": "In its review of Love & Mercy, Decider.com simultaneously lauded Paul Dano's portrayal of the young Brian Wilson, and bemoaned his under-the-radar status. \"Despite boasting an impressive list of credits, Dano is frequently left out of the cultural and critical conversation, and doesn't receive the recognition he deserves for his powerful performances. He's arguably one of the greatest actors of his generation, but his subtle presence in strong material hasn't been enough to gain him awards season traction or long-term attention.\"\n\nThe article speculated Love & Mercy would change all that, but it raises a question: Does an artist have to be a widely known and/or \"award-winning\" to be appreciated or validated in some way? With the proliferation of social media and \"entertainment news\", it seems we need to know an actor as a person, that he has to exist publicly and consistently in the \"real\" world to exist as an artist. Few who've seen Dano's work in films like L.I.E., Little Miss Sunshine and 12 Years a Slave would question his disconcerting ability to absorb and then stun us with a kaleidoscopic range of characters. But try and describe Paul Dano the person and most of us would search long and hard for adjectives.\n\nAnd that's fine. \"Fame looked horrible to me,\" says Dano. Though he still can't completely articulate why he got into theater at age 10 and is just now starting to figure out what he does want as an actor, instinct has always led him away from what he doesn't: Early on, he got the feeling that films like his 2004 teen rom-com The Girl Next Door would likely define him before he had a chance to do so himself. So his next choice was indie The Ballad of Jack & Rose with Daniel Day-Lewis, \"Because someone there believed I could be nothing like me.\" He's since shone in a string of highly acclaimed performances in some of the most intriguing releases in recent years, including Prisoners, The Extra Man, and There Will Be Blood, of which Texas Monthly said: \"Dano is so electric that the movie sags whenever he's not around.\" But it's the aforementioned Love & Mercy that truly bears witness to his sensitivity as a performer and a vulnerability Dano says came from an almost personal regret about not being able to protect someone who couldn't do it himself. The result was a portrait far more real than any degree of physical mimicry could ever convey.\n\nDano takes the long view of his career, asking of each new role, \"Why would I do this?\" As much as he questions what he can give to each project, he wants to know what he can take from it for the next - and how it's going to be different from the last. Dano's never going to be the guy wearing the lampshade at your next dinner party. He will, however, take on a new and meta persona in the upcoming Youth, playing the kind of actor he never wanted to be, and prompting us to ask, how does an actor prepare to play an actor?\n\nWe loved getting know him at least a bit better, and as far as adjectives go, we've landed on \"necessary.\" Because as long as Paul Dano continues acting, we know there will be films we really want to see.", "duration": "00:57:00", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/235840079-offcamera-off-camera-49-paul-dano.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 47. Paul Dano Off Camera - 47. Paul Dano"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1448428020, "title": "Off Camera - 46. Joseph Gordon-Levitt", "author": "offcamera", "summary": "One of best ways to enter and appreciate the original, prolific brain of Joseph Gordon-Levitt is through the lens of hitRECord, the open, collaborative production company he founded in 2005, and one of the most creative and inspiring uses of the Internet ever. Its nearly 100,000 members submit projects - films, stories, songs, drawings, you name it - for other members to edit, build on and evolve.\n\nGordon-Levitt credits directing short films on hitRECord with teaching him what he needed to know to make Don Jon, his first feature film as a writer, director and star. It was a darkly comic but ultimately hopeful tale about what happens when we become too connected to our devices, consuming people as things and communicating at versus with each other. His effort was rewarded with critical acclaim rare for actors who have the audacity to become auteurs; more importantly, audiences dug it. A lot of artists might find hitting it out of the park on their first time at bat daunting, but it just made him want to do more, and on a more collaborative level.\n\nThat's because Gordon-Levitt has never been fond of one-way streets - not for communication, not for critiques, not for creating, and especially not for careers. He could've ambled down his own pretty easy and lucrative path after early childhood success in commercials, films and most famously, NBC's hit sitcom 3rd Rock from the Sun. Instead, he went to Columbia University, largely out of a desire to reclaim the feeling of \"not knowing what I was going to be\" - an open question for many college freshmen, but few actors who've worked steadily from the age of four. When he found himself roaming the streets of New York with a video camera, he knew a return to acting was inevitable, but he knew it would have to be in unexpected roles - not to make an artistic statement, but to prove to the business (and himself) that he didn't have to be just one thing. When such roles weren't immediately forthcoming, his restless creativity found an outlet in hitRECord. The roles he was seeking eventually surfaced in films like 500 Days of Summer, Brick, Inception and Mysterious Skin; and hitRECord projects began to take on momentum. Good times for someone who \"gets off on the stuff I never anticipated would happen.\"\n\nHe believes we should welcome versus dread the unexpected, that change is the most natural state, that good becomes great when we all participate and, as poignantly demonstrated by his late brother Dan, that \"people can be whatever the hell they want to be.\" All of which posits that the best artists are collaborators, and the best collaborators tend to have a stubborn optimistic streak.\n\nMaybe it's that enthusiasm (and a certain degree of DIY showmanship) that invests his performance as funambulist Philippe Petit in Robert Zemekis' The Walk with such verve and authenticity. That, and his superior make-believe skills - a blank green screen is no match for a fertile imagination. In this issue, we talk to him about that film, the role of technology in modern life, what he's learned from being on both sides of the camera, and his hopes for future of hitRECord. For those still unclear on that concept, tune in to our broadcast episode for Gordon-Levitt's demonstration - and the musical results. Thanks, well,...everyone.", "duration": "01:02:56", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/234612977-offcamera-off-camera-48-joseph-gordon-levitt.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 46. Joseph Gordon-Levitt Off Camera - 46. Joseph Gordon-Levitt"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1447898640, "title": "Off Camera - 45. William H. Macy", "author": "offcamera", "summary": "Ask William H. Macy about any number of the hapless losers, downtrodden everymen and debauched miscreants he's portrayed over the course of his career, and he'll tell you he's played the hero as every one of them. That makes sense if you believe that an actor's job is to find something worth fighting for in every character he assumes. That doesn't mean Macy doesn't judge his alter egos; \"There are a lot of stupid assholes in the world, but they don't think they're stupid assholes.\" They're simply human, and telling their stories truthfully is how he answers our questions as viewers about why they are the way they are.\n\nLet's start with the hapless losers, namely Fargo's Jerry Lundegaard, who he embodied so convincingly we weren't completely sure they weren't the same person. On reading the script, Macy knew he was the guy; problem was, the Coen brothers didn't. So, putting both his career and Ethan Coen's dog on the line, he launched an offensive that more than paid off. Macy didn't have to seriously audition for another role thereafter.\nAfter years of steady work, though, he began to find the movie roles he was offered less than scintillating, and decided it was time to take on series TV. Enter Frank Gallagher, another less-than-upstanding citizen he's made us love. Shameless, which Macy says is like getting paid to return to acting school, has completely renewed his love for his craft. Maybe that's why he's so fun to watch - and possibly why received an Emmy nod for Lead Actor in a Comedy Series even after he spent a season dying of liver failure. So things were going well in TV land. That's when he decided he wanted to direct a feature film.\n\nMacy is nothing if not ambitious, and thought he could do it as well as, if not better, than anyone else; but he calls his first feature effort \"a real sock in the nose.\" No Minnesotan could understate it better. The first day of prep for Rudderless left him feeling completely overwhelmed and under-qualified to take it on. But he needn't have worried, guided as he was by the same principle he'd adhered to for over 30 years in the business: Tell the truth, and cut out everything else. What we're left with is a difficult but authentic story, beautifully scored and acted.\n\nIn this conversation, Macy tells the truth about acting technique, the perks and pitfalls of series TV, the process of putting together a feature-length indie, and what he's learned from his experience on both sides of the camera. We talk about everything, including how to fire George Clooney so he stays fired. Well, almost everything... Sorry, Bill.", "duration": "01:02:32", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/233711600-offcamera-off-camera-47-william-h-macy.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 45. William H. Macy Off Camera - 45. William H. Macy"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1447288080, "title": "Off Camera - 44. Connie Britton", "author": "offcamera", "summary": "Why is it that even if you haven't seen more than a few minutes of Connie Britton on screen, you feel like you somehow already know her. And not only know her, but really like her. Maybe we relate so instantly because we get the feeling she's a lot like us, only maybe just slightly improved. Watching her work in shows like the dearly departed Friday Night Lights, you're sort of inspired to be a better person.\n\nIn Hollywood years, Britton is a bit of a late bloomer, having no family or industry connections, and majoring in Asian studies instead of acting. All of which she came to see as an advantage; it forced her to take a good look at herself and figure out what she had to offer as an artist that was truly unique, versus what everyone else was doing, or was expected to do. Another late-bloomer advantage? Once you know what your particular gifts are, you can fight to stay true to them.\n\nWhen no (that's zero) drama schools accepted her after college, Britton figured she'd better just take those gifts to New York and start auditioning. Based on how that was going, she had nothing better to do than take a part in a small independent. No one, including Britton, had any reason to expect The Brothers McMullen would garner any attention or box office, so she felt they made it for the best and most pure reasons - art, and the experience of creating it. Still, it's nice when (thanks to Ed Burns and his magical backpack) it becomes a box office hit, and your breakout role. So when that led to her first screen test (with Tom Cruise for Jerry Maguire, no pressure), she couldn't be blamed for getting her hopes up - and subsequently completely crushed - when the director passed her over for Renée Zellweger. Britton has said it took her an xx to get past the devastation of that experience, so we invited said director to come back and talk to her about that. Here at Off Camera, we're all about closure, folks.\n\nBut, as strong and buoyant as the hair that now has it's own Twitter account, Britton kept working, kept learning, and increasingly, kept fighting for characters and storylines that rang true. Having learned a lesson about character arcs on Spin City she turned down NBC's dearly departed Friday Night Lights countless times, until series director Peter Berg assured her Tami Taylor would stay \"strong and messed up\" and not on the sidelines. He listened, and everyone scored. Britton says the show's \"independent TV\" approach of allowing great mistakes to happen was empowering, and pushed her to take risks as an actress. A strong believer that \"it's not a risk if there's no way to fail,\" Britton saw promising potential disaster in singing on the hit series Nashville. No disaster ensued, but some great TV sure did.\n\nIn a funny, real and downright uplifting conversation, Connie Britton shares tales from her winding career path, how she discovered what she had to offer as an artist, and how resilience comes from finding a higher purpose in her work. We've wanted to have Connie as our guest for a long time. Now we also want her for our best friend, career counselor, coach, cheerleader and role model for our kids. After all, how busy can she be, right?", "duration": "01:01:35", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/232671855-offcamera-off-camera-46-connie-britton.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 44. Connie Britton Off Camera - 44. Connie Britton"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1446672240, "title": "Off Camera - 43. Carrie Brownstein", "author": "offcamera", "summary": "\"No matter how dreary and gray our homes are, we people of flesh and blood would rather live there than in any other country, be it ever so beautiful. There is no place like home.\" - L. Frank Baum, The Wizard of Oz\nOl' L. Frank had it right, and maybe that's why we all try so hard to find one. And if you never had much of a home to speak of in the first place, you try that much harder. That's where the story of Carrie Brownstein, or at least her new book, Hunger Makes Me A Modern Girl, begins. Brownstein, who's now probably best known for co-creating and starring in the cult hit Portlandia, began her search as a fan of bands, and then by being in one, and ultimately, by breaking it up for the perceived shelter of various and sundry office buildings.\nWith parents who for their own reasons were largely absent, Brownstein was at once free and compelled to immerse herself in the Pacific Northwest music scene of the 90s, and pursued it with the hunger and passion to connect that drives so many artists. What eventually emerged was Sleater-Kinney, a band  as fiery and original as its members. They lived the floor-sleeping, van-touring, equipment-schlepping, basement-practicing existence of most scrappy bands while they built a small but loyal following. Then to the surprise of everyone, none more so than the band itself, Time magazine named Sleater-Kinney the Best Rock Band in America. Another surprise was their first feature article in SPIN, one that drove home what happens when your life is no longer just your own. So Sleater-Kinney was \"famous\", or about as famous as you could be in the modest Northwest indie rock world back then. Though Brownstein had begun to realize the same scene that embraced them as outliers had its own set of rules more restrictive than the mainstream, she nevertheless sabotaged a meeting with a bigger label that came calling. At the time, Brownstein thought she was being loyal to a scene where \"selling out\" was anathema; in hindsight it might just be what happens when three very tough but vary naïve young girls try to navigate a career without management, agents, or even parents to provide guidance and an objective voice of reason. They returned to their small Olympia, WA label, and to hauling their own equipment down broken stairs to a cat-pee scented basement. Misfiring on the verge of mainstream success was a pattern that sadly defined the rest of the band's career. Ambition and talent go a long way, but making a band your substitute family puts a dangerous amount of weight on a creative partnership. It's Band Psych 101's top reason for a breakup, and that's exactly what Brownstein did, in dramatic fashion, before a show in Brussels.\nFor Brownstein, the end of Sleater-Kinney marked the beginning of a 10-year stint of \"day jobs\" that seem unimaginable for a creative soul who spent 15 years touring the world as her own boss. But the schedule and structure of the office buildings where she worked - as a substitute teacher, an animal shelter and an ad agency - seemed like just the solid vessel she needed to hold her. It took another traumatic incident and a lot of reflection to realize the most stable home is the one you build inside yourself. In this episode we talk to the musician, writer and actress about the birth, death, and rebirth of Sleater-Kinney, the disparity between the perception and reality of fame, what she's learned from the process of writing her book, and what might be next for Portlandia. That, and the fine line between drawing too few and too many cats. Brownstein says she wrote 'Hunger' in part to figure out how to make decisions that put you at the center of who you want to be. We think she's home.", "duration": "01:04:02", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/231574763-offcamera-off-camera-45-carrie-brownstein.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 43. Carrie Brownstein Off Camera - 43. Carrie Brownstein"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1446007740, "title": "Off Camera - 42. Jack Black", "author": "offcamera", "summary": "Thanks to movie posters and pull-quote \"reviews\", we've heard \"electric\" used to describe a performance so often that it barely registers as an adjective. But think back for a moment to the first time you saw High Fidelity. Now, think about the first moment Jack Black appeared on screen and jolted that film alive. It's a great movie with a great cast, but let's face it - his very presence flipped the switch. And that movie flipped the switch on Black's film career, though it was a part he came within inches of turning down. But as the Guitar Pick of Fate would have it, he said yes, ending a 10-year struggle as a glorified extra that followed his first film role as a rabid political acolyte in Bob Roberts, where his real-life nerves turned out to be all the prep he needed to turn in another performance you must to go back and see. The good news about that flame-out decade is that he met a certain KG, and you know what rose from those ashes.\nBut let's flash-Black for a moment to our guest as a teenager who began auditioning for commercials because he so desperately wanted his friends to see him on TV, and even more desperately the acceptance and attention he figured would follow. A stint in Tim Robbins' The Actors Gang followed, as did high school plays and musicals; and though he lost the girl (and wrote the requisite power ballad) he quite literally found his voice. Through music, The D, the hilarious Mr. Show and eventually film, he got the totally merited attention he wanted, if not the confidence he probably thought would come with it: \"Man, I spend my life just trying to relax.\" But he achieved at least some degree of artistic peace in figuring out that his way in to any role - or any song, for that matter - was with a chaser of comedy. If that covers up some vulnerability, well, as he puts it, \"You can't hurt the clown.\"\n\nSo back to the present, where under all the over-the-top antics and outrageousness it's not hard to scent the sensitivity and empathy that no amount of good-humored depravity can disguise. It takes one very human clown to connect us immediately with otherwise improbable characters and films (for more must-see proof, we offer School of Rock and the truly excellent Bernie). As an artist Black says he doesn't seek out challenges as much as he does resonance.\nIn this high-minded and philosophical discussion, we will hit you with lessons on artistic angst and toehold moments, as well as true tales of Cannes-crashing, the fearsome warlock powers of Stephen Frears, and a fever-dream nightmare of an Elliott Smith tribute gone horribly wrong...then right. That, and a scholarly debate on the merits of Gene Krupa vs. Buddy Rich vs. Peter Criss - Sam and Jack hologram it out.\nBy now, Jack Black knows who he is, and what he's here for. So watch his work for the subtle or the shenanigans, but watch you will, because it's impossible not to. He's proof you can't underestimate the power of a raised eyebrow, wait-for-it timing or an unexpected turn of phrase. In that regard, he ranks up there with Jack Benny and other masters of comedy who simply knew how to deliver a line. Ladies and gents, we give you the Bard of Off Camera.", "duration": "00:59:38", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/230426712-offcamera-off-camera-44-jack-black.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 42. Jack Black Off Camera - 42. Jack Black"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1445404680, "title": "Off Camera - 41. Olivia Wilde", "author": "offcamera", "summary": "If you could see Olivia Wilde's toes right now, they'd be wiggling. Since you can't, you'll have to take her metaphor for it - she's hit an artistic stride that feels as satisfying and freeing as \"taking off an uncomfortable pair of shoes.\" It shows. In Meadowland, she's riveting as a mother whose reaction to a tragically random event first seems shocking, then increasingly real. In other words, more human than Hollywood. It's a role she was told she likely wouldn't get, and one she knew she'd do anything to play, including working with a first-time director, locking her fiance in his room for three hours and eventually, signing on to produce. How do you know \"Goddamn, I have to play this role?\" When you recognize a version of yourself in the character, even if it's one you may not want to see. It's a performance that makes any of us question how we'd behave once the worst has already happened. Meadowland also appealed to Wilde in its refusal to offer closure, which also sounded suspiciously like real life. And should neatly answering all our questions be the function of film, or any art? Not for Wilde, anyway. \"If it's not messy, I'm not interested.\"\n\nWilde has been acting for over a decade, but says her career truly started when she learned to commit to a choice without knowing what its outcome would be, a lesson she credits to the under-appreciated Drinking Buddies, a movie in which she plays another messy character, and one that comes closest who she really is. She didn't have much choice about trusting the outcome, since almost the entire script was improv and all the information she had about the movie before flying out to film it was scribbled on a napkin. (Another lesson about absorbing beer and information simultaneously followed, but you'll have to read on for that one.) Drinking Buddies was an artistic stretch, but a big confidence builder - confidence she's now channeling into writing: \"Fear was going to stop me until I just made the decision to do it.\" It also underscores one of her favorite quotes from Steinbeck's East of Eden: \"And now that you don't have to be perfect, you can be good.\"\n\nNot to mention a lot more interesting and authentic. Early in her career, Wilde made the smart decision to work at a casting agency to learn the business in \"the belly of the beast.\" When an agent advised her to drop her theater-training enunciation and \"just be a human,\" she realized that most actors \"spend their careers unlearning how to act and just be a person.\" That kind of authenticity is informing the more complex characters she's choosing to take on these days. And as an audience, we relate and respond. So why don't we see more complicated, real women on screen? Wilde figures it's because Hollywood is pretty invested in the shiny, young and new, the food of fantasy. Certainly there's a place for escapism in film or any art, but if we don't truly connect, how much does it enrich us in the long run? Wilde shares stories from the jobs that shaped her career, reveals her fondness for brown corduroy and explains why Coming to America is a feminist movie.", "duration": "01:00:39", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/229369827-offcamera-off-camera-43-olivia-wilde.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 41. Olivia Wilde Off Camera - 41. Olivia Wilde"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1444892100, "title": "Off Camera - 40. Tatiana Maslany", "author": "offcamera", "summary": "Remember the unquestioned belief and magic of playing pretend as a kid? You were a dinosaur, no, a spy - no, wait, Queen of the Mermaids. You lost yourself for hours, aided and abetted, if you were lucky, by a few props and indulgent adults who agreed you were the Maharaja and became your willing subjects. Then you grow up, abandon make believe and yourself become the indulgent adult, which is a little sad, when you think about it. At the very least, it makes you ponder the \"natural\" progression of things. As someone who never wanted to let those fantasies go, Tatiana Maslany has won the lottery with Orphan Black, and the prize looks like the biggest costume box of make believe ever.\nThough Maslany - like so many \"overnight 'successes - came to wide attention for her role (make that roles) as about a dozen different clones in the cult favorite Canadian series, she's been acting since the age of nine; earlier if you count the living room theatricals she staged for her parents as a youngster. That didn't give her much opportunity to have the typical high school student experience and social structure that comes with it, but for a kid with acting ambitions and a hyperactive imagination, a school improv team proved the only peer group she needed. To this day, it inspires and fuels some fairly uncontrollable urges to go off script, usually to the benefit of her work.\nAfter a year or so of college, she focused fully on work. Acting jobs, acting coaches and Emmy nominations followed, as did the certainty she'd eventually set off a Fraud Alert; inevitably, someone would discover her for the acting fake that she was and hire someone more qualified for the job. It's comforting to know that feeling can plague even the most successful and talented among us, but it's also a cautionary tale about judgment. The danger of regulating creative impulses based on what you think is right or wrong, or worse, what you think someone else will judge as right or wrong, is that you stop risking. That said, Maslany knows that as a society, we're hard-wired to judge; heck, even awards shows that recognize artistic achievement are complicit by nature, designating \"best\" and by default, not-so-worthy. So what to do? Allow yourself to \"put it out there\" before you judge. \"Good\" or \"bad\", at least the idea, the impulse, had a chance to be born. Maslany still works at this, and looks to a favorite quote from Martha Graham as a reminder: \"There is only one of you in all of time, this expression is unique. And if you block it, it will never exist through any other medium and it will be lost. The world will not have it. It is not your business to determine how good it is nor how valuable nor how it compares with other expressions. It is your business to keep it yours...\" Or in Maslany's slightly more earthy paraphrase, \"vomit first, and try to make something pretty with it.\" In this issue, she talks about what she learned in the transition from improv to scripted roles, what it's like to play the multitudes of Orphan Black, why monsters scare her more than robbers and why she once faked sleeping for 17 hours. So go ahead and judge Tatiana Maslany; we did, and found her as fascinating, funny and relatable as they come.", "duration": "01:01:26", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/228481178-offcamera-off-camera-42-tatiana-maslany.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 40. Tatiana Maslany Off Camera - 40. Tatiana Maslany"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1444176060, "title": "Off Camera - 39. Ellen Page", "author": "offcamera", "summary": "In the years since Ellen Page came to wide attention at 20 for her \"overnight\" success in Juno, a lot has changed in the world, but maybe not enough when it comes to how our increasingly diverse culture is reflected by Hollywood. A lot has certainly changed for Page, who very publicly came out as gay in February 2014 and hopes to see a more realistic and holistic on-screen portrayal of all the groups that comprise our society - including LGBT and other minority communities. No one can accuse her of not doing her part to move that along; she's currently starring in and co-producing a string of films with gay characters at their center, including the excellent Freeheld.\n\nStill closeted when she began work on Freeheld, Page says she didn't feel compelled to come out by the project's impending release. The mandate came from a more personal tipping point; she simply could no longer handle living in a way that wasn't true to her. Though the decision wasn't an easy one, the personal and artistic benefits were more than worth it. Page is not only happier than she's been in years, but also doing her best work in years, Freeheld being a case in point. While it largely avoids hitting the audience over the head with moral messages, it does deliver a blow to the heart, showing the us sad compromise required of a closeted relationship, and reminding us that as humans, the things we cherish the most unite us the most.\n\nIn this episode, Page talks about the benefits of missing her \"sitcom years\" while enjoying a pre-fame career in Halifax with all of the ambition but none of the delusions that can derail a young actor in Hollywood. She did leave home at 15 to act and study, but did not \"get up to shenanigans.\" Maybe that's just not done in Canada. We discuss her concerns about playing a real-life character for the first time, her conflicted feelings about being closeted and depressed while at the same time enjoying the privileges of being a successful actress, and the best film experience she's ever had - though we're still not clear if asking Julianne Moore for her phone number in a parking lot beats 10-hour days shooting a motion-capture French video game.", "duration": "01:05:50", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/227249532-offcamera-off-camera-41-ellen-page.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 39. Ellen Page Off Camera - 39. Ellen Page"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1443641280, "title": "Off Camera - 38. Cindy Crawford", "author": "offcamera", "summary": "In one sense of the word, Becoming seems a woefully inadequate title for a coffee table book full of images of Cindy Crawford, one of the most beautiful women in the world. But in its more Aristotelian definition - \"any change involving realization of potentialities\" - it's more than apt. If you're already rolling your eyes at an introduction that attempts to link models and philosophers, consider this: Crawford was a straight-A student who won a full ride to Northwestern to study chemical engineering (the instructor thought she was in the wrong class, though we're guessing he wasn't unhappy to be mistaken). To mark her 50th (!) birthday, the woman who virtually defined \"supermodel\" wanted to connect iconic images from her career with the lessons behind them; ones she believes are universal. And Cindy Crawford is someone who never stops learning.\nSome of those lessons were tough, like what the death of a three-year-old sibling can do to a family. Others were easier, like standing around in a bra for 30 minutes beats picking corn for minimum wage all day, anytime. And still others you learn only by having absolutely no blueprint beyond the one you draw for yourself: What to do when at age 17 you're making five times more money than your parents, who have no advice to give you about what to do with it? Should you stay in Illinois (and school) or go to New York to be a model when you have absolutely no idea if you'll succeed - when, in fact, the most important photographer in Chicago tells you that you won't? How do you handle yourself when suddenly you're part of a moment that changed the way the world sees you and your industry forever? Is posing forPlayboy a powerful statement of femininity or a career-ending decision? And finally, how do you become, to use a famous Vanity Fairheadline, \"Cindy, Inc.\"?\nA life like hers presumably belongs to someone with big ambitions and self-confidence to match, but Crawford tells Off Camera she never dreamed big enough for herself. The wisdom in Becoming belongs to someone who's earned it through experience, observation, hard work and humility. For anyone forging a path in or outside of fashion, this is textbook stuff. With way better pictures.", "duration": "01:03:13", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/226312686-offcamera-off-camera-40-cindy-crawford.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 38. Cindy Crawford Off Camera - 38. Cindy Crawford"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1443080520, "title": "Off Camera - 37. Jake Gyllenhaal", "author": "offcamera", "summary": "Jake Gyllenhaal has become somewhat synonymous with beyond-brutal physical transformations for movies like Nightcrawler, and more recently (and even more brutally), for the role of boxer Billy Hope. But after crying three times over a first-draft script for Southpaw, he knew it was worth taking some punches for. He's no masochist, but calls any work needed to tell the story of characters that fascinate him a joy. Gyllenhaal is the kind of actor who knows not only that his character bears a certain scar or walks a certain way, but why. He's become known for going deep, and seems embarrassed and proud in equal parts about how seriously he takes his work; the same guy who'll spend five months in a boxing ring or memorize an entire script just to sound as robotic as Louis Bloom will also tell you the best analogy for acting is Super Mario Brothers. Level One, to be specific.\n\nThough much has been made of his on screen metamorphoses, his most profound change in recent years is one we didn't realize we were seeing. After coming to wide attention and critical acclaim in films like Donnie Darko and Brokeback Mountain, he found himself in the enviable position of being very young and very successful in Hollywood. That's when everyone in the business will tell you exactly which projects and path will guarantee you a lucrative career. And that's when Gyllenhaal stepped back and decided it was time to listen to his own voice about what he wanted to do and what his work would say about him. The results are sometimes perplexing (Enemy), or darkly comic (Nightcrawler), but always worth watching. And for Gyllenhaal, richly rewarding - the spoils being the experience, worldview and friendships he takes with him from every role.\n\nFrom Southpaw, he learned that a mere five pounds of pressure is all it takes to knock a guy's brain against the side of his skull and put him down, if you know just where to land it. It's the kind of instinct that told him just how to play one of the most touching and terrifying scenes in that film, and the same instinct that now guides the career he's designing for himself. In this episode, Gyllenhaal discusses his work ethic, how he chooses and prepares for roles, and why he'd like to see someone else take a shot at playing them - really. It's an esoteric conversation, but don't worry; you'll love it even if you're not into Talking Heads, Bruce Springsteen or Wild Geese.", "duration": "01:04:18", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/225334724-offcamera-off-camera-39-jake-gyllenhaal.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 37. Jake Gyllenhaal Off Camera - 37. Jake Gyllenhaal"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1442811720, "title": "Off Camera - 36.5 The Call-In Show", "author": "offcamera", "summary": "On this episode of OFF Camera with Sam Jones the guest is YOU! It's the first ever Off Camera Call In Podcast in the spirit of old timey radio and it stars listeners, viewers, and fans of Off Camera. So pull up a chair and listen in!", "duration": "01:02:48", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/224834965-offcamera-off-camera-39-the-call-in-show.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 36.5 The Call-In Show Off Camera - 36.5 The Call-In Show"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1441606860, "title": "Off Camera - 36. Dax Shepard", "author": "offcamera", "summary": "Actor, writer, director, thrill seeker, and comedian Dax Shepard joins Sam to talk about risk, both the real life kind on a motorcycle and the kinds he took to become the actor, father, and husband he is today. He also shares the gift of perspective and gratitude that he's learned from his \"current wife\" Kristen Bell (his words folks). Pull up a chair and listen into this honest and revealing conversation.", "duration": "01:20:53", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/222709995-offcamera-off-camera-38-dax-shepard.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 36. Dax Shepard Off Camera - 36. Dax Shepard"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1440366240, "title": "Off Camera - 35. Kevin Bacon", "author": "offcamera", "summary": "As someone whose been famous for the majority of his life, Kevin has learned a lot from navigating the ups and downs of a career in the public eye which also made for some interesting conversation. He's one of the rare artists that bridges the gap between the modern actor and the era of the classic movie star. In this episode, Kevin joins Sam to  talk about his early days in a family that valued creativity above else, he shares the unexpected joys of doing a network TV show, and admits to some really awkward guitar moments. Sam has admired Kevin's work for a long time and his chat with him was truly worth the wait. So pull up a chair and listen in.", "duration": "01:15:35", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/220569563-offcamera-off-camera-37-kevin-bacon.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 35. Kevin Bacon Off Camera - 35. Kevin Bacon"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1439186160, "title": "Off Camera - 34. Rashida Jones", "author": "offcamera", "summary": "Rashida is someone who has always made her own luck in her career. She figured out early on that creating her own projects puts her in the driver's seat and as a result she has become a multi-hyphenate creator with a unique voice whose made people take notice. She gets personally involved in socially conscious projects that she believes in and isn't scared to aim high which is probably why she has been handed the keys to one of Pixar's beloved movie franchises, Toy Story. She wrote a great film called Celeste and Jesse Forever and had the confidence to not only attach herself as the lead but to refuse to let the studio make the film without her. That takes balls. In this episode, Rashida discusses her relationship with her iconic parents Quincy Jones and Peggy Lipton, her uncertain transition from academia to acting, what she learned from her time on The Office and Parks and Recreation, and her Steve Carrell produced comedy Angie Tribeca. She also shares her eye opening and sometimes painful experiences producing Hot Girls Wanted, a documentary about the amateur porn film industry. You might want to take your kids out of the room for that one folks.", "duration": "01:09:14", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/218559113-offcamera-off-camera-36-rashida-jones.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 34. Rashida Jones Off Camera - 34. Rashida Jones"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1437976920, "title": "Off Camera - 33. Chris Moore", "author": "offcamera", "summary": "You know few jobs demand more skilled straddling of the line between the creative and business sides of an industry than a film producer. And there's perhaps no one better suited. \"Born to\" is not a stretch for that unique role than independent producer and independent thinker Chris Moore. After 3 years as a very successful agent, his creative side no longer allowed him to sell scripts he loved. Never to see them until they emerged on screen as almost unrecognizable versions of their former selves. Hooray for Hollywood. He didn't do badly out of the gate as a producer. Betting bigger than any studio on two unknown screenwriters Matt and Ben who insisted on starring on their own movie. Then he went on to produce films like The Adjustment Bureau and Promised Land and TV shows like Project Greenlight with said unknown writers. Relentlessly curious and original, he's made somewhat of a career of on-air experiments and taken some heat for them too. The Chair, his latest on-air what if is a fascinating look at what happens to the same story in the hands of two different directors. These are interesting times in filmed entertainment and Moore has seen a sea change in the making, funding, and promoting of it over his career. The embarrassment of riches occasioned by the explosion of film, TV, video choices and the way we watch them has scattered audiences to the point where return on investment is impossible and risk taking is at a minimum. Moore might lament the fickle economics of choice if he wasn't too busy on working how to reinvent and adapt to them. For starters he thinks filmmakers need to open up their process, focus less on marketing their products, and more on marketing themselves. Well, interesting times call for interesting minds. Call him opinionated, self promoting, or a control freak and also call him if you got a good story because if you do he's a guy who you want in your corner. He says he got into the business to tell stories about people he would want to hang out with. We loved hanging out with Chris Moore. So pull up chair and listen in.", "duration": "01:02:40", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/216515571-offcamera-off-camera-35-chris-moore.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 33. Chris Moore Off Camera - 33. Chris Moore"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1436768220, "title": "Off Camera - 32. Lizzy Caplan", "author": "offcamera", "summary": "You know it's funny and sometimes not so funny how an actor's earliest role can influence the rest of their career. Lizzy Caplan's first acting job was convincing everyone around her that she was just fine when her mother passed away. Caplan was 13 at the time and the tough hold it in and laugh it off persona she cultivated as a result landed her a seemingly endless string of flirty funny side kick roles. Caplan was surprised and disappointed when the toughness she brought to her characters didn't result in bigger parts. She stuck it out and resigned herself to a career of cool comedies that no one would see. A fate she didn't mind except for the fact that she knew she could do more. The folks at Showtime finally realized that too and cast her as Virginia Johnson on its break out drama Masters of Sex. Caplan joins Off Camera to discuss the influence of her early childhood on her acting, feminism on and off the screen, and the value of terrifying yourself on a daily basis. And nudity. We discuss nudity. So pull up a chair and listen in.", "duration": "01:23:35", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/214480662-offcamera-off-camera-34-lizzy-caplan.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 32. Lizzy Caplan Off Camera - 32. Lizzy Caplan"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1435542180, "title": "Off Camera - 31. Zach Braff", "author": "offcamera", "summary": "In one review of Zach Braff's \"Wish I Was Here,\" Sheila O'Malley quoted a T.S. Eliot poem \"And indeed there will be time to wonder. Do I dare? and Do I dare?\" Well folks, Braff dared. He dared to bring a small passion project to life via crowd-funding. He dared to veer from the standard studio sanction story arc to see the film he wanted to see. He dared to write, direct, and act in it though he lives in a town that prefers ponies of the one trick variety. He dared to share emotional and personal stories through his work only to have his means and material eviscerated. Maybe it's no surprise that one of his favorite lines in the movie, delivered by Kate Hudson is \"At least i'm trying.\" Well he never assumed to bring a small passion project to the screen would be easy, he also never assumed his quest to do so via Kickstarter would spark wide spread vitriolic backlash. \n\nWith hard earned hindsight and rare honesty, Braff discusses the experience of shaping very personal stories through his art. Maybe it was bound to happen to a hyper sensitive theatre geek who's vulnerability served him well for 9 seasons on Scrubs but less so as an indie filmmaker. But the audiences and critics who jumped on the poop slinging bandwagon overlooked what wish i was here did offer: a subtle humorous look at family dynamics, modern masculinity, and what we owe our kids vs. what we owe ourselves. This episode sparked an engrossing conversation about Braff's early introduction into theatre, the horrible auditions that saved his career, and the parallels between his life and his films. He doesn't mind taking a punch or two on screen but says the virtual one he took from the internet will shift his future work away from personal heartfelt projects. This makes us sad but also skeptical, Braff is a filmmaker not just by choice but by unalterable DNA. We're betting and certainly hoping he can't keep his unique voice quiet for long. So pull up a chair and listen in.", "duration": "01:25:29", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/212423114-offcamera-off-camera-33-zach-braff.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 31. Zach Braff Off Camera - 31. Zach Braff"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1434345900, "title": "Off Camera - 30. Jennifer Beals", "author": "offcamera", "summary": "How does a 17 year-old with one credit as an extra end up in the audition room for the lead of one of the most seminal movies of its decade? And perhaps more importantly, how does an introspective not highly social student deal with the surreal experience of having her privacy go away overnight? For Jennifer Beals, feeling like a equal opportunity outsider due to her mixed race and the one-two punch of losing her dad and discovering her family was shockingly poor at age 9 may have provided the best if uninvited coping mechanisms. As humble as she is beautiful, the actress who said she would never make it on So You Think You Can Dance? shares the blow by blow  experience of her Flashdance audition, which was the breakthrough role she came very close to turning down. She also talks about dealing with the boys club that was Hollywood filmmaking in the 80s and returning to school at Yale immediately afterward. Given that she has continued to take on roles portraying strong independent women and often using them to integrate acting with activism, it's surprising to learn that she's often happiest retreating back to the rich solitary realm of her imagination. But when she tastes a role she wants watch out, she's ready to come out swinging. Talking to Jennifer Beals is inspiring in so many ways but perhaps most so because after decades of work in what could be a challenging business and tough for women in particular, she still feels joy at the the thrill of jumping in. So pick up a chair and listen in.", "duration": "01:09:04", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/210380445-offcamera-off-camera-32-jennifer-beals.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 30. Jennifer Beals Off Camera - 30. Jennifer Beals"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1433130660, "title": "Off Camera - 29. Lake Bell", "author": "offcamera", "summary": "Lake Bell wasn't discouraged when her first punchline didn't get a laugh. Granted she was two years old and most toddlers aren't easily discouraged but subsequent events indicate it may have had more to do with her steadfast belief in her destiny as a comedic writer and actress and most admirably her willingness to do the work to get there. \n\nThough Hollywood called soon after college, she went to England first to train professionally at the Royal Academy of Dramatic Art. Once in LA, she landed a couple of TV shows and could have easily traded on her looks for more but she wanted to write. So she befriended a writer, learned the trade, and wrote a script. Only to have it fall apart shortly before being produced. \n\nUndaunted, she went on to write In a World, offered the chance to direct and star in it, she first wrote and directed a new short film just to get the experience she felt she needed. It paid off. In a world mined her own comedic vulnerability and fraught relationships to commercial and critical success.\n\nIn this episode Lake discusses the family dynamics that spurred her creativity, her love and pathological need for storytelling, the experience of simultaneously starring in and directing in her first feature, and the best writing advice she received along the way.", "duration": "01:16:03", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/208208980-offcamera-off-camera-31-lake-bell.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 29. Lake Bell Off Camera - 29. Lake Bell"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1431931980, "title": "Off Camera - 28. Jon Hamm", "author": "offcamera", "summary": "Could you see Jon Hamm on Dawson's Creek? Neither could he nor anyone else in the youth obsessed Hollywood of the 80s when he drove to LA with $150 in his pocket and no real master plan to make it as an actor. And no, he didn't get the Dawson's Creek part. Moving to Los Angeles was a big risk at a time when no one was looking for mature, square jawed, slightly world weary men. Enter Don Draper and a certain amount of irony. His status as a Hollywood unknown landed him the role of a lifetime as the suit and hat clad personification of an era rapidly losing relevance on a network undergoing seismic shifts itself. Eight seasons, a Golden Globe, and multiple Emmy nominations later, exit Don Draper. And the question becomes: Once your famous for defining a character, how do you avoid being defined by him for the rest of your career? Struggling for years before officially making it on Mad Men and subsequently spending each hiatus wondering if the show would be coming back for another season. Jon Hamm has developed a Draper worthy take on that question. Over the course of his career, he has seen a lot, learned even more, and has a passionate but clear eyed grip on the industry to show for it. This is a man who understands the value of his own hard work and the importance of surrounding himself with people as smart and curious as himself. I think he will be just fine. So pull up a chair and listen in.", "duration": "01:02:14", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/205999918-offcamera-off-camera-30-jon-hamm.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 28. Jon Hamm Off Camera - 28. Jon Hamm"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1430624880, "title": "Off Camera - 27. Ethan Hawke", "author": "offcamera", "summary": "Success came to Ethan Hawke when he was young. He landed the Explorers, a major motion picture at age 13 off his first audition no less. His second film at 18, under Robin Williams' tutelage on and off screen was the now classic Dead Poets Society. He's been  an established star ever since. At age 24, in the midst of his early film successes he published The Hottest State. Hawke admits that adding novelist to his resume made him an easy target for ridicule. The word pretentious has been thrown at him many times, often by foes, a few times by friends, and even by himself. His response: It beats not trying. He did keep trying and with his true renaissance man's every career milestone over 20 plus years, the neigh saying is drowned out by the praise. His roles in Reality Bites, Training Day, The Before Sunrise trilogy, and most recently Boyhood have entrenched him in the top tier of the film industry with four Oscar nominations. He has the faith of stage producers and directors as well. He's done Shakespeare, Chekhov, and three plays with Tom Stoppard. His second novel Ash Wednesday was a best seller. In his latest film he has moved behind the camera to show the world someone who has played the game of life even more skillfully than he, an 87-year-old piano player named Seymour Bernstein who embodies an ethos that Hawke has embraced. In the grand scheme, it's not about growing up, it's not about growing old, it's simply about growing. So pull up a chair and listen in.", "duration": "01:29:51", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/203669264-offcamera-off-camera-29-ethan-hawke.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 27. Ethan Hawke Off Camera - 27. Ethan Hawke"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1429488720, "title": "Off Camera - 26. Will Ferrell", "author": "offcamera", "summary": "Just mention Will Ferrell's name or glance at a picture at him and chances are you are already smiling. But the really funny thing is that it's not necessarily because his best known characters are so gosh darn lovable, you see Ferrell never bought the conventional movie truism that comedic leads have to be likable and he went on to prove it perhaps most pointedly with the iconic Ron Burgundy. In fact, he doesn't even think comedy has to particularly funny to be hysterical. While working a number of regular jobs like valet and bank teller, Ferrell did stand-up in small comedy clubs. Clinging to his father's surprisingly helpful advice that his ever making it would be a long shot, it was just that take it or leave it approach that allowed him to pursue his unique comedic style free from the angst that might have otherwise crushed it. It might also explain a small sadistic streak that underlies his performances. If you don't like what he's doing, sit back and enjoy it anyway, or else. In Sam's chat with Will, he describes his stomach churning, knee buckling Saturday Night Live audition and the even more daunting experience of joining the legendary show at one of it's lowest points. He also shares his writing process, stories behind some of his best loved impersonations, and his long and sometimes perplexing film resume.", "duration": "01:18:25", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/201611519-offcamera-off-camera-28-will-ferrell.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 26. Will Ferrell Off Camera - 26. Will Ferrell"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1427072340, "title": "Off Camera - 25. Jessica Chastain", "author": "offcamera", "summary": "What does it take to feel confident that you've made it in Hollywood? \"Coming from nowhere with no connections\" and going almost overnight to A-list status with leads in a string of the most highly acclaimed films in recent history would do the trick. So would a modest but steely belief that acting is what you're meant to do, and always will do. Jessica Chastain wasn't always certain of her path, but she never questioned her destination. That helps when you find yourself going to audition after audition with zero film work to show casting directors. Though daunting, it allowed her the rare opportunity to enter wide public and industry consciousness with a series of performances as revelatory as they were different in Jolene, Tree of Life,The Help and Zero Dark Thirty.\nWhile deeply appreciative of the experiences those films earned her to work with some of the most innovative and talented directors and cinematographers in the business, Chastain says she still feels the need to eventually take her roles away from the writers and directors with whom she collaborates. Call it an overdeveloped sense of ownership; but it's the kind of ownership that creates characters whose inner life is so transparent that we're along for the ride from first frame.\nBut perhaps the most admirable and inspiring aspect of her position in Hollywood is how she's using it to advocate for a much-needed increase in female presence, perspective and opportunities in the industry she loves. She knows bringing Off Camera votes Jessica Chastain for Best Actress...and maybe for President.", "duration": "01:04:41", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/197206168-offcamera-off-camera-27-jessica-chastain.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 25. Jessica Chastain Off Camera - 25. Jessica Chastain"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1425760920, "title": "Off Camera - 24. Chris Pine", "author": "offcamera", "summary": "If some actors enjoy the privileges of descending from families of acting royalty, Chris Pine reaped the lessons of the blue-collar version - his dad, mom and grandma were hardworking actors, if not red carpet regulars. And Pine wanted none of it. Fighter pilot, maybe; baseball player, sure; acting, not so much. But when the family trade eventually caught up with him, it caught up fast. What else are you going to do with an English major anyway, right? After some early theater work and less than a year of the requisite waiter gig, he started landing jobs and soon faced a career-defining choice: Play a homosexual, homicidal detective in James Ellroy's White Jazz, or go be Captain Kirk in Star Trek? The decision wasn't easy, but perhaps it was inevitable. Kenneth Branagh, who directed him in Jack Ryan: Shadow Recruit, once compared him to Paul Newman, calling him \"...the character actor in the leading man's body.\" But many projects in - from popcorn fair like The Princess Diaries 2, Smokin' Aces and Jack Ryan: Shadow Recruit to critically acclaimed turns in Bottle Shockand plays like Neil LaBute's Fat Pig, Farragut North and The Lieutenant of Inishmore - Pine still claims to have no idea what he's doing...except having a good time.", "duration": "01:01:05", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/194740561-offcamera-off-camera-26-chris-pine.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 24. Chris Pine Off Camera - 24. Chris Pine"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1424506680, "title": "Off Camera - 23. Jason Sudeikis", "author": "offcamera", "summary": "As a high school sophomore, Jason Sudeikis switched schools in pursuit of serious basketball dreams and, of course, a girl. Instead, he discovered classes in radio and TV and debate - and a new career option. Soon after swapping Final Four tickets for a video camera, he gave up on college hoops and eventually college itself to go pro in the improv leagues. He honed his chops at ComedySportz, the Annoyance and ImprovOlympic before getting drafted by Second City and eventually Saturday Night Live, where some of his most memorable work occurred behind the scenes writing skits for Justin Timberlake, Amy Poehler and buddy Will Forte. Along the way he happily stole (a term he prefers to \"borrow\") from lifelong mentors to develop his own comedic DNA (watch him in the We're The Millers and guess who he's channeling). In this issue, Sudeikis discusses his improv roots, his development as an actor and writer, his early love-hate relationship with SNL, the art of guest host management, and of course, hoops. To this day he's a flashy, joke-cracking point guard who never lets you see how hard he's working.", "duration": "01:01:18", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/192237677-offcamera-oc-jason-sudeikis.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 23. Jason Sudeikis Off Camera - 23. Jason Sudeikis"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1423357920, "title": "Off Camera - 22. Jon Brion", "author": "offcamera", "summary": "A long time ago, Jon Brion asked some fellow musicians, \"What if there was a performer that made up every song on the spot?\" Consensus was, the songs would suck. \"But what if they didn't?\" persisted Brion. The short answer is his legendary live show at L.A.'s Largo, the key components of which are mind-blowing musical genius, an audience-generated set list and surprise sit-ins by a list of musical luminaries. It's almost as fun to watch the audience sitting in slack-jawed delight to see and hear what happens next. It's a truly rare experience that tends to turn people into \"you just have to see it\" evangelists. As word got out, Brion found himself in increasing demand as a producer for artists like Fiona Apple, Kanye West and Elliott Smith. A more unexpected line of work emerged creating quirky, curious film scores for directors like Paul Anderson and David O. Russell.\nBrion's artistic path hasn't always been easy, but it's always been clear. He's defined his career by taking things he didn't like (school, most live music shows, needle-drop film scores) and turning them into something new and completely his own. He's a one-man case study on how truly unique talent can succeed in an industry that rarely embraces iconoclasts. Sometimes the biggest victory is getting away with being yourself.", "duration": "01:02:24", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/190019574-offcamera-off-camera-24-jon-brion.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 22. Jon Brion Off Camera - 22. Jon Brion"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1422252420, "title": "Off Camera - 21. Laird Hamilton", "author": "offcamera", "summary": "It's understandable that \"Oh My God\" was the only caption Surfer magazine could come up with for their cover photo of Laird Hamilton, whose drop into Tahiti's Teahupo'o break on the morning of August 17, 2000 established him as the greatest surfer in the sport's recorded history. How he got there (and lived to get there) is the story of a life lived far outside the confines of tradition. Hamilton has always seen himself as an outcast, first as a white boy growing up among native Hawaiians, and then as a world champion surfer who refused to prove it in any organized surf competition. Brought to the island as little boy by a single mom, he grew up young, fast and precariously. Ironically, the same ocean that was always one wave away from taking his life at any given moment was probably what saved it. His passion for the sea and finding unheard of new ways to ride it gave him focus, direction and an enviably heightened connection to our environment. You don't spend a lifetime doing certifiably insane things in the awesome, powerful sphere we inhabit without developing a deep appreciation for it. After all, why are we on earth if not to really be on it? Off Camera invites you to enjoy some epic stories and life lessons from a master who reminds us that we're all equal before a wave. We doubt he'll be catching his last one anytime soon, but if he does, you can bet it'll be with no regrets.", "duration": "01:18:41", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/187911697-offcamera-off-camera-23-laird-hamilton.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 21. Laird Hamilton Off Camera - 21. Laird Hamilton"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1421112720, "title": "Off Camera - 20. Taylor Goldsmith", "author": "offcamera", "summary": "Some artists do what they do because it's simply impossible for them to do anything else. Meet exhibit A: Taylor Goldsmith. At just 28, the songwriter and front man of LA-based band Dawes is already hailed as one of our most mature song crafters. His work has been compared not only to some of the greatest classic authors (whom he reads avidly) but also to some of the musical poets who inspire him: Bob Dylan, Jackson Browne, Robbie Robertson, Warren Zevon - many of whom he seems undaunted by actually having worked and toured with. Goldsmith grew up in a musical household, and has played music with his brother Griffin since age 10. He appears to somehow have sprung from the womb with an almost fully developed sound and lyrical approach. He's stayed true to both while still managing to evolve over Dawes' last three albums.\n\n\nSo who better to discuss the mysteries process of songwriting than one of its most authentic and thoughtful practitioners? What experience informs a great song and makes its story valid over time? What role should the writer's life experience play in a song? And if great songs are deeply personal, how do they still connect with thousands? And also, why does a guy whose songs are widely associated with the Laurel Canyon sound and who indeed recorded his band's first album in Laurel Canyon not actually like LA that much? Whether you've pondered these questions before or not, we guarantee you will enjoy the conversation.", "duration": "01:00:34", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/185770182-offcamera-off-camera-22-taylor-goldsmith.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 20. Taylor Goldsmith Off Camera - 20. Taylor Goldsmith"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1419883620, "title": "Off Camera - 19. Jeff Bridges", "author": "offcamera", "summary": "For someone who balked at entering the family business, Jeff Bridges has one well-developed CV. He won the Academy Award for Best Actor for his role as Otis \"Bad\" Blake 2009's Crazy Heart and has received multiple nominations and accolades for his brilliant work in such iconic films as The Last Picture Show, Starman, True Grit, Fearless,Tucker, The Fabulous Baker Boys, and perhaps his most successful \"unsuccessful\" film ever, The Big Lebowski. Such a lineup could make a lesser actor all too ubiquitous, but watching him perform remains nothing less than pure cinematic joy. Attribute that to his canny choice of roles, or according to him, sloth - \"All these jobs are messing with my laziness, man.\" We think New York Magazine film critic Pauline Kael nailed the truth when she wrote that Bridges \"may be the most natural and least self-conscious screen actor that has ever lived.\"\nIn this episode, Bridges shares his often unorthodox means of finding his way into characters, and how each has influenced his many creative paths. When Bridges immerses himself in a role he never comes out...at least not without a new skill or passion that enriches both his films and his reputation as a creative polymath. As apt and interested in his music, sculpting, photography, philanthropy and drawing as he is in film, he admits to some anxiety about being all of them versus, well, just being. But with time he's cultivated an enviable lack of worry and the ability to embrace the yin while on occasion \"yanging my ass off\".OC and Bridges wax philosophical on life, art and the creative process, so just abide and enjoy the ride.", "duration": "01:11:46", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/183634431-offcamera-off-camera-21-jeff-bridges.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 19. Jeff Bridges Off Camera - 19. Jeff Bridges"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1418677680, "title": "Off Camera - 18. Judy Greer", "author": "offcamera", "summary": "Say you're an actor who's been in over 50 films and on just about every TV show known to modern audiences, but no one can ever figure out where they've seen you before. You might start to wonder what you're doing wrong. If you're Judy Greer, you realize it means you're doing everything pretty right, and you write a hysterical book about it. The archetypal sweet, hardworking Midwesterner who moves to LA with dreams of making it big, did - as everyone's best friend, playing sidekick to the stars in films like The Wedding Planner, 13 Going on 30, 27 Dresses, and The Descendants. Between movies, she piled up appearances on TV shows such as Arrested Development, My Name Is Earl, Californication, ER, House, Modern Family and The Big Bang Theory. So naturally, she's written the book on what makes a great co star. Really, she did. It's called I Don't Know What You Know Me From: Confessions of a Co-Star.\n\nAn inveterate hustler whose already-long, successful career is marked by equal parts talent and persistence, Greer admits she still struggles with fears and insecurities, including whether she's actually even an artist. In the course of becoming comfortable with herself and her place in the industry, she's accumulated some wisdom, which she generously shares: judge books by their covers, really fuck up auditions, and most importantly, give up your dreams.\n\nShe joins Off Camera to talk about forging her way Hollywood, her dreams of resurrecting the big romantic comedy, and what it's like to finally play a leading role on her new TV series, Married. We loved talking to the first lady of second fiddles, who calls her whole career \"a luck-out\". But don't let the nice Midwest exterior fool you. She's a mouse-killer, friends. And she really, really wants a gun.", "duration": "01:02:38", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/181667296-offcamera-off-camera-20-judy-greer.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 18. Judy Greer Off Camera - 18. Judy Greer"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1417316700, "title": "Off Camera - 17. Jackson Browne", "author": "offcamera", "summary": "Jackson Browne is a master songwriter whose artistic journey spans the evolution of folk music and in many ways, the evolution of the music industry itself. That journey began with the de rigueur cross-country van trip from suburbia to NYC financed with $50 and his mom's credit card. Few such aspiring-artist journeys result in an offer to gig with Warhol superstar Nico and a record label deal - at 18, no less. His timing was good. As music began moving away from the circumscribed pop of 50s and 60s, musicians were searching for more original, personal fare. And Browne had plenty, writing for himself, and also for the likes of The Nitty Gritty Dirt Band, Gregg Allman, Joan Baez, the Eagles, Linda Ronstadt and The Byrds to name a few.\n\nRecording his own material proved more challenging; challenging enough that early champion David Geffen was forced to start his own record label just to make one. You're welcome, David. Browne's lyric genius and mind-boggling ear for melody gave us some of the most iconic entries in the American rock songbook - \"These Days\", \"Running on Empty\", \"Doctor My Eyes\", \"Somebody's Baby\" -anthems that evoke images and emotions with that rare ability to morph and bend to resonate with each new generation. Perhaps that's because he takes the time to let the songs take shape and become what they need to be. Jackson Browne is a legend yes, but one with the discipline, and relevance and plain old love of craft to keep creating and moving forward. Aspiring songwriters, here's your User's Manual.", "duration": "01:11:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/179251540-offcamera-off-camera-19-jackson-browne.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 17. Jackson Browne Off Camera - 17. Jackson Browne"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1416214320, "title": "Off Camera - 16.5 Ed Helms", "author": "offcamera", "summary": "What, me worry? Editor, musician, actor, comedian - Ed Helms makes it all look easy. And for him, it kind of is. The secret? A supportive, if showbiz-ignorant family helps, as does a seemingly bottomless supply of self-confidence. Helms left a happy, successful career as a commercial editor to take his chances in comedy with none of the attendant anxiety you'd expect with such a move. Why? He was just pretty sure he could do it. And he was right, landing at The Daily Show as one of its best writers and correspondents. As far as Helms was concerned, he was pretty much in his dream job when he was offered a role on The Office, but with no guarantees Andy Bernard would live beyond a couple of episodes. Risk an established career for what could easily be a rapid sitcom death? He figured he could do that, too. And we all know how that worked out. Helms talks to Off Camera about the arc of his career, his band (Andy Bernard's mad banjo skills are real, kids), how The Hangover impacted his life and his rampant curiosity about, well, almost everything. Don't mistake Ed's confidence for arrogance - chalk it up to his hard work and equal parts respect and disregard for fear. But mostly, this most happy fella simply loves every moment of what he does, whatever that happens to be at the moment. Which is probably why we do, too.", "duration": "01:21:41", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/177296365-offcamera-off-camera-18-ed-helms.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 16.5 Ed Helms Off Camera - 16.5 Ed Helms"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1415081400, "title": "Off Camera - 15. Matt Damon", "author": "offcamera", "summary": "When a kid tells you he wants to be an actor and starts holding regular meetings in the high school cafeteria with his \"business partner\" it's kind of cute. When they establish a joint bank account to fund New York audition trips and the occasional arcade game, well call it naive. Unless you are Matt Damon and said business partner is Ben Affleck, then call it a no Plan B laser like focus on a goal. One that spawned the Academy Award winning script for Good Will Hunting. What started as an attempt to write themselves into acting jobs garnered Damon not only accolades but also some early lessons about fame, career choices, and the industry he was determined to be a part of. It also enrolled him in a 20 year on the job master class with the best film makers of our generation including Martin Scorsese, the Coen Brothers, Steven Spielberg, Clint Eastwood, Steven Soderbergh, Francis Ford Coppola, and Gus Van Sant. Along the way he also developed an uncanny ability to disappear into any character and become someone believable different in every film. So what could possibly be next? Damon tells Off Camera why no matter what it is, it will be something that he absolutely loves. So pull up a chair and listen in.", "duration": "01:15:43", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/175261414-offcamera-off-camera-17-matt-damon.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 15. Matt Damon Off Camera - 15. Matt Damon"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1398899520, "title": "Off Camera - 14. Sarah Silverman", "author": "offcamera", "summary": "As a third grader, Sarah Silverman had already narrowed her future career to three options: Comedian, actress or masseuse. She landed pretty quickly on comedian and never looked back, dropping out of college with the support of a father who financed her NYC apartment and three-year curriculum of comedy club work.\n\nSuccess came rapidly and almost unbelievably when she was hired as a Saturday Night Live writer at just 22 - sans audition.  She was fired almost as rapidly, without any of her work ever appearing on the show. Former SNL writer Bob Odenkirk said, \"I could see how it wouldn't work... because she's got her own voice, she's very much Sarah Silverman all the time. She can play a character but she doesn't disappear into the character - she makes the character her.\" Despite some noted guest TV and film appearances, Silverman never looked at standup as a stepping-stone to an acting career. She is a stand up comedian \"the way some people are gay\".\n\nCompulsively revealing the painful (she dealt with depression and bed wetting into her teens) and the uncomfortable, the more she becomes herself, the funnier (if more shocking) we find her, whether we admit it or not. Her combination of honesty and true comedic skill results not in a series of jokes, but a series of insights that connect - all the more stealthily for being cloaked in humor. Sarah Silverman talks to Off Camera about her breakout special Jesus is Magic, the decision to film the more recent We Are Miracles in front of a vast audience of 39, and living the low-overhead dream.", "duration": "01:15:48", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/147300196-offcamera-off-camera-15-sarah-silverman.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 14. Sarah Silverman Off Camera - 14. Sarah Silverman"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1391457300, "title": "Off Camera -  13. Michael B Jordan", "author": "offcamera", "summary": "Drug dealer, football player, alcoholic, shooting victim. In his first decade of acting, Michael B. Jordan has found ways to humanize characters that, on the page, may seem stereotypically what he dubs \"the black guy.\" In The Wire, a young and very sheltered Jordan asked fellow actors to help him understand how to simulate a cocaine high onscreen, and through that surreal experience discovered his unfettered love of acting.  In Friday Night Lights, Jordan started journaling as an acting exercise, and amassed a detailed back story for quarterback Vince Howard that made the character seem shockingly real.\n\n      With Fruitvale Station, Jordan dug even deeper. Playing a real person for the first time, he inserted himself deep into the family of the slain Oscar Grant, who was killed by a police officer on a train platform in Oakland in 2009. Jordan spent time with Oscar's former girlfriend, mother, daughter, and all of his friends. The result was an intensely real portrayal of an innocent young man in a film that exposes our ongoing race problem in this country, and Jordan's performance was nuanced, understated, and masterful. \n\n     Perhaps his ability to play characters with the odds stacked against him comes from his own desire not to fall into that lifestyle. Jordan started working very young, doing modeling and acting in commercials, and saw an acting career as a way out of the tough urban environment of Newark, New Jersey. In his words, he saw \"plenty of Wallaces, Bodies, and Avon Barksdales,\" and was determined to make a better life for himself.\n\n     Not only does Jordan not want to just \"play the black guy,\" he also doesn't want to compare himself too closely to actors that came before.  He says he doesn't want to be the next Will Smith, or the next Tom Cruise--he just wants to be himself. When you are around Jordan, his optimism and ambition are infectious and endearing. He doesn't just want to star in films - he wants to produce them.  He doesn't want to just be on television, he wants his own channel. And he doesn't just want to be the face of a studio, he wants to run a studio. At Off Camera, we wouldn't bet against him doing anything he sets his mind to.", "duration": "00:58:54", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/132890452-offcamera-off-camera-13-michael-b-jordan.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera -  13. Michael B Jordan Off Camera -  13. Michael B Jordan"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1386100800, "title": "Off Camera - 12. Will Forte", "author": "offcamera", "summary": "Anyone reading Wikipedia's entry on Will Forte couldn't be blamed for suspecting it's the prank of a fellow jokester. High school class president and football player? College history major? Promising financial broker? Seriously? Entries for his more recent past (That '70s Show writer, The Groundlings, Saturday Night Live) seem more like the real Will Forte - until you watch his subtly astounding turn in Nebraska.\nDirector Alexander Payne considered over 100 actors for role of David, all of who wanted it - badly.  It's understandable, given the Oscar buzz and critical acclaim the film and cast have generated since the movie's release. So how does MacGruber wind up as the kind voice of reason in a bleak cinematic landscape populated by bitter, deluded characters?\nForte says maybe Alexander Payne had the best answer when he said that directors often choose actors \"because they think 80% of the character is already you.\" Indeed, Forte's performance is so genuine, honest and stripped down it makes us wonder if the whole wacky funny guy thing is just an act. Any comedy we see in his character is of the absurdly sad sort that Payne has a genius for capturing.\nIt's hard not to draw parallels between the physical journey David takes in the film and Forte's journey as an actor.  Forte is grateful for every moment of it and excited about what comes next. At Off Camera, we will be watching to see exactly what that will be.", "duration": "01:27:27", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/123079324-offcamera-off-camera-12-will-forte.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 12. Will Forte Off Camera - 12. Will Forte"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385919000, "title": "Off Camera - 11. Martin Short", "author": "offcamera", "summary": "Martin Short grew up in a family full of funny people.  He staged make-believe talk shows in his attic and absorbed a steady TV diet of comedy masters like Carson, Rickles and Paar, and yet inexplicably dreamed of becoming a doctor. Or a dentist. Always serious about success, Short gave himself a one-year contract to make it in comedy before returning to school for a master's degree in a respectable medical field. Though we all know how things worked out, it's rare to find a budding comic with a backup plan. But Short is a rare comedian - one you'd both want to go out and drink with and who you would allow to watch your kids.\n\nMaybe due to his upbringing as the adored baby of a family who never discouraged his comedic pursuits, Short developed a self assurance uncommon to the standard performer's psyche. But it's as hard-earned as it is innate: Short prepares. He practices in mirrors. He plots sketches with index cards. He does his homework. He knows his audience, and when it comes to talk shows, he knows his hosts.  He's an encyclopedia of the style nuances of everyone from Kimmel to Letterman.\n\nShort will tell you that confidence is the most important factor in any good performance, and it's likely what kept him on a steady rise through the ranks of improv and sketch comedy, and helped him avoid imploding from the pressures of being the new guy in the room with some of the genres' most intimidating names. Harry Shearer, Christopher Guest, Billy Crystal and Lorne Michaels were just a few of his early colleagues.\n\nIt's not hard to imagine that Short's self possession is also at the root of some of his most precocious and obnoxious inventions.  We find Ed Grimley and Jiminy Glick hysterical in direct proportion to their complete lack of self consciousness.  Short's most beloved characters are his finely observed, albeit magnified versions of people we all know.\n\nOff Camera attempts to reconcile the frenetic showman, consummate comedy student and urbane purveyor of talk show banter as we ask, \"Is this guy serious?\"", "duration": "01:14:49", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122169455-offcamera-off-camera-11-martin-short.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 11. Martin Short Off Camera - 11. Martin Short"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385832660, "title": "Off Camera - 10. Stacy Peralta", "author": "offcamera", "summary": "Stacy Peralta recalls his earliest and most visceral memories of skateboarding as the rumbling of the sidewalk coming up through his feet. Metaphorically, what he might have been feeling was the oncoming explosion of skateboarding, which would carry him to places he couldn't imagine as a grade schooler on his inaugural ride down an especially smooth stretch of Venice Boulevard in Southern California. By age 17 he was inventing iconic tricks and earning more money than his parents as a skater, and by 19 he was the sport's highest ranked pro. His skate team, Powell Peralta, launched the careers of legends like Rodney Mullen, Steve Caballero and Tony Hawk.  His Bones Brigade Video Show virtually invented the skateboard video, creating the sport's first marketing vehicle and enabling kids worldwide to see the sport's best athletes up close and personal. And for his next trick? Peralta walked away from it all.\n\nPeralta abandoned what had been his whole identity to attempt a writing and directing career in film and television. This leap of faith is even braver (or perhaps more foolish) in light of his own complete lack of confidence in his chances of succeeding. And his fear seemed justified by an initial run of projects that Peralta says \"just got worse and worse\". But because doing anything else seemed even more impossible, he did succeed:  His documentary Dogtown and Z-Boys premiered at Sundance, winning the documentary Directing and Audience Awards and selling over a million DVD copies. His Crips and Bloods: Made in America won acclaim as a hard hitting, and thoughtful look at the circumstances that led to the creation of two of the most violent gangs in U.S. history.\n\nPeralta talks about weathering the highs and lows of a truly remarkable career and tells Off Camera that for the first time in 15 years he doesn't know what he's going to do next.  Whatever it is, have faith it'll be rad.", "duration": "01:30:22", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122169570-offcamera-off-camera-10-stacy-peralta.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 10. Stacy Peralta Off Camera - 10. Stacy Peralta"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385746200, "title": "Off Camera - 09. Laura Dern", "author": "offcamera", "summary": "Any 7 year-old who inhales 19 ice cream cones in a row for her first movie appearance, arranges a clandestine meeting with an agent at 11 and inflates her age by an improbable 8 years to audition for the role of a 19 year old really wants to be an actress.\n\nMaybe Laura Dern never really had a choice anyway. The daughter of acclaimed actors Bruce Dern and Diane Ladd was assured of her destiny by Martin Scorsese, who saw her future in the fact that she didn't throw up the aforementioned ice cream cones.\n\nHe was right. Dern gives us complicated personalities whose often baffling behavior we somehow understand due to the firm and uncompromising grip she keeps on their humanity. It's a rare ability to find in any actor. It's a crucial ability for an actor whose carefully-selected projects started and largely remain with directors like David Lynch, Alexander Payne and Martha Coolidge, whose films aren't widely populated by America's sweetheart-type characters.\n\nIn this interview, she discusses what she's endeavored to bring to some of her early roles in films like Foxes, Smooth Talk, Wild at Heart and Blue Velvet, and those films' effect on her as a young actress growing into womanhood on camera. To understand her approach is to understand how the best in their craft can suck us into their characters' psyche without our ever realizing we're there. Dern also touches on some of her enviable mentors, age and sexuality in the movies, and getting closure on the wrap of her brilliant HBO series Enlightened.\n\nObviously and deeply in love with every aspect of film making, Dern is as fascinating to talk to as she is to watch; she's the friend you'd want to stay up with all night for the most fun and interesting conversation. Off Camera apologizes in advance - this interview will leave you wanting more.", "duration": "01:18:24", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122169447-offcamera-off-camera-09-laura-dern.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 09. Laura Dern Off Camera - 09. Laura Dern"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385659680, "title": "Off Camera - 08. Judd Apatow", "author": "offcamera", "summary": "What kid tells himself, \"I know being a high school loner who reads comic books all the time will pay off for me\"? One who winds up being a loner who reads comic books all the time. Or, one who winds up creating iconic comedies like Knocked Up, Superbad, and most recently, This Is 40. Enamored with comedy and comedians as a grade schooler, Judd Apatow set about interviewing his idols for WKWZ. The first thing he learned is that they're kind - no one kicked him out when they realized WKWZ was a high school radio station.\n\nWhile his comedies and the actors in them are household names, most fans are unaware they're the beneficiaries of a filmmaking approach Apatow is largely credited with developing. Fueled by self-doubt or maybe just any comedian's compulsive search for the ultimate killer line, Apatow shoots and tests multiple versions of almost every scene he films. His true genius may be his knack for identifying new and often unlikely talent, and letting it inform his scripts. This approach has elevated the not only the films themselves, but the careers of James Franco, Lena Dunham, Seth Rogen, Melissa McCarthy and Steve Carell, to name only a few.\n\nPerhaps due in part to his own painfully geekish childhood, he continues to remake Freaks and Geeks in work that lays bare our foibles, anger, lunacy and occasional transcendence. At once eviscerating and empathetic, he holds a mirror up to us and we laugh in recognition. Apatow has seen us naked, and we don't mind. Off Camera sits down with the crazy voice in all of our heads for an in-depth interview.", "duration": "01:36:30", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122169176-offcamera-off-camera-08-judd-apatow.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 08. Judd Apatow Off Camera - 08. Judd Apatow"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385573400, "title": "Off Camera - 07. Dave Grohl", "author": "offcamera", "summary": "Being a bona fide badass is the price of entry for a career in rock and roll; and if you ask Dave Grohl, it's the key ingredient for just about anything worth doing. His approach to life has fueled the Foo Fighters' 20 year,11 album career and garnered him a following of very stoked rock fans, many of who gathered at this year's SXSW music conference to hear Grohl's keynote address.\n\nThe hipsters, rockers, start-uppers and next-big-thing developers packing the room were no doubt curious to hear how one goes about dropping out of high school, rising to fame as the drummer in Nirvana (a small Northwest act you may have heard of), and then go on to lead one today's few remaining true rock bands? For Grohl, the answer's pretty simple: figure out who you are and what inspires you and don't look back - develop that individuality by working as hard as you can at what you love.\n\nThat clarity of approach drove not only his Nirvana/Foo Fighters trajectory, but numerous musical side projects like Queens of the Stone Age, and Them Crooked Vultures. And most recently, a new artistic title: documentarian. He didn't know anything about the film making process except what he needed to know most: Passion for your subject is sine qua non; and not one to do anything without it, Grohl didn't question himself. Nor apparently did Rick Springfield, Neil Young, Stevie Nicks, Paul McCartney, and Tom Petty, all subjects of Sound City, his fascinating documentary about the people behind the studio that launched an amazing roster of legendary music acts.\n\nFor a guy who admits to still feeling like a 13 year old and dressing like a 17 year old, Grohl has something to teach all of us...and shares it with Off Camera in one of our most inspiring interviews to date.", "duration": "01:21:40", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122169439-offcamera-off-camera-07-dave-grohl.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 07. Dave Grohl Off Camera - 07. Dave Grohl"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385486820, "title": "Off Camera - 06. Tony Hawk", "author": "offcamera", "summary": "If pro skateboarders have resumes, Tony Hawk's is undoubtedly among the longest and most envied. Though he's the most decorated skater ever with the highest contest win percentage of any sport and a $1 billion video game series, Hawk has arguably given more to the sport than he's received.\n\nWatching Hawk skate is testament to creativity and artistry as much as athleticism, as is his autobiography, which required a glossary to catalog the tricks that are his legacy to the skateboarding lexicon. His Tony Hawk Foundation has contributed over $4 million to develop 500 skate parks around the world. He's also been skating's foremost advocate, promoting it through some of its darkest days (though smashing his pelvis while attempting a full loop dressed in a gorilla suit probably doesn't count).\n\nHawk joins Off Camera to talk about the evolution of the sport from its scrappy underground beginnings to X Games behemoth. He shares his thoughts on the vital role of creativity and artistry in athletics and his continued love and commitment to the sport. Now a father of 4 that can still stick the most difficult tricks ever invented, we learn why at 44, he still makes his primary living on four wheels.", "duration": "01:18:31", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122168969-offcamera-off-camera-06-tony-hawk.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 06. Tony Hawk Off Camera - 06. Tony Hawk"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385400720, "title": "Off Camera - 05. Robert Downey Jr", "author": "offcamera", "summary": "\"Moral certainty is always a sign of cultural inferiority. The more uncivilized the man, the surer he is that he knows precisely what is right and what is wrong. The truly civilized man is always skeptical and tolerant, in this field as in all others. His culture is based on 'I am not too sure.'\" -H.L. Mencken\n\nHenry Louis Mencken and Robert Downey Jr. did not cross paths in life (though it's fun to imagine that conversation), but the essayist's quote is an apt description of the actor's approach to life. Downey's restless intelligence is reflected in his ability to express several contradictory points of view simultaneously, making sense all the while. He can be direct one moment and elusive the next, often spinning off on seemingly unrelated tangents. But like watching a juggler on a wire, being in Downey's presence is a riveting experience.\n\nFor someone who almost from the outset was deemed \"the greatest actor of his generation\", the majority of Robert Downey, Jr.'s career has been filled with big commercial flops, \"critically acclaimed\" flops, very public struggles with drugs and more than a little jail time - all of which have landed him squarely in some of the biggest blockbuster films in recent history. It's an unlikely hero story, but then Robert Downey Jr. is an unlikely hero.\n\nWith the release of the final film in the Iron Man trilogy, it's ironic to contemplate that the studios also didn't see him as a hero, least of all an action hero. Downey disagreed. At once supremely convinced of his own talent and extremely humble, he fought hard for the role of Tony Stark when the studio flatly refused to even let him audition. He prepped intensely, though for other roles he admits he's just as likely to wing it.\n\nDowney is an enviably comfortable resident of the gray area we all inhabit. He is (somewhat) remorseful about his jail time but without resentment towards the upbringing that arguably introduced him to the lifestyle that led him there (\"I choose to see it in a positive light.\") His years in the industry have left him clear-eyed and cynical about the business; yet he remains full of enthusiasm and curiosity about his art, and he's deadly serious about bringing the best of himself to the set every day. He's an obsessive analytic who's inclined to let his gut make most of his decisions. On any multiple-choice personality test, Robert Downey Jr. is 'all of the above.' Maybe that's what keeps us watching.", "duration": "01:11:58", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122167071-offcamera-off-camera-05-robert-downey-jr.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 05. Robert Downey Jr Off Camera - 05. Robert Downey Jr"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385227980, "title": "Off Camera - 04. Aimee Mann", "author": "offcamera", "summary": "Aimee Mann, the Boston born singer/songwriter, Grammy winner and self-described Oscar loser, was recently named to NPR's list of the ten finest living songwriters. It was a well-deserved honor, and put her in the company of artists like Bob Dylan, Paul McCartney, and Tom Waits.\n\nWhile Aimee Mann is widely acknowledged for her songwriting talent, her lesser-known role as an industry trailblazer is as laudable as it is fascinating. Starting with the sudden and disconcerting fame of her band 'Til Tuesday and spanning eight solo albums, the arc of her career has largely reflected, and in some ways shaped, the music business itself.\n\nMuch of that career was defined by her struggle and just plain bad luck with record labels that couldn't see past Mann's model looks and the dollar signs in their eyes that she was not the artist they were molding her to be. In her struggle to stay true to herself as an artist, Mann chafed under contracts and finally started her own label in order to put out her finely-observed songs the way she wanted to put them out - a ground-breaking move at the time and one that paved the way for musicians just starting to navigate the chaos of the music business today. The irony? With no more Goliath labels to fight and at the absolute peak of her talent as a songwriter, the channels for distributing and making a living from music are disappearing.\n\nWith surprising humor and optimism, Mann lets us in on her bumpy journey, a few surprising hobbies and why, after a career-long struggle to make a living with her art, she believes there's always a next step.", "duration": "01:28:21", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122167061-offcamera-off-camera-04-aimee-mann.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 04. Aimee Mann Off Camera - 04. Aimee Mann"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385139660, "title": "Off Camera - 03. Blake Mills", "author": "offcamera", "summary": "After releasing two records with his former band Simon Dawes (now Dawes), guitarist/producer/songwriter Blake Mills went on to become a go-to touring guitarist and session musician for acts including Jenny Lewis, Band ofHorses, Julian Casablancas, Lucinda Williams, Fiona Apple, Conor Oberst, Kid Rock, Norah Jones, Lana Del Rey and Danger Mouse. A lifetime of career experience for most musicians, it constitutes Mills' resume at just 26 years of age. Impressive, even given that he played his first gigs at 13 (in bars...but that's another story).\n\nMills encompasses several rare dichotomies: A true intellectual and a pop/rock musician; a supremely accomplished guitarist and also a songwriter to be reckoned with; and a virtuoso who doesn't let his virtuosity get in the way of making great music.\n\nMills talks to Off Camera about how his autodidact approach informed his musical development, how today's musicians and fans are both helped and hurt by vast access to music online, escaping a career in football and what he and some talented collaborators are doing hosting public jam sessions in a surf shop. If Mills' name isn't more well known, perhaps it's because he works pretty hard to remain low key. That may just change with the growing popularity of his first solo album, Break Mirrors.", "duration": "01:08:50", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122166091-offcamera-off-camera-03-blake-mills.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 03. Blake Mills Off Camera - 03. Blake Mills"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1385053260, "title": "Off Camera - 02. John Krasinski", "author": "offcamera", "summary": "As Jim Halpert, John Krasinski embodies The Office's most beloved Everyguy, but his middle-achiever alter ego belies the actor's impressive and accomplished resume. At just 33, he has written, directed and produced both television and feature films with some of the industry's most talented heavy-hitters.\n\nKrasinski shares his own version of the waiter-to A-list story and talks about staying true to his artistic path despite periods of self-doubt. An avid and humble student of experience, he discusses what he's learned from his work with industry veterans such as Sam Mendes, Gus Van Sant and George Clooney. Krasinski talks to Off Camera about wrapping the final season of The Office, the value of supportive parents, and about his newest film, Promised Land, which he co-wrote, and co-stars with Matt Damon.\n\nAt one of the most interesting junctions in his career, an actor who's arguably done it all looks ahead to what he hopes will be next.", "duration": "01:33:36", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122164937-offcamera-off-camera-02-john-krasinski.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 02. John Krasinski Off Camera - 02. John Krasinski"]}, {"seriesId": 642483864, "seriesTitle": "Off Camera with Sam Jones", "pubDate": 1384968840, "title": "Off Camera - 01. Val McCallum", "author": "offcamera", "summary": "Whether or not you've heard of Val McCallum, you've undoubtedly heard his work. Val is a supremely talented guitarist, singer, songwriter and studio musician who got his start recording for the legendary songwriter Harry Nilsson at age 18. After 30 years of working with such artists as Jackson Browne, Lucinda Williams, The Wallflowers, Bonnie Raitt, and countless others, Val McCallum has released his first solo record. Entitled At the End of the Day, it is a collection of spare, acoustic and grippingly intimate songs.\n\nWe grabbed Val between stops on his current tour with Jackson Browne and gigs with his own wickedly humorous country band Jackshit, where he performs as alter ego Beau Shit along with bass player Davey Faragher and drummer Pete Thomas, who make their living as Elvis Costello's rhythm section.\n\nVal grew up in Los Angeles and is the son of actor David McCallum and actress Jill Ireland, but Ireland raised Val and his brothers Jason and Paul with Charles Bronson, who she married when Val was a young boy. Val discovered the guitar at age eight, and arguably hung on to it for dear life through some tough twists and turns, including the tragic death of his brother Jason and the loss of Ireland to cancer.\n\nIn \"At The End of the Day,\" Val opens these wounds and sings with touching candor about themes that are at once deeply personal and universally human. It's a record about loss, grief and loneliness that somehow manages to create a mood of catharsis, promise and understanding.\n\nReminiscent of early Neil Young, Nick Drake and Crosby Stills and Nash, \"At the End of the Day\" is an achievement of understated beauty.\n\nIn this episode, Sam Jones talks to Val McCallum about his experiences making records with so many iconic artists, and about the process of making his own. So pull up a chair and listen in.", "duration": "00:53:57", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music62/v4/f2/0c/d9/f20cd903-5461-dbac-5a02-21337859b10d/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/122161823-offcamera-off-camera-01-val-mccallum.mp3", "type": "episode", "tags": ["Talk Radio", "Podcast Advertising | PodcastOne Sales Off Camera with Sam Jones Off Camera - 01. Val McCallum Off Camera - 01. Val McCallum"]}]}