{"series": {"feedUrl": "https://rss.art19.com/crime-writers-on", "genres": ["Literature", "Podcasts", "Arts", "TV & Film", "Society & Culture"], "title": "Crime Writers On...", "country": "USA", "author": "Partners in Crime Media", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "type": "series", "id": 949195280}, "episodes": [{"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1488595016, "title": "State v Adnan Syed (AGAIN), MORE Missing Richard Simmons & HBO's Big Little Lies", "author": "", "summary": "It's another paper dump in the ongoing appeals around Adnan Syed from Serial season one. Kevin takes a look at yet another news-making turn in the case, and Rebecca gives it a big old eye roll (cute the hate mail!).\n\nAnd, episode 3 of Missing Richard Simmons was CRAY. From witchcraft to bitchcraft, we learned Richard's closest confidants f'ing HATE each other. How can we not revisit a podcast that brings up black magic? Yeah...we're SO gonna do that.\n\nThen, the Crime Writers examine HBO's newest murder mystery mini-series, \"Big Little Lies.\" Does an A-list cast + domestic noir = another hit? And should the producers stay keep the same killer/victim as the book, or make it fresh for the whole audience?\nPlus, what we learned in this Crime of the Week: if you live to be 100 you might get a lap dance from your nurse.\n\nSponsors for this episode include:\n\nSimpliSafe - get an exclusive 10% discount at simplisafe.com/criminal.\nSelect Blinds - mention Crime Writers On and get free sample swatches. \nHarry's - get the Harry's trial set for FREE at harrys.com/crime.\nHelloFresh - use promo code CRIME35 to save $35 on your first week of deliveries.\nTotal Wireless - check out their great cell plans at totalwireless.com.", "duration": "01:05:23", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/5dd7d42c-071a-4589-b4e9-f725f66c4ffd.mp3", "type": "episode", "tags": ["panel", "serial", "richard simmons", "panel discussion", "tv", "podcasting", "criticism", "couples", "Podcast", "Nicole Kidman", "Documentary", "HBO", "True Crime", "journalism", "pop culture", "mystery", "Reese Witherspoon"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1487988656, "title": "We Talk About 'Missing Richard Simmons' AND That 'Up and Vanished' True Crime Update!", "author": "", "summary": "Can you feel the love tonight? The Crime Writers can. \n\nPlus, the gang dives in to the breaking news about an arrest in the Tara Grinstead case - that's the one featured in the \"Up and Vanished\" podcast. \n\nAt the time of our recording, it was unclear what role the podcast played in Ryan Duke's arrest, but did Payne Linsey's grandmother actually know more than the cops did?\n\nNext, Rebecca interviews Missing Richard Simmons creator Dan Taberski about why he was drawn to the vanishing of everyone's favorite flamboyant exercise guru.\n\nThen the Crime Writers review the podcast: Is it ethical to chronicle someone's withdrawal from public life? What makes Simmons's story so uniquely compelling? Why did someone who gave support to so many individuals seemingly turn his back on them? Also, Kevin recalls his own professional interactions with Richard Simmons.\n\nIn the Crime of the Week: a squirrel plays guard dog by going spider monkey on a cat burglar. \n\nHELP US KEEP \"CRIME WRITERS ON\" GOING BY TAKING A BRIEF SURVEY!\n\nThis quick survey, at podsurvey.com/crime, lets advertisers know that we have a quality, successful, and loyal audience. It helps bring in advertisements for products and services that actually fit you.  \n\nSponsors for this episode include:\n\nTripping.com - search for and book the perfect vacation home at tripping.com/writers.\nKopari - get 20% your first order at koparibeauty.com/crime\nHelloFresh - use promo code CRIME35 to save $35 on your first week of deliveries.\nTotal Wireless - check out their great cell plans at totalwireless.com.", "duration": "01:14:05", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/1ba2159e-f2c4-4980-b13f-971bfb5f1e21.mp3", "type": "episode", "tags": ["panel", "serial", "richard simmons", "panel discussion", "tv", "podcasting", "criticism", "Podcast", "Documentary", "True Crime", "journalism", "pop culture", "mystery"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1487300217, "title": "Out Like A Serial Flynn, Etan's Legacy, & Netlix's Shadow Of Truth", "author": "", "summary": "In a jam-packed episode, the panel drinks the hater-aid as they read some of their correspondence. Rebecca name drops her fill-in gig on Slate's \"Mom & Dad Are Fighting\" podcast - which, ironically, is what the Lavoie-Flynn kids call \"Crime Writers On!\"\n\nA figure from Serial Season 2 makes a cameo, a certain general who made the adamant assertion that any soldier wounded in Afghanistan can be linked to Bowe Bergdahl's rescue mission. \n\nAnd, after waiting almost 40 years for a conviction, the crime writers take a thoughtful dive into the famous Etan Patz kidnapping case. It was more than just the crime that put kids' faces on milk cartons - it was the social turning point in how parents perceived the safety of their children.\n\nIn our review segment, the crew goes around the horn on whether or not you should check out the Israeli documentary \"Shadow of Truth,\" now available on Netflix. This four-part subtitled mini-series looks at the sensational murder of a teenage girl, the questionable investigation into the convicted killer, and the rabid public fan base that trolls the Internet seeking alternative suspects. (Kind of sounds like a certain American podcast we've listened to...)\n\nThen, in the Crime of the Week, the cops give a fugitive a tumble...and a spin.\n\nOUR SPONSORS THIS WEEK INCLUDE:\n\nMadison Reed. Go to madison-reed.com and use promo code WRITERS to get 10% off and free shipping.\nAudible. Get a free trial at audible.com/crime.\nSimpliSafe. Get 10% off your security system at simplisafe.com/criminal.\nTotal Wireless. Go to totalwireless.com.\nThe new book A Divided Spy by Charles Cumming.", "duration": "01:06:28", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/644a0bee-e74c-47ce-98f6-350e52e5c3de.mp3", "type": "episode", "tags": ["audiobooks", "serial", "tv", "books", "crime", "podcast", "true crime"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1486776788, "title": "The Staircase/Michael Peterson Owl Theory, Alford Pleas & A Stranglers Podcast Review", "author": "", "summary": "The panel tackles a HUGE true crime update - the Alford plea taken by Michael Peterson, the novelist and suspected murder featured in The Staircase - a documentary Rebecca contends is the Citizen Kane of true crime. As a bonus, our very own Legal Siri (AKA legal professor and Undisclosed genius Colin Miller) educates us on WTH Alford pleas actually are. \n\nThen the Crime Writers argue about an alternative theory posed in the Peterson case...was his wife Kathleen actually killed by an owl? That was the theory posed in the amazing pilot episode of the podcast Criminal - but Toby's not exactly buying it. (Shocking, we know.)\n\nThen, in our regular segment about whether you should watch/listen to/read the latest big thing in crime media, we review Stranglers, the podcast by Earwolf that takes a deep ol' dive into the Boston Strangler case. (Warning: This segment features a quasi-mansplain meltdown and Kevin Flynn doing a pretty convincing trashy Boston accent.)\n\nFinally, our Crime of the Week features one of Rebecca's favorite big box stores, a sex crime, and scabies.\n\nListen:\n\nThis week's sponsors:\n\nMadison Reed. Go to madison-reed.com and use promo code WRITERS to get 10% off and free shipping.\nThe new book A Divided Spy by Charles Cumming.\nKopari coconut beauty products. Go to KopariBeauty.com/crime for 20% off!", "duration": "01:01:37", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/39e97ff4-9167-45a7-a70b-78b14b480783.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1486181103, "title": "YUGE Serial News! Beware the Slenderman! And the Bear Brook Murders...solved?", "author": "", "summary": "The first Serial spinoff, \"S-town,\" will be dropping in March. And we do mean \"dropping.\" Serial Productions says it will release all of its episodes at once...making it one of the first major podcasts to invite fans to binge listen. Will you listen? Of course you will. And so will we.\n\nRebecca brings in reporter Jason Moon to discuss the decade's old case of four unidentified bodies found in two barrels in Allentown NH's Bear Brook Park. A seemingly unrelated murder on the other side of the country may have revealed a serial killer...but no one knows who he actually is.\n\nThen the panel goes into the scary, provocative HBO documentary, \"Beware the Slenderman.\" It looks at the case of two young girls who stabbed their friend to appease a modern-day internet boogeyman. So, should you watch the movie?? The panel is split but agrees on one thing: don't watch this one in the dark.\n\nThen in Crime of the Week, the only way to foil high-tech crooks is to go old school.\n\nThis episode is sponsored by: \n\nSelect Blinds. Mention Crime Writers On at check to receive free samples.\nSimpliSafe. Go to simplisafe.com/criminal and get 10% off.\nHelloFresh. Get $35 off with promo code CRIME35.\nTripping.com. Book your next vacation home at tripping.com/writers.\nMadison Reed. Go to madison-reed.com and use promo code WRITERS to get 10% off and free shipping.\nThe new book A Divided Spy by Charles Cumming.", "duration": "01:18:42", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/4eede39d-0f80-430f-bfc1-117cf14b748f.mp3", "type": "episode", "tags": ["npr", "serial", "tv", "murder", "podcasting", "podcasts", "crime", "journalism", "unsolved", "pop culture", "podcastsforwomen", "true crime"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1485579004, "title": "No Serial Pardon, Bowe Bergdahl's Trump Problem & The Myth Of Kitty Genovese", "author": "", "summary": "Note: next week we're talking about HBO's \"Beware the Slenderman.\" (Homework is optional!)\n\nPardon us. Please. We're looking into the latest twist in the court martial of Serial season two protagonist Bowe Bergdahl. We're joined by friend-of-the-show USMC Judge Advocate James Weirick (ret), host of the Military Justice podcast. Now that former-President Obama declined to pardon Bergdahl, his lawyers say he can't get a fair trial with President Trump as Commander-in-Chief. Weirick will explain the arguments in the docket, why they submitted a video presentation, and he'll also provide some insight into the clemency granted to Pvt. Chelsea Manning. \n\nAlso, Lara gives a quick review of the new true crime podcast, Gone at 21. One of her positives: \"it's short.\"\n\nThen we'll talk about a documentary premiering on PBS's Independent Lens, \"The Witness\" (also available on Netflix). It reexamines the infamous 1964 murder of Kitty Genovese, the NY woman killed as 38 neighbors alleg edly watched but did nothing. Fifty years later Kitty's brother, Bill, digs into a crime he (and we) don't really know the truth about...including the myth that so many bystanders did nothing. \n\nAnd in the Crime of the Week, one Florida man makes a big mistake when seeking his own presidential pardon.\n\nThis episode is sponsored by PrepDish. Go to PrepDish.com/stories.\n\nThe episode is also sponsored by Madison Reed. Go to madison-reed.com and use promo code WRITERS for 10% off and free shipping on your first order.", "duration": "01:04:07", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/8c632a3b-cf83-48df-9a4a-497f1bfff635.mp3", "type": "episode", "tags": ["serial", "tv", "podcasting", "podcasts", "true crime", "pop culture", "journalism", "crime", "mystery"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1484967715, "title": "Serial Appeal Stumble, Journalism Bullies & Suspect Convictions", "author": "", "summary": "Toby's back...just in time to weigh in on the newest true crime podcast fill our ears.\nBut first - the state of Maryland has won the latest round in Adnan Syed's quest to get out of prison now that his conviction has been overturned. What does it mean that they've been granted a \"Leave to Appeal\" and how much closer are we to a new trial for the Serial season one protagonist? \n\nThen, we talk about something a little bit weird that happened during the latest episode of one of our favorite podcasters, Amber Hunt of the Cincinnati Enquirer's Accused podcast.\n\nThen we'll get into \"Suspect Convictions,\" and break down what's good, not good, and controversial (among the panel) about this true crime podcast from WVIK.\n\nIn the Crime of the Week, we're getting frisky in the Granite State - and it's got some goopy consequences!\n\nThis week's sponsors are:\n\nMadison-Reed! Go to madison-reed.com and use the promo code \"WRITERS\"\n\nPrepdish! Go to prepdish.com/stories\n\nSimplisafe! Go to SimpliSafe.com/criminal\n\nAudible! Go to audible.com/crime\n\nKopari! Go to Koparibeauty.com/crime", "duration": "01:13:18", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/5393a3ba-c3f0-4a86-a3ee-409f2cc3cc5d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1484366989, "title": "Serial Snobbery? A JonBenet Lawsuit! And Scientology & The Aftermath", "author": "", "summary": "When Toby's away, the mice will play...AND talk about all sorts of great stuff.\n\nSpecial guest panelist Amelia McDonnell-Parry gives us a lowdown on what she saw at Adnan Syed's PCR hearing, and why she thinks Sarah Koenig isn't doing the right thing by ignoring new evidence dug up by other podcasters.\n\nPlus, our true crime update takes on that $750 MILLION dollar lawsuit filed by Burke Ramsey after a CBS special pointed to him as the murderer of his sister, JonBenet. The panel has some strong feelings about that.\n\nAnd then, Scientology doesn't freak Kevin out, but talking about it does. Nonetheless, we give an overview of the incredible docuseries created by Queen of Queens (and Queen of Nails) Leah Remini, A&amp;E's Scientology & the Aftermath.\n\nAfter our crime of the week airs, one upstate New York man may try to buy every copy of this podcast. Yeah...we know.\n\nSponsors this week:\nHarry's Razors! Go to Harrys.com and use the code \"crime\"\nMadison-Reed hair color! Go to Madison-Reed.com and use the code \"writers\"\nHello Fresh! For a special deal, go to hellofresh.com and use the code \"crime35\"", "duration": "01:15:41", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/4ff902b1-5ebb-4c77-8b99-0127d1aaa4af.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1483112942, "title": "Adnan Syed's Setback, Serial's Audio Boo-Boo, and a Homecoming Podcast Review", "author": "", "summary": "After a holiday break, we're back. And so much has happened again. \nIn the land of true crime podcast updates, Adnan Syed has been denied bail while he awaits a new trial. The panel talks about that decision.\n\nIn other Serial news, we learned Sarah Koenig & co made a big boo-boo when putting together season one. Namely: using courtroom audio that was prohibited from broadcast. This time, justice was merciful.\n\nKevin responds to listener reaction to his criticism of \"Someone Knows Something.\" Again, it's another feisty split decision.\n\nIn this week's installment of \"Should You Listen?\" the panel weighs in on Gimlet's star-powered \"Homecoming.\" Is this the latest Gimlet podcast to break the mold?\n\nIn the Crime of the Week, an FBI sting operation on Capitol Hill! The target - no, not corrupt politicians - a bootleg DVD ring. \n\nRelated: In this episode, Rebecca talks about a news station covering a trial with puppets. Here's a link.", "duration": "01:04:25", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/a21734c3-ad03-4a66-8fa3-ea162f8b5cdb.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1481905521, "title": "A FEISTY Split Decision: Should You Listen to This True Crime Podcast?", "author": "", "summary": "The CBC's Someone Knows Something is back with a second season.\n\nSo should you listen? That's the question the crime writers will try to answer. Spoiler: it's a split decision, with at least one of the panelists (ahem, Kevin) expressing a very passionate opinion. \n\nWILL CANADA EVER FORGIVE US? We hope so.\n\nThe good news: host David Ridgen is back for his second interview with Rebecca, and he's really, really awesome. The bad news: after the interview, Kevin Flynn has a meltdown over how much he hates the podcast. It's kind of epic, but at least he feels a little bit bad about it.\n\nAlso, we eliminate homework for our listeners...especially for those of you who never do it!\n\nIn the Crime of the Week, a Santa-lookalike is kicked out of Six Flags. Grinch move or totes justified?\n\nProgramming note: CWO will be off the week of Dec 24 for the Christmas holiday, but will return on New Year's Eve, Dec 31. (No live wedding proposals are planned, we promise.)\n\nSponsors this week include: Sock Club. Go to sockclub.com and use promo code CRIME at checkout.\n\nAlso, Harry's razors is back! Go to harrys.com and save when you use code CRIME at checkout.", "duration": "01:03:47", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/86021dee-e5cf-47e4-bb59-224a5233cf99.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1481322514, "title": "Crimetown & Westworld Have Us Like Whoa!!", "author": "", "summary": "This week we dive in to two format-smashing shows: one the up-ends the conventions of podcast storytelling, and one that challenges the concept of story telling itself.\n\nThe panel examines \"Crimetown.\" This podcast from Gimlet sounds like nothing we've heard before. Are they setting a new bar for the traditional first-person investigative podcast or are they creating a completely new genre?\n\nAlso, the crime writers give their take on HBO's dizzying & dazzling \"Westworld.\" Was the western-tinged sci-fi series about man's inhumanity, a study on free will, or a contemplation of on the power of story? Or just a bunch of cowboys shooting and having sex with robots?\n\nPlus, Toby checks his Amazon Christmas list (is your gift on it?). We'll hear from a listener who offers her two cents on the Justin Ross Harris verdict (and then we offer her ours).\n\nThe Crime of the Week looks at the War on Christmas...by beavers.", "duration": "01:14:48", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/e25cfb31-d58f-403e-9011-02d217f187d7.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1480733229, "title": "Serial Scoop? Breakdown Conviction! Undisclosed Up Close! And Missing & Murdered", "author": "", "summary": "So many gifts for true crime fans this holiday season, as a new batch of podcasts are hitting the charts. Where to begin...where to begin?\nFirst, the panel drops a ton of true crime updates. These include a last-minute order keeping Brendan Dassey in prison, a verdict in Breakdown's Justin Ross Harris case, and a newspaper editorial calling for a pardon for Bowe Bergdahl. Plus, Rebecca parties-hearty with the team from Undisclosed and Addendum. \n\nThe most exciting news comes from \"Serial\" co-creator Julie Snyder who says their team will be dropping a new seven-week podcast in March. No, it's not Serial season three, but it sounds like a compelling story nonetheless - and Rebecca's got a decent theory as to who will be telling it.\n\nThen we dive into the CBC's investigation of the Alberta Williams case, \"Missing & Murdered.\" Set on an island fishing town off the coast of British Columbia, this podcast looks at a cold case from 1989, and the cop (and reporter) who's not afraid to name names. Bonus: Rebecca interviews host Connie Walker about making the podcast!\n\nFinally, we go all \"Hidden Tiger, Crouching Dragon\" in the Crime of the Week.\n\nThis episode is sponsored by Sock Club. Save 15% at checkout with code \"crime.\"\n\nWe're also sponsored by Pass the Pigs by Winning Moves Games. Get 20% off at checkout with promo code \"crime.\"", "duration": "01:18:43", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/d66210bb-8979-4673-a244-07a74a8a9c93.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1479524285, "title": "Writing Crime, Podcasting and More: A Special Live Show", "author": "", "summary": "A Serial spinoff?! A verdict in the Breakdown / Justin Ross Harris case! Brendan Dassey can go home, and then he can't!\n\nAll great topics to talk about, right?\n\nSorry to say we're not going to get to any of those this week. That's because we pre-recorded this episode at the New England Crime Bake, a convention for crime & mystery writers, on Saturday. Who would have thought all this good stuff would happen after we wrapped?\n\n(\"So you'll get to it next week, right guys? The week of Thanksgiving?\" Well, about that...)\n\nIn this live recording, the podcasting crime writers tell a room of nonpodcasting crime writers about Lara's cat's chlamydia, how we got started writing, and answer some listener emails and tweets. (Kevin's a hater? Says who?)\n\nLater, we pluck a writer from the crowd. We ask Maureen Milliken her about her work and boy, does she deliver!\n\nAnd this week's Crime of the Week is awwwww-ful.\nSponsors for this episode include\n\nMadison Reed - use code WRITERS to save 10% at checkout\n\nStranglers podcast from Earwolf", "duration": "01:01:04", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/89022870-be1c-41a1-b48a-f6c9ec86e3bf.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1478905371, "title": "Serial Season 3 News? Sort Of. And What's Different About Up And Vanished?", "author": "", "summary": "Breaking: Lara's cat has a super weird disease! For real.\n\nSome maybe-news about Serial Season 3 has us theorizing. Was Kevin super, duper wrong when he said Sarah Koenig would never do a true crime story again?\n\nPlus, we get a whole lot of listener email and tweets about what podcasts we should be listening to and talking about.\n\nOne of the podcasts we’ve had pimped to us the most often lately is the hit show \"Up and Vanished,\" an investigative podcast about the 2005 disappearance of Ocilla Georgia Beauty queen Tara Grinstead.\n\nBut before we get into our discussion about Up and Vanished, we'll first listen in to Rebecca's conversation with someone who knows a little bit about that show - its host and creator Payne Lindsey. Even if you haven't heard the podcast, you should listen to this interview.\n\nAnd, Toby apologizes to a nation. And our Crime of the Week strikes pretty damn close to home.\n\nEpisode sponsors:\n\nthegrommet.com/crimewriters\n\nmadison-reed.com (use the promo code \"writers\" at checkout)\n\nharrys.com (use the promo code \"crime\" at checkout)", "duration": "01:18:45", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/bf680923-1f48-4ef9-956c-b782e1bad350.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1478308575, "title": "Was In the Dark Better Than Serial? Plus Our Book, TV & Podcast Picks", "author": "", "summary": "What do people want to talk about? World Series? Presidential election? Nope. The world wants to know what Lara Bricker got arrested for. (Hint: it wasn't election fraud.) Looks like her accomplices left her holding the bag...literally.\nIn our audience feedback segment, the Crime Writers respond to a heartwarming email from a cancer survivor who's ready to take on the challenge of punching one of their least-favorite attorneys. \nThen, when it's time for business, the panel digs into the final episode of APM Reports' \"In the Dark.\" Madeleine Baran didn't pull punches when it came to the police narrative that Danny Heinrich was just too good at covering his tracks for 25+ years. But is her conclusion too broad? Unfair? (Sometimes investigators know who did it, but can't get enough to make the arrest - as officials have told Rebecca & Kevin about the Stacey Burns \"Mothers Day Murder\" case.)\nFinally, Rebecca, Kevin, Lara, and Toby offer up their recommendations about what you should be listening to, reading, and watching right now.\n\nCrime of the Week: When it comes to Halloween candy, someone can give you a break - you're just not supposed to steal it.\nThis week's sponsor is madison-reed.com - use the code \"writers\" at checkout!", "duration": "00:59:15", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/834a2e0f-28c0-4125-8f57-fd484289d96e.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1477625041, "title": "Adnan Syed's Bail Motion, Sarah Koenig's Serial Choices, Offshore's Big Splash", "author": "", "summary": "Heads up Baltimore City Court! Here comes Adnan Syed seeking a bail hearing. It's not your usual motion, written more like a campaign speech than a legal brief. \n\nThe Crime Writers dig into the latest in the efforts of Serial's protagonist to get out of prison now that his conviction has been vacated. \n\nAnd a journalism conundrum: IF Sarah Koenig knew about Jay Wild's post-Adnan criminal history, should she have included it in Serial?\n\nAlso, the panel hangs ten in Hawaii with the new podcast, \"Offshore\" from Honolulu Civil Beat and PRX. Can a white reporter do justice to a tale of Hawaiian culture and disenfranchisement? \n\nRelated: Toby recommends reading this article from the New Yorker, \"The American Raj,\" to learn more about Hawaiian history.\n\nIn our Crime of the Week, the panel shakes the tree. But who goes undercover as a tree, anyway? (Kevin reported on a similar bank robbery story in NH. Watch the version filed by his colleagues.)\n\nPlus: mystery solved! Who bought the family-sized bucket of massage lotion? We finally know. Finally.\n\nThis week's sponsors are:\n\nthegrommet.com/crimewriters\n\nmadison-reed.com (promo code \"writers\")", "duration": "01:18:49", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/078e82c4-aed1-4914-bf17-5e60196f2e7d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1477076428, "title": "A Triple True Crime Podcast Bonanza - Phoebe's Fall, Breakdown & In The Dark", "author": "", "summary": "Things get back to normal in the Crime Writers' world. They discuss the perils of doing bad accents and explain why they can't do audio book versions of their own books.\n\nA true crime update (add your own echo): Burke Ramsey has followed through on his threat to sue over the CBS special on his sister's murder. Looks like the case will focus on one comment from one person.\n\nThen the focus shifts to the new investigative podcast from Australia, \"Phoebe's Fall.\" We know that Phoebe Handsjuk dropped 12 stories down a garbage chute, crawled out, only to bleed to death from injuries from the trash compactor. Was it a suicide attempt? Was it a drunken misadventure? Or was it something more nefarious? So far, the Crime Writers have mixed opinions. \n\nFootnote: for another strange how-did-she-get-into-that situation, check out the case of a 21-year-old Chinese tourist who drowned in a hotel water tank.\n\nChecking in with some of the other leading true crime podcasts, in \"In The Dark\"'s penultimate episode, the Sterns County sheriff is confronted with their pitiful clearance rate. And the trial of Justin Ross Harris is finally underway in \"Breakdown.\"\n\nIn the Crime of the Week, don't block a driveway in Australia...even if it's your own. \n\nNEXT WEEK'S HOMEWORK: From PRX, the new Offshore podcast.\n\nFrom Partners in Crime Media: a new mystery podcast, \"The Disappearance Podcast.\" If you like \"The Black Tapes,\" and \"The Message,\" you'll want to download this one.\n\nThis week's sponsor is madison-reed.com/writers \n\nErrata sheet: The link for Grommet in last week's show was wrong. The correct link is www.TheGrommet.com/crimewriters.", "duration": "01:15:39", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/2d1ffe29-7d46-4fda-82ee-4129c2a5ff49.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1476494041, "title": "Amanda Knox - The Documentary And Case That Divides Us All", "author": "", "summary": "Oh no! We went there!\n\nThe Crime Writers discuss the controversial Netflix doc \"Amanda Knox.\" Why are we still intrigued by the murder case? Does any of the evidence add up? Is the motive believable? Is Knox herself credible? As she says, \"Either I am a psychopath in sheep's clothing or I am you.\"\n\nRebecca and Kevin welcome back Dr. Elizabeth Yardley to explain why the British have such a different (and more visceral) view of the case than Americans do. Could it be they were each seeing a different case in their papers and on their TV screens? \nBigger question: how bad are the writers going to get trolled on Twitter for their views? \n\nBecause it seems some people  - not everyone, but some -  feel really, really, REALLY strongly about this case and you better agree with them in 140 characters (or the 140 consecutive tweets with which they will flood your feed)! \n\nIn Crime of the Week...a SWAT team takes out an 81-year-old woman for growing a single marijuana plant. Good thing she wasn't stealing cable TV...she'd probably be dead. \n\nEpisode sponsors are : PrepDish.com/crimewriter - ModCloth.com (promo code crime) - the Havenly app (promo code crime) - and TheGrommet.com/crime", "duration": "01:20:45", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/68a2d08d-b013-437d-b44b-e1d35859d519.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1475884984, "title": "We Stand Accused ...of Loving the Podcast 'Accused'", "author": "", "summary": "Every couple of weeks, other podcast comes along and seems like the heir to \"Serial.\" Few live up to the anticipation. Is it possible that the Cincinnati Enquirer's \"Accused\" podcast has replicated the secret sauce: a truly compelling murder mystery and the transparent, obsessive reporting which goes into the story? It sure is.\n\nRebecca talks with Amber Hunt and Amanda Rossman about their year-long investigation into the 1978 Elizabeth Andes murder. If her acquitted boyfriend Bob Young didn't do it, than who did? \n\nNext, the Crime Writers dish on who was the biggest villain in the case: one of the four remaining suspects OR the prosecutor who dodged Amber for a year. (Spoiler alert: three quarters of the panel is REALLY down on Gmoser - and not just because the \"G\" is silent.)\n\nWe get a TRUE CRIME UPDATE from Lara about the official Army findings in the Bowe Bergdahl case. Were any servicemen killed looking for Bergdahl? The answer appears to be no...but then again, we don't really know what we're talking about.\n\nKevin sends out love to all who sponsored his Walk-a-Mile In her Shoes event; yes, he finally completed that mile-long course in high-heeled shoes. \n\nIn the Crime of the Week: A bucket list wish unlike any other. Grandma, Grandma, whatcha gonna do when they come for you?\n\nInterstitial music by Uncanny Valleys.\n\nEpisode sponsors are E-Salon - visit esalon.com/crime - and Prepdish - visit Prepdish.com/CrimeWriter", "duration": "01:25:41", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/e5d1d507-11a8-4a91-bd10-4154d19c9fe6.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1475269494, "title": "That JonBenet Ramsey Special - Yup, We Went There", "author": "", "summary": "The Crime Writers take on what's good - and what's *not* so good - about the The Case of JonBenet, the four-hour CBS special featuring profilers Jim Clemente and Laura Richards and an all-star cast of forensic investigators. We talk about the case, the show's WTF moments (THEY BUILT THE HOUSE??), and dive deep into the potential defamation of Burke Ramsey, who is (in the experts' opinions) a leading suspect in the cold case.\nWe also chat with Ann Bartow, a law professor at UNH Law School and expert on all things defamation and internet speech, and tie that conversation in with issues raised in this week's episode of the excellent In The Dark podcast. \nFinally, our crime of the week has Rebecca airing an old grudge with her favorite public radio host, Ira Glass.\nEpisode sponsors are the Havenly app (use promo code \"crime\") and Modcloth (also use promo code \"crime\") - and yes, we sometimes flub the ads, as you'll hear in the outtakes. \nInterstitial music by Blue Dot Sessions and Jahzzar. Support Kevin's walk for domestic violence victims in crisis at crimewriterson.com.", "duration": "01:12:01", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/75f01b41-0cf9-4547-a8f2-9131d7c1d379.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1474685721, "title": "In The Dark...as Usual", "author": "", "summary": "Now that the crime writers are all back in their closet studios after their awesome live show, they tackle the newest high-quality true crime podcast, \"In the Dark.\" It's like \"Someone Knows Something\"... if someone actually knew something.\nRebecca begins by talking with Madeleine Baran, APM Reports journalist and host of \"In The Dark.\" They  chat about Madeleine's year-long investigation on what went wrong during the investigation into the 1989 kidnapping of Jacob Wetterling.\nEven though the podcast kicked off days after Danny Heinrich confessed to killing Jacob 27 years ago, is there still a compelling story to tell? The panel ponders if a true crime podcast can still achieve excellence without the benefit of suspense.\nThen the Crime of the Week is not child's play. Or is it? Someone needs to go to jail, go directly to jail.\nAlso...Kevin is again doing his part to raise money for a local crisis center. He will \"Walk a Mile in Her Shoes\" and don some stilettos for this one-of-a-kind walk-a-thon. (Spoiler alert: he will likely twist both ankles.) If he raises enough money for his October 5 walk, Rebecca promises to stream every painful step on Facebook Live. Give a modest donation by going here: https://www.firstgiving.com/fundraiser/kevin-flynn-3/2016-walk-a-mile-in-her-shoes", "duration": "01:27:56", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/182e0e09-0f36-4c71-800e-bb5e488141e7.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1474004874, "title": "Live From The Mall: The Crime Writers Book Club Special", "author": "", "summary": "Yup, the Crime Writers went all in with a live show taping - there was even a real-life audience there to hear it! We talked about our summer book club pick, Laura Lippman's Wilde Lake. Toby also read an epic items list, we answered audience questions.\nA couple of notes:\n- Special thanks to the Hatbox Theatre in Concord, NH\n- Rebecca talks to author Laura Lippman from the 8:08 mark to about 21:00\n- Interstitial music was by the Blue Dot Sessions\n- Some audience questions had to be edited out because of audio quality\n- Rebecca would like to apologize to her Mom. Stay tuned for the outtakes and you'll know why", "duration": "01:12:31", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/d0dbeaf2-eff3-486f-bfbe-c89162f88f06.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1473393660, "title": "New Evidence in the 'Making A Murderer' Case? And Last Call for 'The Night Of'", "author": "", "summary": "We heard you missed us. But hey, we're back!\n\nAfter a semi-vacation over the summer, the crime writers are back weekly to talk about all things criminal - in real life and in pop culture.\n\nNews on the Steven Avery case continues to break. The new lawyer for the \"Making a Murderer\" subject has filed a petition to have evidence re-tested using the most modern (and most expensive) analysis currently available. She says the results will definitively prove Avery's innocence (or, she concedes, his guilt). Is doubling down on the police conspiracy theory Avery's best play?\nNow that HBO's limited series \"The Night Of\" has signed off, what does the panel make of it? Did the show live up to the high expectations set by episode one? Who's the hero? What does the ending mean? And why did Stone's eczema come back? These are questions the public demands answers to. (PS: If you want to skip past the discussion to remain \"unspoiled,\" skip from 35:47 to 58:36.)\n\nThe Crime of the Week is a cream pie to the face. Who's responsible for all the creepy-looking clowns popping up in neighborhoods throughout the Carolinas? Is it a sick criminal perpetrator or just a scary joke?", "duration": "01:09:04", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/9a437071-4928-4620-b5dd-948b178a2d3d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1471654993, "title": "Making a Murderer Brendan Dassey SHOCKER! Plus, Bergdahl Update & The Night Of Predictions", "author": "", "summary": "Another episode, another questionable murder conviction vacated.\nThe panel reacts to the news that a federal magistrate has vacated the conviction of Brendan Dassey, the accused accomplice in the Steven Avery \"Making a Murderer\" documentary.\nAlthough the public went nuts over what many perceived to be a coerced confession, it was something else the detectives did to the intellectually-challenged teen that violated his Sixth Amendment rights.\nMore true crime updates: why did a General burn letters related to \"Serial\" season 2 subject Bowe Bergdahl? And the man accused of killing Washington intern Chandra Levy is also walking out of prison.\nIs Naz breaking bad in \"On the Night Of\"? What is the audience supposed to think of main characters in the HBO limited series at this point?\nIn the Crime of the Week: POOPACALYPSE! \nP.S. Don't forget about the first Crime Writers On live podcast on September 6 at the Hatbox Theater in Concord, NH. We'll wrap up our summer book club, plus other surprises. (It's free to get in, but click here for so we can have an accurate head count!)\nP.P.S. What should Lara's Parrothead nickname be? If you have an idea, send us an email or email us a voice memo!", "duration": "01:19:19", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/8099cf09-593a-4c6e-ae95-1a8a3a335731.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1471017600, "title": "Sneak Preview - These Are Their Stories: A Law & Order Podcast", "author": "", "summary": "Just for fans of our show, here's a trailer for our spinoff, in which Kevin will talk with Rebecca and a special guest about their obsession with Law & Order, and break down the true crime cases behind ripped-from-the-headlines episodes of Law & Order, SVU, and Criminal Intent", "duration": "00:03:44", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/024c0beb-af48-43de-98b1-6e3edb96bbe7.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1470414090, "title": "Stranger Things, Serial Update(s) & Omar on The Night Of", "author": "", "summary": "Well, it took more than one try, but the Crime Writers are getting it done with a well-rehearsed discussion on Netflix's newest breakout hit, \"Stranger Things.\" It's like Stephen King and Steven Spielberg had a baby that was eight-episodes long. (Almost) no spoilers...except that it's freakin' awesome.\nWe also debut a brand new segment: the TRUE CRIME ROUND-UP!\n\nWe've got the latest on the Adnan Syed appeal and the Bowe Bergdahl court martial.\n\nThe panel's sharp eyes turn back to HBO's \"The Night Of.\" What was a straight murder mystery is now part prison story, part crime procedural. Half way through, is it losing focus or hitting its stride.\n\nALSO: Watch for details on the first Crime Writers On live podcast. (Click here for a sort-of RSVP!)\n\nWe'll wrap up our summer book club with an audience-participation discussion on Laura Lippman's Wilde Lake. We'll be at the the Hatbox Theater in Concord, NH September 6th. FREE ADMISSION. Surprises galore!", "duration": "01:13:04", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/c3e1f1a1-ec16-4a6d-aa66-588eb6b37929.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1469237973, "title": "HBO's The Night Of, DNA Shenanigans, A Serial Update & Rebecca's Big Win", "author": "", "summary": "It's been more than ten days. What's the latest on whether the state will appeal Judge Welch's decision to vacate Adnan Syed's conviction?\n\"The Night Of\" is sure to be \"the show of the summer.\" This moody, unsettling murder mystery is everything that \"True Detective, Season 2\" was not.\nThe Crime Writers talk about what makes this show stand out, whether the cops are playing fair with Naz, and WTF is up with John Turturro's feet.\nYou think juries can be swayed by faulty cell tower evidence, but how about something as sure-fire as DNA? We hear from science writer Chris Berdik about how DNA mixtures from a single sample are complicating the scientific process...and how the DNA used to convict some suspects is now being used to exonerate them.\n\nWinner, winner, chicken dinner! We'll announce which crime book you have chosen for the Crime Writers On first Summer Book Club. Use that Amazon link to buy your copy. We'll have a special interactive show to get your views and discuss our thoughts (bring your own white wine).\nGrab your smartphone for the Crime of the Week. People our out in the real world hunting for Pokémon and some are finding more than just Pikachus!", "duration": "01:21:54", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/1b42346e-e0c3-4dd1-8b4a-c0a117c62ef3.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1468034389, "title": "Serial Epilogue: Adnan Syed Gets a New Trial...Maybe", "author": "", "summary": "Ever since Sarah talked to Asia the world wondered whether she was the key to getting Adnan Syed a new trial. In the end, it was a single sentence in a pile of thousands of documents.\n\nThe result is in. Judge Welch has ruled Adnan's Sixth Amendment rights were violated and he'll get a new trial...if it ever gets that far. The Crime Writers pull apart the decision and discuss where the case may go from here. Does the state have any evidence left? How would 12 Baltimore jurors (who'd never listened to a podcast) size up Adnan? And why could it be years before he gets out of jail? \n\nThe panel is joined by super-professor Colin Miller, who answers questions about the legal ins-and-outs of the ruling. Then the Crime Writers take your questions and voice memos. They also discuss the dilemma of the Alford plea: would you admit your guilt to a crime you didn't commit if it gets you out of prison?  Also, WTF is a jury view like at the scene of a lumber theft?\n\nHere's something new: our first Crime Writers On Summer Book Club show. Each writer has nominated a book. You vote online, then we'll all read and share (bring your own white wine). The nominees are If I Did It by OJ Simpson, I am Pilgrim by Terry Hayes, People Who Eat Darkness by Richard Lloyd Parry, and Wilde Lake by Laura Lippman.\n\nIn the Crime of the Week, one of our listeners makes a marital confession...\n#Serial #SerialSeasonOne #AdnanSyed #Undisclosed", "duration": "01:16:06", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/1c3bca59-e69a-474b-a069-90c6aaee7efe.mp3", "type": "episode", "tags": ["serial", "adnansyed", "undisclosed", "serialseasonone", "true crime", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1467324790, "title": "Quick Tease: Serial Subject Adnan Syed Gets a New Trial", "author": "", "summary": "Rebecca and Kevin give their quick thoughts on the breaking news of Adnan's Syed's being granted a new trial. We'll be talking about the case in our episode dropping July 9th,  so we're asking you to send your questions, comments, and thoughts in an email or a voice memo to crimewriterson@gmail.com. You can learn how to send a voice memo on the blog section of our website, http://www.crimewriterson.com/", "duration": "00:03:24", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b5763407-f2d9-42cf-bd30-f69c49588c7c.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1466740860, "title": "OJ: Made in America, Adnan Syed: Made for TV", "author": "", "summary": "We've spent a lot of time with the boob tube (ahem) so far this summer. This episode, the Crime Writers take out their ear buds and tune in to some of the season's most talked about television.\n\nThe Adnan Syed case finally gets the prime-time treatment on Investigation Discovery. For crime fans who can't figure out how to download a podcast, or those who only know the tale from hearing it at the water cooler, this hour-long special provides an overview of Serial's season one case. But for those who've spent hours and hours devouring minutia about the crime (I'm looking at you cell tower L689!), is there anything in this show for us?\n\nAND - Though you'd think we'd all have had enough of that former Bills running back, especially after the superior drama \"The People vs OJ Simpson,\" ESPN's ambitious documentary may prove you can't get enough of a good thing - if it's a good thing. And \"OJ: Made In America\" is 450 minutes of a good thing. Race, sex, celebrity...this is why it was the Crime of the Century - and the Crime Writers dive right in.\n\nAlso - did the crime writers make the same mistake with \"Reply All\" that the jury made with Paul Modrowski? And we're going for the gold with the Crime of the Week.\n\n#Serial #AdnanSyed #OJMadeInAmerica", "duration": "01:21:15", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b20f9929-c459-436e-a91c-a12837b87439.mp3", "type": "episode", "tags": ["serial", "adnansyed", "ojmadeinamerica", "true crime", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1465617660, "title": "Reply All Does True Crime & Shines Bright Like King Diamond", "author": "", "summary": "Who thought we'd see Serial reborn in a podcast about the internet? Reply All's Sruthi Pinnamaneni brings us a four-part story about an inmate, his blog, the shifty characters associated with his crime, a flimsy evidence and nutty trial, and then - woah! - that final jailhouse interview! It's the podcast that has everyone asking, \"Who the eff is King Diamond?\"\n\nIn this episode, we'll hear from Sruthi about what went into creating the world's latest must-listen-to podcast. Then the panel will give their two-cents on the case and whether Sruthi is the one who finally stuck the landing.\n\nThere's also a correction or two. The song says \"Don't you forget about me,\" but we might have forgotten about them.\n\nFinally, you'll be repeating the Crime of the Week over and over again.\n\nAlso...can't get enough wisdom and insight from the incarcerated? Here are some blogs written by inmates, for future inmates (...if you're not careful).\n\nOn the Inside - Paul Modrowski's blog, edited by his mother, that started Reply All's four-episode profile of Paul and his case.\n\nBetween the Bars - a blog platform for prisoners in the US without internet access, done through MIT.\n\nLive from Lockdown - a blog written by various inmates in the federal prison system, including highly influential gang-leaders and those held in solitary confinement.\n\nBen's Prison Blog - written by Ben Gunn, imprisoned in Sudbury (HM Prison), Derbyshire, England, 2009–2012. Since his release, Ben has continued his blog.\n\nLastly, for those looking for deeper meaning, here's King Diamond's song, \"No Presents for Christmas.\"\n\nAdditional music this episode provided by Uncanny Valleys.", "duration": "01:21:08", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/61fbb612-0eda-454f-8e08-65c913b8df8b.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1464408061, "title": "Two And A Half Crime Writers (AKA The One Where We Chat With Jon Cryer!)", "author": "", "summary": "Why the heck would mega TV and movie star Jon Cryer agree to be on our little podcast? Because he's a fan, dammit! It also turns out that he's a HUGE fan of true crime, including many of the podcasts we've talked about, like Serial and Undisclosed.\n\nBut does the artist formerly known as Duckie qualify as a crime writer? YES! (Sort of.) He's got a hilarious memoir, So That Happened, in which he explains his crime scene-rich formative years, including the shooting of his hooker-loving, soup-making next door neighbor. \n\nSo yeah, that happened. We talked to Jon Cryer. And yes, he DID spill the beans on being in Pretty in Pink, the weird antics of Charlie Sheen, and serving on jury duty (more than once!)\n\nPlus, our Crime of the Week tackles the question...of all the child/teen actors you used to love, which one does the panel most which would make a comeback?", "duration": "01:00:18", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/f38fa5fc-8e9d-4fd7-9447-5ea97badfc72.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1463803261, "title": "Bowraville - The Podcast From A Land Down Under", "author": "", "summary": "This week, the panel talks about Bowraville, the true crime podcast created by The Australian newspaper. (Scroll down to listen!) Rebecca also connects with Dan Box, the Brit-turned-Aussie who reported the story, and asks, why is your newspaper being called the \"unlikely hero\" of this never-solved serial murder case? (A hint...it has a little something to do with Rupert Murdoch!)\n\nAlso, we tackle some listener queries, and play a voice memo simply because one of you asked us to. As for the crime of the week? Let's just say it puts a new twist on the trustworthiness of babysitters.", "duration": "01:13:50", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/1d893c17-5725-4217-8cd7-67f2acc10770.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1463198460, "title": "Bowe Bergdahl's Court Win & The SWAT Team Controversy", "author": "", "summary": "When news broke last week that Bowe Bergdahl's legal team had scored a victory in his case, we weren't sure we understood exactly what happened. So, Kevin reached out to our trusty military legal eagle James Weirick for a quick run-down. As a bonus, we get confirmation that Weirick is, in fact, the manliest man to ever man-up.\nAlso, the PBS documentary Peace Officer hooked us in but also left us with some questions. As we tackle those, we also wonder, WTF is our local PD doing with a tank?\n(BTW, you can find out what we're going to be talking about before our episodes drop if you sign up for our newsletter! You can do that right here.)\nPlus, Lara gets corrected correctly, we answer a couple of listener inquiries, and the Crime of the Week posits...is it EVER too late to hand out some justice?\nLINKS:\n\"The Coldest Cut\" article by Kevin & Rebecca\nRadley Balko's Washington Post blog: The Watch\nAMC/Netflix's crime drama \"The Killing\"\nCrime of the Week: 71 year old fugitive caught 50 years after his escape.", "duration": "00:58:10", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/51dd57de-d8df-469e-8ed8-c2cbb6b531ea.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1462594050, "title": "Breakdown's Breakdown and British Crime's Dark Side", "author": "", "summary": "Just when we were getting ready to see how Justin Ross Harris's trial in the baby-in-the-hot-car homicide would play out, a twist no one saw coming. This means an unexpected hiatus for the \"Breakdown\" podcast and questions about media influence on the justice system.\n\nWe get to know Dr. Elizabeth Yardley, a criminologist at Birmingham City University in England. She's studied how Serial fans used Reddit to interact with Hae's and Adnan's families, as well as look at the digital fingerprints criminals are leaving on social media. Plus, we talk about what British audiences like when it comes to crime drama.\n\nWe should have seeing the signs in the Crime of the Week. One NY mayor helped his village's street department out by taking home some \"office supplies\" from this day job.", "duration": "01:07:35", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/28ab0ae8-3512-4d21-9f24-bad174a7d4e1.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1462012608, "title": "These Are Their Stories: A Very Special Law & Order Special", "author": "", "summary": "Kevin and Rebecca are joined by two very special guests to discuss Law & Order: \"Original Recipe,\" AKA, the first series in the juggernaut franchise that's been on the air for nearly three decades.\n\nThe panel talks about what makes Law & Order so compelling, their favorite characters, the weird writing tropes of the Law & Order universe, and a lightning round that pits Jerry Orbach against Dennis Farina, and Jill Hennessy against Angie Harmon.\n\nEpisode links at CrimeWritersOn.com:\n\nMeet our brand new special guest panelist Brady Carlson and read his book, Dead Presidents\n\nRebecca talked about a study that looked at views of law enforcement through the lens of Law & Order. Here's an article about that. \n\nAnd, you can see Brady Carlson's Happy Birthday photo signed by Jerry Orbach,", "duration": "01:15:06", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b8d3f9f1-f5d9-422f-bb64-f3d63257770d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1461384060, "title": "S2 Ep 13: Endings are Important! Plus, Our Podcast & Media Picks", "author": "", "summary": "The crime writers respond to a listener's very British rant about the critical nature of endings in a good story, talk about what TV shows totally failed at the end, and settle a long-term marital dispute that's been tearing Kevin and Rebecca apart.\n\nPlus, the Crime of the Week delves in to Australia's long national nightmare and reveals that there's a killer living with one of the panel! Watch out, Toby!!!\n\nFor a list of media picks links, visit our episode page at crimewriterson.com", "duration": "01:07:14", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/1870de62-2bc4-41f9-bc23-735c19660bca.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1460779868, "title": "S2 Ep 12: Does Someone Know Something? Damned if We Know.", "author": "", "summary": "The Crime Writers talk about another true crime podcast, Someone Knows Something, the Canadian-crafted cold case show that's holding firm on the charts. Rebecca also checks in with the show's creator and host, David Ridgen.\n\nAlso, we talk about the kerfluffle over Asia McClain's book announcement,  find out what celebrity Toby most resembles and ask him, \"Why oh why did you leave your sister hanging?\"\n\nThen, the gang answers a few listener questions before going on to the Crime of the Week which delves into the gang's vanity...and crippling insecurity.", "duration": "01:04:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/81caaccd-046d-426b-be47-e0c1107c45ff.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1460222528, "title": "S2 Ep 11.5: The People Vs. Serial Season 2 - Was OJ The Better-Told Story?", "author": "", "summary": "The Crime Writers welcome very special guest Lt. Col (R) James Weirick on board to talk about the art of storytelling, and whether Serial delivered on the big promises it made in season 2.\n\nWe also take apart the storycraft behind The People Vs. OJ Simpson, and how the cast, the plot frame, and even the casting of Ross as Robert Kardashian affected that show's arc.\n\nPlus, we listen to some pithy listener voice memos and tackle a juvenile crime of the week. \n\nA special thanks to classy-voiced British journalist Emma Finamore for reading some of the items our listeners from across the pond purchased on Amazon UK! \n\nLinks on crimewriterson.com :\n\nHere's the article Toby mentioned in which the courtroom sketch artist compares the actors' portrayals to the real people in the OJ Simpson case.\n\nWhat's on Weirick's Netflix list? Here you go:\n\n1. Bronson\n\n2. H.H. Holmes, America's First Serial Killer\n\n3. Carl Panzram, The Spirit of Hatred and Vengeance\n\n4. Punch-Drunk Love\n\n5. Mirage Men\n\nCrime of the Week link:\n\nRead the Orange Street News, the greatest newspaper ever written by a kid.", "duration": "01:24:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/163fc510-e4bd-4ff9-9698-01fa3ada582d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1459569661, "title": "S2 Ep 11: Reporting For The End (of Serial Season 2)", "author": "", "summary": "After eleven episodes, Sarah and team tapped out of season two. In \"Present for Duty,\" the Serial squad does some solid enterprise reporting into whether anyone was actually killed or wounded in efforts to recover Bowe.\n\nWhile saving judgement on the season as a whole until next week, the panel breaks down the series finale. Did Ken Wolf's declaration make a difference in the minds of those who want the maximum punishment for Bowe Bergdahl? Do the fates of Jimmy Hatch and Matt Allen make it harder to forgive Bowe for his actions?\n\nThe Crime of Week is a shocker! A NC man gets arrested because of an overdue video rental. Please be kind and rewind. Links:\n\nHere's more on the case that Lara mentioned of the guy who gave a whole of people Hepatitis\n\nAnd here are two links (one and two) about the research into brain wiring of liberals and conservatives - something Rebecca mentioned in the show", "duration": "01:14:35", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/e653665f-d148-48f0-93b1-daa72d7e56e5.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1458995401, "title": "S2 Ep 10.5: JAGged Little Pill, Your Questions, & A People Vs. OJ Breakdown", "author": "", "summary": "It's yet another a super long episode! (Sorry about that.)\n\nBut hey, at least there are t-shirts you guys can buy. Here's the link to those. \n\nFor civilians, is there something about Serial Season 2 that neither we nor Sarah fundamentally get?\n\nRebecca and Kevin have a talk with JAG Lt Col James Weirick (ret), one of the hosts of the Task and Purpose Radio podcast. Weirick shares his take on Bowe, how the legal case against him is playing out, and what military listeners are saying about Serial Season 2. He also confesses to stalking Sarah Keonig in a \"non-criminal\" way.\n\nWe also answer a few listener questions (including one from Michael Jackson's old house!) and Kevin makes yet another terrible transition into our sponsor's ads. There's also a meaty discussion about our latest TV obsession, \"The People vs OJ Simpson.\" What started as a cheesy, escapist miniseries has become a riveting character study - and maybe a feminist manifesto?.\n\nSo a guy walks into a sushi bar with a giant snake.  And he says, \"This sounds like it could be the Crime of Week.\" Let the good times maki roll. \n\nJames Weirick's webpage\n\nTask & Purpose website (podcast)", "duration": "01:27:59", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/09234f1f-2d28-4836-b893-51aa56e5ed67.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1458360060, "title": "S2 Ep 10: We Never Promised You A Rose Garden - Serial Season 2", "author": "", "summary": "The Crime Writers dissect almost every aspect of Serial, Season 2, Episode 10, \"Thorny Politics.\" It gets so deep that Rebecca feels the need to include extra out-takes for comic relief.\n\nPlus, Kevin explains what a \"news fixer\" is and makes a better-than-last-week transition into our ads, Rebecca asks whether or not public radio reporters are SO committed to journalistic neutrality that they only talk to Republicans, we hear what a traffic report in New Hampshire would have sounded like a decade ago, and the panel discusses a Crime of the Week designed for the twenty-five percent.\n\nRelated:\n\nHere's the New York Times article that gets mentioned about twelve times during this episode\n\nAn Atlantic story about news fixers and how they manipulate which crimes you actually hear about on network TV\n\nRebecca mentioned this reddit thread in which a user made a comment about Sarah Koenig's use of sources and reporters' fears of being seen as \"liberal shills\"", "duration": "01:12:37", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/dad0e4a5-1e7d-4cb0-b0c6-80205b7f5622.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1457760937, "title": "S2 Ep 9.5: Ruff Week, Trumping Bowe, OJ on the Side, & Downton's Downturn", "author": "", "summary": "The Crime Writers talk about why it's not a good idea to say you think someone committed a murder in public and also  cover some new developments around Bowe Bergdahl media projects and his lawyer's request to interview Donald Trump.\n\nPlus,  there are some silly ads, and after those, a discussion about The People Versus O.J. Simpson and that Downton Abbey finale, which Toby has a whole lot of opinions about. \n\nAlso, the Crime of the Week gives Kevin a case of the 'Green Apple Splatters.'", "duration": "01:08:32", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/a5b1017a-de1c-4761-9c64-ff94775c0347.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1457203750, "title": "S2 Ep 9: Trade...Ahem...Secrets - Serial Season 2", "author": "", "summary": "The Crime Writers zoom all around a huge episode of Serial in which Sarah unpacks the attempts at diplomacy that led (and didn't lead) to Bowe Bergdahl's release. \n\nAlso, we talk about that mysterious throat clearing incident, beg our listeners to start watching The Grinder, and frame a whole episode around what you thought we should talk about. Plus, THAT KNIFE FOUND AT OJ SIMPSON'S HOUSE!!! \n#serial #serialseason2 #OJSimpson", "duration": "01:02:57", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/81949351-c4e6-4aa4-bae2-66a30653f232.mp3", "type": "episode", "tags": ["serial", "serialseason2", "ojsimpson", "true crime", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1456597642, "title": "S2 Ep 8.5: Bowe's Brain, Loose Story Threads, & Listener Questions - Serial Season 2", "author": "", "summary": "The Crime Writers pick at some loose threads from Serial's recent episodes, and talk with an actual expert on about how Bowe's personality disorder may have led to his walking away but also helped him cope with five years in captivity. Plus, Toby's away! But we have an able-bodied PT Stud sitting in his place, reporter and Outside/In podcast host Sam Evans-Brown. Also, the Crime of the Week puts the Crime Writers on the spot when it comes to internet sleuthing.", "duration": "01:07:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/3f43c290-fa6a-4897-bd59-2886b7216aa0.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1456004052, "title": "S2 Ep7/8: Hindsight, in Two Episodes - Serial Season 2", "author": "", "summary": "The Crime Writers dissect the most interesting aspects of this week's 2-part Serial Season 2 release, 'Hindsight.' Highlights include Rebecca's unprecedented disagreement with Sarah Koenig, Toby's astute analysis of \"slippery slope,\" the over-use of the word \"hippie,\" and the beginning of a feline face-off.\nPlus, the Crime of the Week - and a special surprise we've all been waiting for right in the middle of the episode. #Serial", "duration": "01:12:15", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/03245975-f824-45cd-9026-be67066cc0b0.mp3", "type": "episode", "tags": ["serial", "true crime", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1455393064, "title": "S2 Ep 6.5 Megasode: Making a Murderer's 'Silver Fox', Adnan Syed's PCR Wrap, Bowe's Brain, & The People Vs. O.J. Simpson", "author": "", "summary": "Rebecca's dream comes true as she gets the chance to chat with Making a Murderer's breakout press-pool guy Aaron Keller. Well, it would have been her dream come true if Kevin hadn't tagged along.\n\nAnyway, the Crime Writers also talk about how Adnan Syed's PCR hearing wrapped up, dive into reactions about their Bowe Bergdahl Autism speculations, talk about their initial impressions of 'The People v. OJ Simpson' on FX, and tackle yet another compelling Crime of the Week. Plus, a listener clears up a mystery sparked by Toby's misread of one of those Amazon items.\n\nBOOK LAUNCH: Kevin and Rebecca are having a book launch party for their newest title, Dark Heart, on March 3, 2016. They'd like you to join them at Gibson's Bookstore, S Main St, Concord NH at 5:30.", "duration": "01:36:46", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/2ef27b49-662d-4b34-902b-6c977cc62f86.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1454790129, "title": "S2 Ep6: Adnan's Hearing & Bowe's 5 O'Clock Shadow - Serial Season 2 (and 1!)", "author": "", "summary": "The Crime Writers take on Sarah Koenig's  phoned-in updates on Adnan Syed's PCR hearing and try to solve the mystery of why she's staying in a hotel that provides animal-print bathrobes. Plus, we dissect Serial Season 2 Episode 6: 5 O'Clock Shadow, tell our best NH Primary stories,  and dig in to the Crime of the Week.", "duration": "01:13:51", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b8de3754-13d7-472c-bb0c-e9645e0d8e70.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1454132784, "title": "S2 Ep 5.5 Mega Show: Kratz's Book, Your Questions, & The Black Tapes - Tanis Guys", "author": "", "summary": "The Crime Writers discuss Ken Kratz's book and Making a Murderer fatigue. answer listener questions and give their own  podcast and TV recommendations. Also, Rebecca talks to the guys who make Tanis and The Black Tapes Podcast! It's pretty epic.", "duration": "01:23:19", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/3bc6a1fd-639f-47f6-a4c1-743e9f18ce5e.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1453572349, "title": "S2 Ep5: We Zoomed! To Tampa! - Serial Season 2", "author": "", "summary": "We talk all about Serial's episode 'Meanwhile, In Tampa.' We also get the lowdown on how Lara would commit murder, hear more on why Rebecca's convinced Obama might show up on Serial, and find out why Toby can relate to a Super Soldier. Plus, Kevin gives an inappropriate response to the Crime of the Week.", "duration": "01:03:27", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/e70c9f6d-1936-487e-b1b3-1c2c4be7e180.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1452968678, "title": "S2 Ep4.5: Sarah Pauses, Colin Ponders,  & Nancy Interrupts", "author": "", "summary": "We talk about Sarah Koenig's big announcement about Serial going biweekly and return to our dissection of the Netflix series \"Making a Murderer.\" Colin Miller makes an appearance, and Toby watches Nancy Grace for the first time - it's pretty traumatic. Plus, we answer some listener questions and talk about the Crime of the Week!", "duration": "01:10:29", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/251d90a4-81ee-47c2-8536-3c3c1f916bb5.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1452378657, "title": "S2 Ep4: Making a Murderer is Still Our Captor...So is Serial Season 2", "author": "", "summary": "The gang talks some more about the Netflix hit documentary series \"Making a Murderer,\" and then chats about Serial's \"Captors.\" Also, Rebecca makes the case for \"Poorfluenza,\" Jon Cryer humiliates Kevin, someone barely tolerates Toby, and Lara learns about the supernatural powers of asparagus.", "duration": "01:10:11", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/4e38b9ba-82b1-4cb6-ae3f-9bfd6bb1441e.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1451762132, "title": "S2 Ep3.5: Bonus - We Talk About 'Making a Murderer' from Netflix", "author": "", "summary": "The Crime Writers talk about the 10-part true crime series \"Making a Murderer\" from Netflix. Lara loses her mind over the ethics of Dassey's defense, Toby is skeptical but sympathetic, Rebecca goes out on a limb, and Kevin gives his wife a terrible anniversary card. Plus, the Crime of the Week!", "duration": "01:15:40", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/a6267875-2fed-40a6-a256-b22275bda43a.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1451249687, "title": "S2 Ep3: The Escaping Clause - Serial Season 2", "author": "", "summary": "The Crime Writers discuss every aspect of Episode 3 of Serial, including Bowe Bergdahl's twin escape attempts, those propaganda videos, and Bowe's cool affect when recounting his captivity. Also, Lara has a big theory, Toby talks about Mad Dog 20/20, and Kevin makes a confession. Plus, the Crime of the Week!", "duration": "01:00:40", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/a0953026-e39a-46bd-a725-c30d53cf1c93.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1450575029, "title": "S2 Ep2: Why Did the Golden Chicken Cross the Road? - Serial Season 2", "author": "", "summary": "The Crime Writers dissect every aspect of Serial Season 2 Episode 2, \"The Golden Chicken,\" and it gets pretty heated. Also, Rebecca is afraid of being accidentally racist, Toby and Kevin disagree on a bunch of stuff, and Lara didn't bring cheesecake. But harmony is restored by our Crime of the Week.", "duration": "01:03:19", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/87d42235-ff11-43ae-8a63-a0d95ba187d2.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1449956454, "title": "S2 Ep1: DUSTWUN in the Wind - Serial Season 2", "author": "", "summary": "The Crime Writers dissect every aspect of Serial Season 2's first episode and bring back Rebecca's favorite part of the show, the Crime of the Week. Also, Kevin forgets something pretty important!", "duration": "00:55:47", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/7aa9c281-e515-4647-8d64-9082a30af0cb.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1449771663, "title": "Season 2 Teaser - Serial's Back...And We Are, Too!", "author": "", "summary": "Rebecca reveals the details behind the premiere of Crime Writers On... Season 2.", "duration": "00:00:50", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/81fa17b6-f48a-41c4-864e-66faedd6787c.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1443996676, "title": "Serial Season 2, Limetown, Dishing Maura Murray", "author": "", "summary": "Rebecca, Kevin, Toby and Laura talk about the possibility of Sgt. Bowe Bergdahl's story as the focus of season two of Serial. Rebecca also interviews the guys behind Missing Maura Murray, a podcast that has the rest of the panel up in arms. Plus, the Crime Writers dish on the surprise hit Limetown and dissect the latest 'Crime of the Week.'", "duration": "01:07:26", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/146b221e-f67a-409d-b1d1-7d70fb59289c.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1438749583, "title": "WTF, True Detective? Plus, We Answer Your Questions!", "author": "", "summary": "We get the world (and TV series) we deserve.\nIn this episode, we ask if \"Undisclosed\" has anything left to disclose and whether the new season of \"True Detective\" has lived up to the hype (spoiler alert: it hasn't). Is Sarah Koenig taking notes on how disappointing a second season can be?\nWe also take your email, Facebook and Twitter questions - and Kevin explains the difference between \"a nice deal\" and just \"a deal.\"\nWe also make some awesome TV recommendations, and Toby's has the rest of us doing a spit-take.\nPlus...the latest installment of the Crime of the Week!", "duration": "01:02:35", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/20014a35-d4ed-40b0-91fd-cbd11d26b284.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1434756572, "title": "Lividity, Brian Williams, and Book Picks", "author": "", "summary": "Rebecca and the panel talk about the possibilities for Serial seasons two and three. Will Sarah K. and company have the same success without a murder mystery to solve?\nNext, with Rebecca lending technical assistance to the \"Undisclosed\" podcast, Kevin takes over and quizzes Lara and Toby about developments on that show. Forget \"tap, tap, tap\"...isn't the livdity evidence the biggest reveal?\nThe crime writers give their summer reading picks in the areas of true crime, mystery, and seasonal must-read. They also talk about journalism, including Brian Williams' dubious comeback.\nAnd our monthly \"Crime of the Week\" (see what we did there?) tracks down those daring escapees from that NY prison. Note to convicts: don't go to Lara's aunt's house.\n\n\nCrime Writers On...Summer Reading:Rebecca:\ntrue crime: Lost Girls by Robert Kolker\nmystery/thriller: Dare Me and The Fever both by Megan Abbot\nother: The Vaults by Toby Ball (who's that?)\nKevin:\ntrue crime: The Onion Field by Joseph Wambaugh\nMystery/thriller: Drizzled with Death by Jessie Crockett\nOther: Go Set a Watchman by Harper Lee\nLara:\ntrue crime: The Corpse Had a Familiar Face by Edna Buchnan\nmystery/thriller: The Light in the Ruins by Chris Bohjalian\nother: Animal Vegetable Miracle by Barbara Kingsolver\nToby:\ntrue crime: People Who Eat Darkness by Richard Lloyd Parry\nmystery/thriller: A Place of Execution by Val McDermid\nother: The Financial Lives of Poets by Jess Walter", "duration": "00:58:18", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/d17ebaaf-6647-432e-abc7-2019443e266e.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1431563076, "title": "Podcastception! Full Disclosure On 'Undisclosed.'", "author": "", "summary": "Rebecca and the panel talk about the podcast 'Undisclosed,' which features Rabia Chaudry, Colin Miller, and Susan Simpson talking about the evidence and developments in Adnan's case. \nAfter that, Rebecca asks Lara to intervene in a spousal writing spat, Toby gets WAY personal, and Kevin defends his hero. There's also a question from an awesomely fanatic listener (scroll down to see it!)\nRebecca also forces the panel to continue her ridiculous \"Crime of the Week\" segment. \n\n\nRelated links:\nThe video question sent to us by a fan on Twitter! We edited it for the podcast, so here's the full version:\n@reblavoie @undisclosed @CrimeWritersOn I'd like someone to talk about the Adnan I'm-gonna-kill letter. See video https://t.co/fr8EkUKP4F\n— Brendan M. Kenny (@KennyBrendan) May 13, 2015\nHere's the letter he's talking about:\nHae Min Lee's November Breakup NoteWe mentioned the construction taking place over at UNH's journalism building...here's a photo tweeted by Lara Bricker:\n@TobyBallNH doesn't let a little construction stop taping of Crime Writers on Serial @reblavoie @kevinpflynn pic.twitter.com/kqmV4nXSq1\n— Lara Bricker (@LaraBricker) May 13, 2015\nIf you have a question you'd like us to answer, send us an email, find us on Twitter, or leave a comment on this post. \nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! \nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!", "duration": "00:51:32", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/9f8d5150-4179-4d5d-8dc1-5805d229505d.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1428095844, "title": "House of Rabia and Scientology", "author": "", "summary": "Rebecca talks with Rabia Chaudry, the person who started this whole thing by bringing Adnan's case to Sarah Koenig. \nAfter that, Rebecca and Kevin, along with fellow crime writers Lara Bricker and Toby Ball, talk about the interview and about the HBO Scientology documentary Going Clear. \nRebecca also forces the panel to continue her ridiculous \"Crime of the Week\" segment. \n\n\n\nIf you have a question you'd like us to answer, send us an email, or leave a comment on this post. \nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! \nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!", "duration": "01:12:25", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/87af2bf1-3457-4c07-a514-835b07ce7c01.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1426556447, "title": "JINXED! We talk about The Jinx & The Staircase", "author": "", "summary": "Rebecca and Kevin invite fellow crime writers Lara Bricker and Toby Ball to talk a little bit about Serial, and a WHOLE LOT about The Jinx and The Staircase. If you haven't watched them and you hate spoilers, you will hate this episode!\nRebecca also forces the panel to continue her ridiculous \"Crime of the Week\" segment. \nIf you have a question you'd like us to answer, send us an email, or leave a comment on this post. \nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! \nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!\n\n\nLinks to stuff we talk about:\nIn this episode, Rebecca mentions some of the coverage of the production timeline of The Jinx, including this story from Gawker.", "duration": "00:48:03", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/5eb9efdc-7395-4a0d-8c09-38c1e6a4642c.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1422039633, "title": "No One Puts Asia in a Corner!!! Urick, that affidavit & Natasha's drama", "author": "", "summary": "Rebecca and Kevin invite fellow crime writers Lara Bricker and Toby Ball to talk about Serial prosecutor Kevin Urick's Intercept interview, the drama surrounding Natasha Vargas-Cooper's Intercept pieces, and that new affidavit from Asia McClain. \nWe also respond to questions and comments from you and debut our new \"Crime of the week\" segment. If you have a question you'd like us to answer, send us an email, or leave a comment on this post. \nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! \nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!\n\n\n\nLinks to stuff we mention in the episode:\nIn reaction to the omission of Urick's quote in Part 1 of his Intercept interview, Toby talks about an infamous incident in which President Clinton was misquoted about climate change. \nWhen the gang talks about evidence and the state's case, Rebecca mentions attorney Susan Simpson's excellent Serial blog, which you can find right here. \nYou can also hear Urick's recent interview on Sirius Satellite Radio here.", "duration": "00:49:58", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b95a2161-66c6-490a-9ed5-b538329d223f.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1420423664, "title": "O...M...Jay!!! We talk about that interview.", "author": "", "summary": "Rebecca and Kevin invite special guests and fellow crime writers Lara Bricker and Toby Ball to talk about Jay's interview with The Intercept and the discussion/debate that's followed.\nWe also talk about the intellectual guilt of true crime lovers, and Lara's theory that this story is more steeped in drugs than we've been led to believe. Also, Toby plays devil's advocate, and a reddit user gets a big shout out for this thread.\nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! \nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!\n\n\nDuring this episode, we discuss how The Intercept's Natasha Vargas-Cooper landed the interview with Jay. You can find more on that in this New York Observer story.\nWho's Who in 'Crime Writers on Serial':\nRebecca Lavoie is a public radio digital director and radio producer and the co-author of three mass-market true crime books. If you’re flipping through the more obscure channels on your cable lineup late at night, you might see Rebecca talking about crime on one of those docu-journalism TV shows…you know, the kind with names like Deadly Women and Deadly Sins. \nKevin Flynn is Rebecca's real-life partner in crime and her co-author. Kevin was a long time TV reporter before jumping into crime writing with his first book about serial killer Sheila LaBarre, You can also hear Kevin talking about that case on this episode of the excellent crime podcast Criminal. Among the books Kevin and Rebecca have written together is Our Little Secret, which they discuss in the episode about \"Rumors.\"  \nSpecial guest panelists:\nLara Bricker is a long-time reporter, freelance writer and the author of the true crime book Lie After Lie. She has also worked as a private detective and a criminal defense investigator. \nToby Ball is  the author of Invisible Streets and other works of noir and crime fiction. He also works at the Crimes against Children Research Center at the University of New Hampshire.", "duration": "00:49:14", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/6b2c6753-dfd1-4f54-a5d0-4cfd52b98cea.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1419379340, "title": "Bonus Episode: Season One's Best Moments", "author": "", "summary": "Rebecca and Kevin invite special guests and fellow crime writers Lara Bricker and Toby Ball to talk about their favorite moments from Serial: Season One. It's a little bit listicle, and just a little bit like those \"very special\" clips show they used to make on 80's sitcoms.\nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review! And if you want to add your two cents about the best bits from Season 1 of Serial, leave a comment below.\nWant to support this independently produced podcast so we can make more episodes? Click the donate button on our home page, and thanks!\n\n\nWho's Who in 'Crime Writers on Serial':\nRebecca Lavoie is a public radio digital director and radio producer and the co-author of three mass-market true crime books. If you’re flipping through the more obscure channels on your cable lineup late at night, you might see Rebecca talking about crime on one of those docu-journalism TV shows…you know, the kind with names like Deadly Women and Deadly Sins. \nKevin Flynn is Rebecca's real-life partner in crime and her co-author. Kevin was a long time TV reporter before jumping into crime writing with his first book about serial killer Sheila LaBarre, You can also hear Kevin talking about that case on this episode of the excellent crime podcast Criminal. Among the books Kevin and Rebecca have written together is Our Little Secret, which they discuss in the episode about \"Rumors.\"  \nSpecial guest panelists:\nLara Bricker is a long-time reporter, freelance writer and the author of the true crime book Lie After Lie. She has also worked as a private detective and a criminal defense investigator. \nToby Ball is  the author of Invisible Streets and other works of noir and crime fiction. He also works at the Crimes against Children Research Center at the University of New Hampshire.", "duration": "00:34:45", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/312fc07f-cf72-4170-8cd0-5306e6af743f.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1419015170, "title": "Episode 12 Discussion: \"What We Know\"", "author": "", "summary": "Rebecca and Kevin invite special guests and fellow crime writers Lara Bricker and Toby Ball to talk about the finale episode of Serial: What We Know. It gets pretty meaty, guys.\nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review!\nBy the way, at the end of the episode, Rebecca references this interview with Sarah Koenig on NPR.\nWant to make a donation to help support the continued production of this podcast? Click the donate button on our home page!\n\n\n\nWho's Who in 'Crime Writers on Serial':\nRebecca Lavoie is a public radio digital director and radio producer and the co-author of three mass-market true crime books. If you’re flipping through the more obscure channels on your cable lineup late at night, you might see Rebecca talking about crime on one of those docu-journalism TV shows…you know, the kind with names like Deadly Women and Deadly Sins. \nKevin Flynn is Rebecca's real-life partner in crime and her co-author. Kevin was a long time TV reporter before jumping into crime writing with his first book about serial killer Sheila LaBarre, You can also hear Kevin talking about that case on this episode of the excellent crime podcast Criminal. Among the books Kevin and Rebecca have written together is Our Little Secret, which they discuss in the episode about \"Rumors.\"  \nSpecial guest panelists:\nLara Bricker is a long-time reporter, freelance writer and the author of the true crime book Lie After Lie. She has also worked as a private detective and a criminal defense investigator. \nToby Ball is  the author of Invisible Streets and other works of noir and crime fiction. He also works at the Crimes against Children Research Center at the University of New Hampshire.", "duration": "00:50:52", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/46bcd5b0-17cd-49e8-a09a-6507809b1d2c.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1418484561, "title": "Episode 10 Discussion: \"The Best Defense is a Good Defense\"", "author": "", "summary": "Rebecca and Kevin invite special guests and fellow crime writers Lara Bricker and Toby Ball to talk about Episode 10 of Serial: The Best Defense is a Good Defense. Also, the panel catches up on the series, and reveals where they stand on the \"did he or didn't he\" question.\nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review!\nWant to make a donation to keep this podcast coming your way? Click the donate button on our home page!\n\n\nWho's Who in 'Crime Writers on Serial':\nRebecca Lavoie is a public radio digital director and radio producer and the co-author of three mass-market true crime books. If you’re flipping through the more obscure channels on your cable lineup late at night, you might see Rebecca talking about crime on one of those docu-journalism TV shows…you know, the kind with names like Deadly Women and Deadly Sins. \nKevin Flynn is Rebecca's real-life partner in crime and her co-author. Kevin was a long time TV reporter before jumping into crime writing with his first book about serial killer Sheila LaBarre, You can also hear Kevin talking about that case on this episode of the excellent crime podcast Criminal. Among the books Kevin and Rebecca have written together is Our Little Secret, which they discuss in the episode about \"Rumors.\"  \nSpecial guest panelists:\nLara Bricker is a long-time reporter, freelance writer and the author of the true crime book Lie After Lie. She has also worked as a private detective and a criminal defense investigator. \nToby Ball is  the author of Invisible Streets and other works of noir and crime fiction. He also works at the Crimes against Children Research Center at the University of New Hampshire.", "duration": "00:36:14", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/fded061e-0d7f-4b60-bec0-233b04af6fcd.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}, {"seriesId": 949195280, "seriesTitle": "Crime Writers On...", "pubDate": 1418481470, "title": "Episode 11 Discussion: \"Rumors\"", "author": "", "summary": "Rebecca and Kevin invite special guests and fellow crime writers Lara Bricker and Toby Ball to talk about Episode 11 of Serial: Rumors. Not everyone loved it. But Rebecca did.\nYou can subscribe to the podcast on iTunes right here. If you do, please leave a review!\nWant to make a donation to keep this podcast coming? Go to our home page, and click the Donate button!\n\n\nWho's Who in 'Crime Writers on Serial':\nRebecca Lavoie is a public radio digital director and radio producer and the co-author of three mass-market true crime books. If you’re flipping through the more obscure channels on your cable lineup late at night, you might see Rebecca talking about crime on one of those docu-journalism TV shows…you know, the kind with names like Deadly Women and Deadly Sins. \nKevin Flynn is Rebecca's real-life partner in crime and her co-author. Kevin was a long time TV reporter before jumping into crime writing with his first book about serial killer Sheila LaBarre, You can also hear Kevin talking about that case on this episode of the excellent crime podcast Criminal. Among the books Kevin and Rebecca have written together is Our Little Secret, which they discuss in the episode about \"Rumors.\"  \nSpecial guest panelists:\nLara Bricker is a long-time reporter, freelance writer and the author of the true crime book Lie After Lie. She has also worked as a private detective and a criminal defense investigator. \nToby Ball is  the author of Invisible Streets and other works of noir and crime fiction. He also works at the Crimes against Children Research Center at the University of New Hampshire.", "duration": "00:45:17", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music71/v4/23/f7/c7/23f7c71a-1549-5737-6631-f29450f539ec/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b79802b1-c6ae-469c-ab1d-89f0318a7af1.mp3", "type": "episode", "tags": ["true crime", "serial", "pop culture", "journalism", "tv"]}]}