{"series": {"feedUrl": "http://www.passiverealestateinvesting.com/feed/podcast/", "genres": ["Investing", "Podcasts", "Business", "Careers", "Education", "Higher Education"], "title": "Passive Real Estate Investing", "country": "USA", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "type": "series", "id": 1006557991}, "episodes": [{"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1488528348, "title": "New Construction Fourplexes in US Growth Markets | PREI 073", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today’s show, I talk to Steven, one of our providers at Norada Real Estate. They focus on brand new construction fourplexes in growth markets in the United States. He discusses this niche in detail, as well as the three main growth markets that they are working in.\nIf you missed our last episode, be sure to listen to 10 Lessons Learned From 100 Successful Real Estate Investors.\n\nEnjoy the show!\n\n–  –  –  –  –  –  –  –  –  –  –  –  –  –\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\n\nNew Construction Fourplexes in US Growth Markets\nWelcome to Passive Real Estate Investing. I’m you’re host, Marco Santarelli. On today’s show, I want to bring you one of our great providers that we work with in several different markets around the United States. They have a particular niche. They focus on brand new construction fourplexes in growth markets in the United States. This is a great product for certain types of investors. I would let Steven explain that. I don’t want to steal any of his thunder. First, let me welcome you on the show, Steven.\n\nThank you, Marco. It’s such a pleasure to meet with you. Thank you so much for taking the time to have me on your show.\n\nIt’s my pleasure. I think this is great because the information that you’re going to share today about the three different markets that you’re in and the product that we’ve been selling to clients is going to be very beneficial because we can reach a wider audience and do it very effectively on the podcast. First and foremost, let’s start off with you for a few minutes here. Why don’t you share a little bit about yourself, where you came from and how you got involved with real estate and real estate investing? \n\n\n\nI started out as a full time student. I was going to university. I knew that I wanted to get into real estate. I got my real estate license back in 2007. One of the mentors that I met with gave me some really insightful advice. I live in a mountainous region. He said, “If you go to the top of the mountain and look down on your market, you now have a license to do something that impacts that place for good. You get to choose what’s the highest and best use of your time to do that.” That was my mindset the entire time I was in real estate. What can I do to make a difference? Not just get commissions. What can I do to make a difference in this industry?\n\nAt the time when I was working with a builder, there’s plenty to compete with: a first time buyer, home builders, etc. you sit model homes. I didn’t have a flavor for that. I had no desire to sit in a model home and hear about people who wanted to change a room color or a flooring option or move a light fixture over three inches. That just didn’t do well with my brain type. At the time, there was a scarcity of a multi-family. I had investors that wanted to buy fourplexes, duplexes or eightplexes, etc. because of the ability to leverage decently and have one rooftop for more renters, rental sharing. There was very little available.\n\nI talked to this builder I was working with and said, “Why don’t we build them?” The very first product type we put out, I sent out an email just to my database saying, “We’re going to build this fourplexes. We had nine of them. They’ll be new construction. You’ve got to get your own construction loan because we’re not going to finance it for you. It’s a really good return. If you’re interested, let me know.” Within 30 days all nine had sold out. Nothing sold at that speed. It was when the market was down. We found that there was really a lot of demand for stable new construction fourplexes specifically. That’s how I got started in investment and since then had done about $250 million in ...", "duration": "21:00", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI073.mp3", "type": "episode", "tags": ["Episodes", "evaluate a market", "fourplexes", "growth markets", "how to choose a market", "invest in the right market", "Norada Real Estate", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "rental property tips", "senior investment counselors", "Successful Real Estate Investors", "turnkey rental property", "what to expect when buying turnkey rental property"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1487923534, "title": "10 Lessons Learned From 100 Successful Real Estate Investors – Dan Lane | PREI 072", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's show, I talk to Dan Lane, host of the Rental Income Podcast where he has interviewed to over 100 successful real estate investors. He has compiled 10 of his most important lessons learned from all of these interviews, and we go through each of them today.\n\nIf you missed our last episode, be sure to listen to Rich Dad Poor Dad Book Summary.\n\nEnjoy the show!\n\n–  –  –  –  –  –  –  –  –  –  –  –  –  –\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\n\n10 Lessons Learned From 100 Successful Real Estate Investors – Dan Lane\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. It is said that mistakes are made but lessons are learned. One of my friends, Dan Lane, is a guy who has interviewed over 100 successful real estate investors. He always asks the questions that he should've asked when he got started investing in real estate. He's learned a lot of good things and has walked away with a lot of great takeaways. I asked him to come on the show today to share with us some of those, the top 10 lessons that he's learned. It's great to have him on the show to share that wisdom that has been accumulated by many people over many years and that can help you shortcut your path to success and avoid stepping on the same landmines that other people have had or to maybe just curtail and accelerate the speed at which you accomplish your goals. \n\nIt's my pleasure to welcome Dan Lane to the show. Dan is an accidental landlord. He's also the host of the Rental Income Podcast, happens to be one of the podcasts I listen to on a regular basis. Dan wants to share his experiences and knowledge with you, our listening audience today. I'm excited about that because he has learned a lot from virtually 100 successful real estate investors that he's interviewed here over the last, I'm not sure how many years. With that, Dan, welcome to the show. \n\nHey Marco, it's an honor to be here. Thank you so much for having me. I love your show too. It's a real thrill to be on with you.\n\nI'm happy to have you on. You sent me a list of lessons learn and I thought, \"Wow, these are pretty good.\" They apply to different people in different ways, but there's something here for virtually everybody. I want to jump into those here in a couple of minutes. Let's start off with you, because it's always good to know who you are and where you came from. In your case, how you got involved in real estate accidentally. It's a great story. Please share that with us.\n\nWhen I graduated from college, I got a job in Corporate America. After a couple of years, I was making some money and I decided I was going to buy a property. I bought a house and I wasn't planning on having roommates. When word got out among my group of friends that I bought a place, I started having a lot of friends reach out to me to ask if they could rent a room and move in with me. I said, \"Sure. Let's do it. This will be fun.\"\n\nWhen I started doing the math, I was realizing that I was going to be living there for free, that their rent was covering the mortgage. I was just in disbelief. Today, we have a term for that. We call it house hacking. At the time, I wasn't familiar with that concept. I just figured I had stumbled upon something that was really cool. Just as luck would have it, the market was also appreciating around that time. About two years later, I sold the house and I made about $100,000. It really worked out awesome that I lived there free and had this big pile of money. I was hooked. From that point, I wanted to do it again.\n\nI ended up getting my real estate license to learn more about real estate. When I became a realtor,", "duration": "33:18", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI072.mp3", "type": "episode", "tags": ["Episodes", "Dan Lane", "evaluate a market", "how to choose a market", "invest in the right market", "lessons learned", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "Rental Income Podcast", "rental property tips", "senior investment counselors", "Successful Real Estate Investors", "turnkey rental property", "what to expect when buying turnkey rental property"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1487318735, "title": "Rich Dad Poor Dad Book Summary  |  PREI 071", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's show, I will be giving you a summary of Robert Robert Kiyosaki’s Rich Dad Poor Dad book. This is a famous book that has been mentioned in past episodes several times, but just in passing. This book changed and influenced the lives of a lot of people, myself included.\n\nIf you missed our last episode, be sure to listen to Ask Marco – Is It a Peak Market? | When Should I Buy? | Avoiding Failures.\n\nEnjoy the show!\n\n–  –  –  –  –  –  –  –  –  –  –  –  –  –\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\n\nRich Dad Poor Dad Book Summary\nWelcome to Passive Real Estate Investing. I’m your host, Marco Santarelli. On this episode, I want to talk about a very famous book, Rich Dad Poor Dad. I want to make a book summary here. If you’ve read the book, even if you’ve read the book more than once or you’re familiar with the book, I still suggest listening to this episode because we learn through repetition. You might catch a lot of things in your first run-through with the book but it’s not until you listen to something or read something a second or third time that you catch things you missed the first time, and you catch some new ideas that connect and gelled with new knowledge that you have in your head. It's always good to hear things a second or third time, because often you’ll catch new ideas and see things in a new perspective.\n\n\n\nRich Dad Poor Dad was a book that really affected me and opened my eyes because when I was reading that book, I literally cannot put it down. I was just so drawn into it. I was on a train ride from Rome to Florence, Italy at the time. With this beautiful countryside whizzing by on both sides of the train, it was more important to me to read the Rich Dad Poor Dad book than it was to look out the window of the train and admire and take in the beautiful scenery. I was focused.\n\nThe nice thing about Rich Dad Poor Dad is that the book summarizes Robert Kiyosaki’s lessons learned from two different perspectives, that of a poor man and that of a rich man. Drawing on his own experiences, Robert Kiyosaki discusses how he creates financial independence through investing and property ownership and building businesses. In his book, he says, “Look around, the richest people didn’t get rich because of their education. You look at Michael Jordan or Madonna, even Bill Gates who dropped out of Harvard and founded Microsoft, he’s now the richest man in America and he’s still in his 30’s.” That was back then, keep in mind this was twenty years ago. The point he’s trying to make is that, getting a good education and making good grades no longer ensures you success. Nobody seems to have noticed this.\n\nHe talks about two perspectives, and they’re very subtle but they’re two different perspectives. He says one is, “The love of money is the root of all evil,” but then he also says, “The lack of money is the root of all evil.” I tend to believe the latter. I come from the camp that a lack of money is the root of all evil because if you have enough money, cash, then you can resolve your issues and you can be charitable and help other people with their issues. I think if you have that lack mentality, it’s really more of a poor and middle class type of perspective. It’s not a perspective of abundance.\n\nOne of the reasons the rich get richer, the poor get poorer, and the middle class struggles in debt is because the subject of money is taught at home, not in school. Most of us learn about money from our parents. What can a poor parent tell their child about money? Money is not taught in schools, unfortunately. Schools focus on scholastics and professional skills, but not on financial skills. This is very true to this day.", "duration": "23:16", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI071.mp3", "type": "episode", "tags": ["Episodes", "Rich Dad Poor Dad", "Rich Dad Poor Dad book", "Rich Dad Poor Dad book summary", "Rich Dad Poor Dad lessons", "Rich Dad Poor Dad summary", "Robert Kiyosaki"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1486109119, "title": "Ask Marco – Is It a Peak Market? | When Should I Buy? | Avoiding Failures | PREI 070", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode I take some listener questions related to market timing and a \"peak\" market.  I also discuss the best time to buy rental properties, and how to avoid making mistakes leading to investment failures.\n\nIf you missed our last episode, be sure to listen to What To Expect When Buying A Turnkey Rental Property.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "20:06", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI070.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1484899829, "title": "What To Expect When Buying A Turnkey Rental Property | PREI 069", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's show, I have one of my senior investment counselors, Steve, and we will talk about what to expect when buying a turnkey rental property. We answer a lot of frequently asked questions and all of our clients, whether they're new or newbies or they are fully seasoned investors, have certain questions and certain expectations. They all want to know what the next step is and what to do at a certain point and what to do in certain situations and how to move the purchase along. We have certain answers for all these situations.\n\nIf you missed our last episode, be sure to listen to How Trump’s Presidency Could Affect Real Estate Investing.\n\nEnjoy the show!\n\n–  –  –  –  –  –  –  –  –  –  –  –  –  –\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\n\nWhat To Expect When Buying A Turnkey Rental Property\n \n\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. On today's show, I have one of my senior investment counselors, Steve, who's going to help me cohost this particular episode. What this episode is about is what to expect when you're buying a turnkey rental property. Let me explain what that means. We answer a lot of frequently asked questions and all of our clients, whether they're new or newbies or they are fully seasoned investors, have certain questions and certain expectations. They all want to know what the next step is and what to do at a certain point and what to do in certain situations and how to move the purchase along. We have certain answers for all these situations. They're pretty common across the board. We have this purchase process, if you will. On today's show, we're going to talk about some of the most common scenarios and what to expect with appraisals and inspections and a whole list of stuff. I have Steve on the line here. Steve, welcome to the show. \n\nHey, how you doing today?\n\nI'm doing great. It's good having you back on. It's been a while. \n\nIt's been a while. I'm here, still alive and kicking.\n\nI'm happy about that. That's good. As you heard me say, we're going to talk about some of the frequently asked questions or more about the expectations. They're not so much questions but what to expect in certain scenarios. I've scripted a bunch of items on a sheet of paper here. We're just going to go through those. They're more or less in a chronological order. What I'll do is I'll just throw out the topic, maybe you can comment or answer the question and then I'll provide my commentary and then we can just banter if need be and then we'll move on to the next one. \n\nI'll answer it and we'd move on.\n\nLet's start with the most general item. It's something we talk about a lot. In basic terms, what is a turnkey property?\n\n\n\nThat's a good question. It does cause some challenges if somebody comes to the table with certain expectations about what that is. The problem is that there is no correct definition. You go online, you research turnkey properties. There's a lot of different opinions about it. I think in general what it means is that everything is going to be done for you. That's probably something that everybody would accept as what a turnkey property is. You're going to buy a property that will be rehabbed and in rent ready condition. That usually means that the mechanicals and the major systems of the property should have I would say a minimum of seven years useful life left in them. You're not going to have to worry about any major expenditures like that for at least seven years. Your roof's going to be good, your furnace is going to be good.\n\nAlso, the property has had a cosmetic overhaul inside. These are rental properties, they're not going to get courts counters and a...", "duration": "53:13", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI069.mp3", "type": "episode", "tags": ["Episodes", "evaluate a market", "how to choose a market", "invest in the right market", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "rental property tips", "senior investment counselors", "Trump's Presidency", "turnkey rental property", "Wealth Potential", "what to expect when buying turnkey rental property"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1484294702, "title": "How Trump’s Presidency Could Affect Real Estate Investing | PREI 068", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In less than two weeks, we have president-elect Donald Trump taking over the Oval Office. What will that mean to us? How is that going to change the environment? How will Trump's presidency affect real estate investing?\n\nOn today's episode we talk with Greg Rand about how Trump's presidency might affect the real estate investing industry.\n\nIf you missed our last episode, be sure to listen to 5 Mindset Myths That Are Killing Your Wealth Potential.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed \n\n\nHow Trump's Presidency Could Affect Real Estate Investing\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. I want to give a shout out to all of you listeners out there in 152 countries. Thank you for being a listener. It's going to be an exciting year this year, 2017. Granted, there is a lot of change going on around the world, especially here in the US. What will 2017 bring, especially for us real estate investors and people who just follow the real estate environment?\n\nToday, I want to bring on a guest who I've known for a while and I keep bumping into him here and there. He's an author and a real estate guru of sorts. His name is Greg Rand. He's written a great book. He likes to look at real estate through the policy, political and economic and environmental lens. He has an interesting perspective on things. I think you're really going to enjoy today's episode.\n\nIn less than two weeks, we have president-elect Donald Trump taking over the Oval Office. What will that mean to us? How is that going to change the environment? I really don't know. I don't think anybody really knows because I've always said that Donald Trump, although he has a lot of great business and marketing qualities, he's also a wildcard. There's a lot of uncertainty about this new political regime that's coming into Washington.\n\nAt the same time, he's a guy who really understands a lot of things about business. I don't know. You got to look at the tax structure that we have in place and what that could potentially change into. There are predictions out there that home prices will go up. There are comments and suggestions that he will make industry friendly policy changes that will improve, not only the economy in general, but real estate more specifically.\n\nOne of those big things that are just floating out there and have been for a long time is the whole Dodd-Frank Act. It's a bill that is just jam-full of regulation. If Trump gets in and he is true to his word and minimizes the amount of regulation centered around this Dodd-Frank Bill, that will probably ease up on the capital flow. There will be more capital available for real estate projects, specifically for commercial. That will flow into many areas of the economy.\n\nIf Trump is successful in creating domestic jobs and bringing jobs that have been moved offshore back into the US, then theoretically that should be good for our economy and good for commercial real estate and good for residential real estate and good all around.\n\nI am politically agnostic and I do not believe that governments create jobs. They sure know how to raise capital through taxation, through inflation and guess what, then they redistribute that into areas that they want to put it into, social programs, infrastructure, whatever else, military. Time will tell. This will be a very interesting year. It'll be a very interesting four years with Trump in office.\n\n\n\nI am going to keep a close eye on the economic landscape and the housing market and just see how that plays out. Because at the end of the day, I can't control the global economy and neither...", "duration": "39:08", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI068.mp3", "type": "episode", "tags": ["Episodes", "evaluate a market", "greg rand", "how to choose a market", "How Trump's Presidency Could Affect Real Estate Investing", "invest in the right market", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "rental property tips", "Trump's Presidency", "Wealth Potential"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1483689956, "title": "5 Mindset Myths That Are Killing Your Wealth Potential | PREI 067", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Successful real estate investing relies on several factors, but as the old adage goes, “location, location, location” is top of the list.  But “location” is a broad term, and evaluating the right place to invest your dollars in real estate means identifying the right market in both the macro and micro senses.\n\nOn today's episode we talk about the factors that make up a good market for your investment dollars.", "duration": "49:56", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI067.mp3", "type": "episode", "tags": ["Episodes", "5 Mindset Myths", "evaluate a market", "how to choose a market", "invest in the right market", "Keith Weinhold", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "rental property tips", "Wealth Potential"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1481875515, "title": "How to Choose the Best Market for Your Real Estate Investment | PREI 066", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Successful real estate investing relies on several factors, but as the old adage goes, “location, location, location” is top of the list.  But “location” is a broad term, and evaluating the right place to invest your dollars in real estate means identifying the right market in both the macro and micro senses.\n\nOn today's episode we talk about the factors that make up a good market for your investment dollars.", "duration": "22:51", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI066.mp3", "type": "episode", "tags": ["Episodes", "evaluate a market", "how to choose a market", "invest in the right market", "real estate entrepreneurs", "real estate investing tips", "real estate markets", "rental property tips"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1480665686, "title": "A Wealth Capture Machine – M.C. Laubscher | PREI 065", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode we speak with M.C. Laubscher about a not-so-new concept of how to be your own bank.  M.C. Laubscher is a wealth strategist, educator, and financial freedom fighter.  He is the founder and president of Valhalla Wealth Financial.", "duration": "44:39", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI065.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1480061106, "title": "Leveraging Hidden Assets | PREI 064", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode we talk about some of the hidden assets you may not be aware of, and how you might be able to put them to better use and get a higher yield.  It's a quick episode but a topic an important topic to consider.", "duration": "20:45", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI064.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1479456348, "title": "How to Pay Less in Taxes – Amanda Han | PREI 063", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "If you want to succeed in real estate, your tax strategy will play a HUGE role in how fast you grow.\n\nA great tax strategy can save you thousands of dollars a year — and a bad strategy could land you in legal trouble.\n\nOn today's episode we discuss some ways to maximize your tax deductions, Little known secrets to take control of your retirement money, clever ways to write off your kids, and so much more.\n\nIf you missed our last episode, be sure to listen to the Maverick Mistakes in Real Estate Investing.\n\nEnjoy the show!\n\n- - - - - - - - - - - - - -\n\nDownload your FREE copy of: The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes. Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW (Thank you!)\n\nSUBSCRIBE on iTunes | Stitcher | Podcast Feed \n\n\nHow to Pay Less in Taxes – Amanda Han and Matthew MacFarland\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. Today we've got what might be perceived as a boring topic, and that is about taxes. But remember that taxes are your biggest expense throughout your lifetime. Not only do you need to choose your income wisely because your income, depending on how you generate it, will be taxed at different rates. But if you invest wisely, like with real estate for example, you can have some of the best tax breaks available through the IRS code in the United State.\n\nSee, the more you earn through your job or through your business, the more you're going to get taxed. But the system is actually set up in a way that actually punishes people who earn employment income. This is your W9 and, to some degree, your 1099 income. It is designed to reward business owners and investors. Real estate, rental real estate, income producing real estate, falls in that I quadrant. That's all about investing.\n\nWage income not only requires hard work but it gets taxed at a very high rate and on top of that, you have to pay what are known as FICA taxes, which have to do with your Medicare. It's just not the best way to protect yourself from the taxes that will erode and eat away at every paycheck.\n\n\n\nHow do you protect yourself? The best way is through rental real estate, income producing real estate. Why is that? Because it has many tax advantages, especially over wage income. You got this capital gains rates that, on real estate, caps out at 15%.\n\nNow, that's assuming you've held a property for a minimum of twelve months, but you compare that 15% federal tax rate on the capital gains to the 35% or so that you would be charged on wage income. There's a huge difference right then and there. On top of that, you have state taxes, and then on top of that, some states even have further discounts on those capital gains income. It really adds up.\n\nRemember that capital gains requires that you hold the property for a minimum of twelve months. This does not apply to flippers. Unfortunately, if you're wholesaling and flipping property, you lose out on this capital gain benefit.\n\nNow, there's also that 1031 exchange, which is basically a way for you to roll your profits over from one rental property into another and defer those taxes. You could potentially defer indefinitely. Your tax basis in doing so actually just rolls from one property to another to another. This is the great thing about the 1031 exchange, it's a tax deferred exchange.\n\nNow, there are some rules you have to follow. You have to close within 180 days and you have to identify those properties within 25 days. We've actually talked about this in a previous episode not too long ago. You can go back and listen to that to figure out how this all works.\n\nRental real estate, income real estate, also provides you an interest deduction. You see, you get to actually deduct the interest you pay on your debt. The beautiful thing about that is it lowers your taxable income.", "duration": "45:52", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI063.mp3", "type": "episode", "tags": ["Episodes", "assets under management", "AUM", "build passive income", "business coach", "Damion Lupo", "ERISA", "lead follow up", "martial arts", "need for a singular focus", "passive real estate income", "qualified retirement plan", "real estate counselors", "real estate entrepreneurs", "real estate investing tips", "rental property tips", "retirement", "Rich Dad Poor Dad", "taking advantage of taxes", "taxes and real estate"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1478185212, "title": "Maverick Mistakes in Real Estate Investing – Damion Lupo | PREI 062", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Born with an entrepreneurial spirit Damion started his first business at age 11, has started 30 since then, and is the published author of 5 books.\n\nDamian paid for his first rental house with a VISA, then over next 5 years bought 150 houses across 7 states, and went through a $20,000,000 meltdown in 2008.\n\nDamian’s personal philosophy combined with a love of financial markets and money psychology drove him to start the Austin-based financial-tech company, Total Control Financial in 2016. His aim was to disrupt wall street and empower main street.\n\nOn today’s episode we discuss some of the messes and misfortunes Damion made as a real estate investor. What can we learn from his experience? Let’s find out, and enjoy our other interesting tangents of discussion.\n\nIf you missed our last episode, be sure to listen to the Ask Marco: Asset Protection, Holding Title, Closing Dates.\n\n\nMaverick Mistakes in Real Estate Investing – Damion Lupo\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. As you know, this is the show where busy people like you learn how to build substantial passive income and create wealth for the long term.\n\nOn today's show, I wanted to bring on a guest who I find rather interesting because he has been very, very successful in real estate in years past. But then, has also learned from a lot of messes and misfortunes. I'm hoping that he can share some of those lessons in maverick mistakes in real estate investing with us today.\n\nI guess, us, as investors, if we can learn from other people's successes and other people's mistakes, it will just spring board our success and it will shorten or compress the length of time that it takes for us to get to where we want to achieve those investment goals.\n\nMy guest today is Damion Lupo. He is born with an entrepreneurial spirit. Damion started his first business at the age of eleven. He's started 30 since then. He is the published author of five books. Damion paid for his first rental house on a Visa, of all things. Then, over the next five years, bought 150 houses across seven states.\n\nThen he went through a $20 million meltdown in 2008. Damion's personal philosophy combined with a love of the financial markets and money psychology drove him to start his Austin based financial tech company, Total Control Financial in 2016. His aim was to disrupt Wall Street and empower the Main Street, which I just love.\n\nDamion, welcome to the show. \n\nHey, Marco. It's awesome to be here. Thanks for having me.\n\nIt's my pleasure. Before we get into meat and potatoes here, I have a curiosity thing. I took martial arts for many, many years. In my earlier years, I spent many years studying Judo and then I spent years in Aikido and Hapkido, which is a Korean version of the martial art. Apparently, you have three black belts and you created your own martial art, called Yokido. I was wondering if you could maybe tell me a little bit about that, because I'm very curious.\n\nDefinitely. I started Aikido about the same time I started my real estate investing. Actually, it was the same year. Over the next decade and a half, I ended up with three different black belts in Aikido or versions of Aikido.\n\nAt some point, about five or six years ago, I started studying yoga and realized there was such powerful component of yoga, with breath work and core, strength that could really be brought into the Dojo, the martial arts space. And empower people to use their breath, which is so important that gets left out often times, and infusing things like the meditative aspects of yoga and bring that in so that people could be more powerful simply by breathing correctly.\n\nThis was a good bridge for women that loved yoga and really wanted to feel comfortable walking around. Especially with Aikido, if they saw there was a gentle way to take yoga and bridge into self defense, they could have a different experience showing up in the world and living without fear of ...", "duration": "48:24", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI062.mp3", "type": "episode", "tags": ["Episodes", "assets under management", "AUM", "build passive income", "business coach", "Damion Lupo", "ERISA", "lead follow up", "martial arts", "Maverick mistakes in real estate investing", "need for a singular focus", "passive real estate income", "qualified retirement plan", "real estate counselors", "real estate entrepreneurs", "real estate investing tips", "rental property tips", "retirement", "Rich Dad Poor Dad", "UDFI", "unrelated debt financed income"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1475826397, "title": "Ask Marco: Asset Protection, Holding Title, Closing Dates | PREI 061", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode we respond to some listen questions about asset protection and how I like to structure my asset protection plan.  As well as how to hold title and use a client as an example scenario.  And a quick look at closing dates and what to expect in practice.\n\nIf you missed last week's episode, be sure to listen to the Listener Questions / Jacksonville Update.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "23:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI061.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1474527948, "title": "Listener Questions / Jacksonville Update | PREI 060", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode we briefly revisit Jacksonville, Florida to look at some new pre-construction investment opportunities.\n\nI also answer several listener questions about getting started, property tax rates as an out-of-state investor, and whether a cash-out refinance on a principal residence makes sense.\n\nIf you missed last week's episode, be sure to listen to the Market Spotlight: Little Rock, Arkansas.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "34:41", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI060.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1473923134, "title": "Market Spotlight: Little Rock, Arkansas | PREI 059", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode we take a look at the great \"under the radar\" market of Little Rock, Arkansas.\n\nLittle Rock has a great economy, and terrific number in terms of purchasing and rates of return.  It's also one of the most landlord friendly states in the country with average eviction times of only 21 days!\n\n \tWhy invest in Little Rock, AK?\n \tWhat is the local economy like?\n \tWhat is the local housing market like?\n \tWhat is the local rental market like?\n \tWhat are the typical turnkey rental properties like in Little Rock?\n\n \n\nIf you missed last week's episode, be sure to listen to the Investing in Turnkey Properties — My Journey, Setbacks and Advice.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "34:08", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI059.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1473318322, "title": "Investing in Turnkey Properties — My Journey, Setbacks and Advice | PREI 058", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode I share my journey investing in rental real estate from my early start at the age of 18, through my trials and tribulations, to where I am today.  We should all learn from our past experiences, good and bad, because they provide us knowledge and the wisdom to improve and do better as we go.\n\nRegardless of where you are in your investing journey, I encourage you to listen in, and feel free to share your story with us.\n\nIf you missed last week's episode, be sure to listen to the Indianapolis Update and Listener Questions.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "21:42", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI058.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1472109045, "title": "Indianapolis Update and Listener Questions | PREI 057", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's show we speak with one of our local Indianapolis market experts and property provider about the growth and opportunities in the Indianapolis market.  We have some news and updates from our Indianapolis market spotlight early this year.\n\nI also answer several listener questions, and talk about leveraging your existing equity to build a larger portfolio with more cash flow.\n\nIf you missed last week's episode, be sure to listen to the pros and cons of rehabbing and flipping.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "41:23", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI057.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1471503934, "title": "Pros and Cons of Rehabbing and Flipping – Matty Aitchison | PREI 056", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Matty Aitchison is a millennial entrepreneur, real estate investor, and wealth building evangelist who has had great success following his turbulent start.  Ranked in the Wall Street Journal’s Top 1000 for real estate teams nationwide, Matt has personally flipped over 100 houses in 5 years, and now passionately mentor others on their journey of unlocking a rich and fulfilling life.\n\nListen in as Matty and I discuss the pros and cons of rehabbing and flipping properties.\n\nIf you missed last week's episode, be sure to listen to The Four Real Estate Market Cycles.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "47:19", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI056.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1470899127, "title": "The Four Real Estate Market Cycles | PREI 055", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In order to make profitable investments, it’s vital for investors to understand the four real estate market cycles because they directly affect the price of the properties you may want to consider, or the properties you currently own.\n\nIf you missed last week's episode, be sure to listen to The Wealth Creation Formula.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "21:13", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI055.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1470294300, "title": "The Wealth Creation Formula | PREI 054", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Have you ever wondered how the rich keep getting richer while broke people stay broke and the middle class continues to shrink?  This isn't as mysterious as it may appear when you examine the specific differences in how broke people, the middle class, and the rich spend their money.\n\nToday we talk about The Wealth Creation Formula.\n\nIf you missed last week's episode, be sure to listen to Finding The Drive To Be A Huge Success In Real Estate with Rod Khleif.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "15:15", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI054.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1469689526, "title": "Finding The Drive To Be A Huge Success In Real Estate – Rod Khleif | PREI 053", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Our guest today is Rod Khleif.  Rod has personally owned more than 2,000 single family homes, and multiple apartment communities.  Rod has also built several multi-million dollar businesses, and has dedicated himself as a community philanthropist.  A compelling rags-to-riches-to-rags-to riches story, Rod soared from humble beginnings as a young impoverished Dutch immigrant to incredible success.\n\n \t\n\n \tWhy is psychology more important than technical knowledge in real estate?\n\n\n \tHow does one find the drive to be a huge success in real estate?\n \tWhat’s the difference between Achievement and fulfillment in your real estate business?\n \tAnd so much more.\n\n \n\nIf you missed last week's episode, be sure to listen to Inflation, Debt and the Investment Landscape with David Stein.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "29:29", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI053.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1469084706, "title": "Inflation, Debt and the Investment Landscape – David Stein | PREI 052", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Our guest today is David Stein.  David was the Chief Investment Strategist and Chief Portfolio Strategist at Fund Evaluation Group, LLC, a $33 billion investment advisory firm.  Today he likes to teach people about money, how it works, how to invest it and how to live without worrying about it.\n\n \tWhat is inflation, and what causes it?\n \tWhy you shouldn't pay off your mortgage.\n \tWhat does the current investment landscape look like?\n \tPlus other topics we discussed on tangents.\n\n \n\nIf you missed last week's episode, be sure to listen to How to be Mortgage Free in Five to Seven Years.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "45:06", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI052.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1468479907, "title": "How to be Mortgage Free in Five to Seven Years – Jordan Goodman | PREI 051", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "How would you like to be completely mortgage free in less than a decade?\n\nThere's a new way to manage your mortgage and monthly cash flow so that you, and not some banker, get to squeeze the most use out of every dollar that comes in, and every dollar that goes out.  The strategy is called Equity Acceleration.  It's not such a big secret in Australia and the United Kingdom, where as many as 1-in-4 homeowners are accelerating the mortgages.\n\nJoin me on this exciting episode to discover how you can be mortgage free in 5 to 7 years on your principal residence or investment properties.\n\nAnd, if you missed last week's episode, be sure to listen to From Broke to $10,000 per Month at Age 24 – Sean Gray.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "42:34", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI051.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1467875103, "title": "From Broke to $10,000 per Month at Age 24 – Sean Gray | PREI 050", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "How does a 22-year old go from being broke, clueless, and sleeping on the floor of a small home with ten other broke college buddies to making over $10K per month, traveling the world, meeting his business heroes, all within six months?\n\nWell meet Sean Gray.  He started by asking himself better questions, and as he likes to say, “being the person who he is becoming.”  Today, at age 24, he’s an author, speaker, real estate investor, business owner, and Rich Dad Education rep.\n\nJoin me for a great interview with many nuggets of great information.\n\nIf you missed last week's episode, be sure to listen to What You Need to Know About Cash-Flow – Frank Gallinelli.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed \n\n\n\n \nFrom Broke to $10,000 per Month at Age 24 – Sean Gray\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. If you're a millennial, I really want you to pay attention to this show. But if you're not a millennial, I still want you to pay attention to the show because I have a question for you. How does a 22 year old go from being broke, clueless and sleeping on the floor of a small home with ten other broke college buddies, to making over $10,000 per month, traveling the world, meeting his business heroes all within six months? Meet Sean Gray. He started by asking himself better questions and, as he likes to say, \"Being the person who he is becoming.\" Today at age 24, he's an author, speaker, real estate investor, business owner, a Rich Dad education rep. With that, welcome to the show, Sean.\n\nThank you, Marco. That was quite the introduction.\n\nIt's all true. You have an amazing story. What impressed me a lot about you is you were 22 at the time, you're 24 now, if I'm not mistaken.\n\nCorrect.\n\nThat puts you in the millennial category. It depends on whose numbers you read, but there's over 82 million of you guys out there. I think a lot of millennials really are lost. A lot of them still live at home because they just don't have the income, because they don't have the jobs. A lot of them are in school or they were in school and dropped out. They're trying to find their way. This is the reason I wanted to bring you on the show, is because I think you can be a massive inspiration for a lot of these people. It's not just those people that are listening to the show. We have everybody, from 18 to 70 year old people listening to this show. You can be an inspiration for everybody. I'm very happy to have you on the show.\n\nI'm happy to be here.\n\nLet's begin with a very basic question. What do you do?\n\nThat is a great question. It seems like a basic question but it's like peeling back layers of the onion. I get asked that question a lot. I'm not sure how to answer it. Sometimes I answer it with just basic, \"I do sales, marketing,\" because I can't tell if they're really wanting to know or if they're just making small talk. For the conversations like this, when you really want to know what I do, at the 30,000 foot level, what I do is I travel around and I build my brand, I build my network through building relationships and keeping my eyes open for opportunities. When opportunities present themselves that align with my values, where I want to go, the things that I want to accomplish, I put myself in those environments to take advantage of them. I know that's a 30,000 foot view level and not very specific but I'm sure we'll get into more specifics as we go on.\n\nLike you said in my introduction, I work with Rich Dad Education, do some real estate investing. I have a couple different businesses. One that teaches financial education and entreprene...", "duration": "36:29", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI050.mp3", "type": "episode", "tags": ["Episodes", "business owner", "Millennials", "Millennials tips", "real estate investor", "Rich Dad Education rep", "Sean Gray", "tips for Millennials"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1467270306, "title": "What You Need to Know About Cash-Flow – Frank Gallinelli | PREI 049", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "The only way to win the real estate investing game is by mastering the numbers.\n\nIf you’re truly interested in real estate investing then you must first realize that investing in income properties is all about the numbers.  It’s about discounted cash flow and rates of return and net operating income and cap rates.  If you understand how these and other key concepts work, then you’re on your way to success – and that’s exciting.\n\nOur guest, Frank Gallinelli is the author of the best-selling book, \"What Every Real Estate Investor Needs to Know About Cash Flow... \" now in its third edition, as well as other books and numerous articles on real estate investing and finance.  A graduate of Yale University, he serves as Adjunct Assistant Professor of Real Estate Development at Columbia University.  Frank has been involved in real estate for more than 40 years and is the founder & president of RealData, a real estate software firm that has provided analysis and presentation tools for investors and developers since 1982.\n\nWhat Every Real Estate Investor Needs to Know About Cash Flow... And 36 Other Key Financial Measures can be purchased on Amazon.com.\n\nIf you missed last week's episode, be sure to listen to Increasing Cash-Flow, Deferring Taxes and Reducing Risk using a 1031 Exchange.\n\nEnjoy the show!\n\n-  -  -  -  -  -  -  -  -  -  -  -  -  -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee our available Turnkey Cash-Flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "56:37", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI049.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1466708728, "title": "Increasing Cash-Flow, Deferring Taxes and Reducing Risk using a 1031 Exchange | PREI 048", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Would you like to defer (or eliminate) your capital gains taxes?  How about increasing the cash-flow of your real estate portfolio?\n\nThe taxable gain in real estate is due to a combination of the appreciation in value and the amount of depreciation taken over the period of time that it was owned by the investor.    The tax savings using a 1031 exchange can be enormous.  And using a 1031 exchange can help you re-position your real estate holdings into more, and better income real estate to increase your cash-flow and lower your risk.\n\nThis is a content-rich episode, so get ready to expand your knowledge.\n\nIf you missed last week's episode, be sure to listen to The Difference Between Rich and Wealthy (and Which is Better).\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Cash-flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "44:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI048.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1465542319, "title": "The Difference Between Rich and Wealthy (and Which is Better) | PREI 047", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Many people think that being rich and being wealthy are the same thing.  They’re related but not the same.  You see, the rich have lots of money but the wealthy don’t worry about money.\n\nWhat’s the difference?\n\nJoin me as we take a look and compare the two.\n\nAnd if you missed last week's episode, be sure to listen to Financing for Foreigners and the Self-Employed.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Cash-flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "15:48", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI047.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1464872498, "title": "Financing for Foreigners and the Self-Employed | PREI 046", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "How do you get financing for investment real estate if you're a self-employed or a foreigner (non-resident or non-U.S. citizen)?  It's not hard as there may be many options available to you.\n\nWe talk to a lot of investors who are self-employed or live abroad who want to purchase investment property with financing.  Well, the good news is there are a number of financing options and we work with a number of lenders who can provide you financing on virtually any of our  turnkey investment properties.\n\nOn today's episode we speak with just one of portfolio lenders who has helped a number of our clients purchase properties here in the United States.  Listen up as we discuss the commonly asked questions and terms available today.\n\nAnd if you missed last week's episode, be sure to listen to The Importance of Reputation.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Cash-flow Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "26:25", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI046.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1464249606, "title": "The Importance of Reputation | PREI 045", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "I just came back from a real estate forum in Florida where I was speaking on a panel answering questions about real estate and turnkey operators in the industry.  As it turns out, I was asked a very important question about building your reputation in an industry with shady operators.  Unfortunately, they only gave me two minutes to answer a question that required at lease 15 minutes.\n\nSo, I felt the question was important enough to cover as a podcast episode.  Especially in our industry where there truly are shady operators.  You need to be able to protect yourself and work with trustworthy businesses.  Otherwise, the consequences can be very expensive.\n\nAnd if you missed last week's episode, be sure to listen to Common Investor Questions (Part 1).\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "24:20", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI045.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1463040014, "title": "Common Investor Questions (Part 1) | PREI 044", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "We get asked a lot of great questions from real estate investors and our clients.  On this episode I invited one of our Investment Counselors where we both provide answers to some of our most common investor questions.\n\nAnd if you missed last week's episode, be sure to listen in to better understand how to predict real estate prices.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "33:06", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI044.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1462460504, "title": "How to Predict Real Estate Prices | PREI 043", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Is it possible to learn how to predict real estate prices?\n\nLearn why property values and price trends are so important.  If you can see where a market has been, and where it may be headed, you can lower your risk and improve your results.\n\nWe welcome back my good friend and successful real estate investor, David Campbell, to discuss market drivers, inflation, currency and other factors that investors should be aware of.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "1:01:07", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI043.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1461855719, "title": "$6,000 Total Out-of-Pocket Turnkey Properties in Memphis | PREI 042", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Is it truly possible to purchase turnkey rental properties for about $6,000 total out-of-pocket? \n\nOn today's episode we show you that it is, and we explain how it works and how you too can benefit if you choose.\n\nJoin us as we speak to one of our Memphis property specialists about the market and the opportunity.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI042.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1461250888, "title": "Ask Marco – Pre-Construction Risks, Evaluating Cash-Flow and Rates of Return | PREI 041", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "After returning from a two-week vacation in Thailand, I'm back to work answering listener questions.  On today's episode I talk about some miscellaneous stats and cover some listener questions including:\n\n\tWhat do the successful 2% do that the other 98% don't?\n\tDo you deal with \"active\" real estate investments?\n\tHow should I evaluate a property's cash-flow and rates of return?\n\tAre there more risks with pre-construction properties?\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI041.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1460041276, "title": "Leveraging Your Cash, Equity and Time – Keith Weinhold | PREI 040", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On today's episode our guest is Keith Weinhold.  Keith is the founder of Get Rich Education and is a popular podcaster, active real estate investor, business owner, and good friend.\n\nKeith shares his story of how he started in real estate and became an \"accidental millionaire\".  Many of you may want to copy that same formula.\n\nWe discuss the differences between compounding and leverage.  Which one is better?\n\nWe explore the concept of return on time - one of my personal favorites.\n\nAnd Keith shares some tips and advice for new investors looking to build a portfolio, and for seasoned investors wanting to get to the next level.\n\nKeith's website can be found at www.GetRichEducation.com.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed \n\n\n\n \nLeveraging Your Cash, Equity and Time – Keith Weinhold\nIt’s my pleasure to welcome Keith Weinhold to the show. Keith is the founder of Get Rich Education and is a popular podcaster. He’s an active real estate investor, a business owner and a good friend. Keith, welcome to the show.\n\nThank you so much for having me today, Marco.\n\nIt’s great having you on. How’s the weather up there in Anchorage, Alaska?\n\nIt is a gray, rainy, windy day here, but it didn’t stop me. I just got back from going on a run about an hour ago anyway. I’m feeling invigorated.\n\nYou like to mountain climb, if I remember right? \n\nYes, that is right. I wasn’t born and raised in Anchorage but I moved here because this place just fits me. I do a lot of mountaineering and skiing here in this city of 300,000, Anchorage Alaska.\n\nOnly 300,000. It’s a beautiful place. I’ve seen many pictures of Alaska and Anchorage and it’s gorgeous. The lakes are just beautiful. One of these days, maybe I’ll have to fly up and go out for dinner with you. \n\nYes, you sure will at some point. Only 300,000. This is the big city here. Almost half the population lives in this one city. A lot of old time sourdough Alaskans, they frown on urban Alaska and urban Anchorage. They make jokes. They say, “From Anchorage, you can see Alaska.”\n\nThat’s a good one. All real estate is local. I have that saying, live where you want, invest where it makes sense. This segues into your story. Let’s get into your story here. You remind me of the “accidental” millionaire because of how you got started in real estate. Tell our listeners your story of how you discovered real estate investing.\n\nIt was a little bit accidental. I was born and raised in Pennsylvania. I did not come from an entrepreneurial or a real estate family at all. In 1999, I moved to a place I dreamed of living, Anchorage, Alaska because I had vacationed here four times previously. I was really young when I moved here, I was coming of age. When it’s about time for me to buy my first home, I was hanging out with some friends that were, I guess productive-minded friends, aspirational. Like they say, you are the average of the five people that you spend most time with.\n\n\n\nTwo of my friends, what they had done is they had bought their first home not as a single family home but what they did is they bought a fourplex building. They lived in one unit and rented out the other three. Now, one of my friends really had his act together, and the other was kind of a screw off. I knew if the screw off could do it, I could do it. In 2002, I started my real estate investing career, I didn’t know it was going to turn in to any sort of career, by buying an Anchorage, Alaska fourplex building for $295,000.  Between having some friends that were doing it and reading the influential book Rich Dad, Poor Dad around 2001, I had some context there.", "duration": "", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI040.mp3", "type": "episode", "tags": ["Episodes", "compounding and leverage", "Get Rich Education", "Keith Weinhold", "leverage", "leveraging your cash", "leveraging your equity", "leveraging your time", "return on time"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1459436483, "title": "Why You Need a Broker’s Price Opinion | PREI 039", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "There are times when you may need a Broker's Price Opinion.  Are you even aware of what exactly a BPO is and is not?  Many investors aren't, and many don't even realize the many uses of getting a BPO done on your properties, or one's you're looking to purchase.\n\nOn today's episode we talk to the owner of Lakeside BPO to better understand the differences between appraisals, Broker's Price Opinions, CMAs and regular sold comparables.\n\nEnjoy the show!\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI039.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1458843282, "title": "How the Economic Machine Works – Ray Dalio | PREI 038", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "I think you are going to love this episode!\n\nWhat I’m excited to share with you today is the audio portion of one of the greatest videos ever produced that explains how the economy works.  More specifically, it’s titled “How the Economic Machine Works”.  The 30-minute video was produced and narrated by Ray Dalio.\n\nWho is Ray Dalio?\n\nRay Dalio is an American businessman and the founder of the investment firm Bridgewater Associates.  He is one of the wealthiest people on the planet, with an estimated net worth of $15.4 billion (Forbes, 2015).  And Time magazine considered him one of the Top 100 most influential people in the world.\n\nI reached out to Ray last week and asked him if I could share his great explanation with my listeners, and he graciously agreed.\n\nRay says that an economy is simply the sum of the transactions that make it up. A transaction is a simple thing. Because there are a lot of them, the economy looks more complex than it really is. Instead of looking at it from the top down, it’s much easier to understand if we look at it from the transaction up.\n\nRegardless of how important the economy may be to you, I think having a basic understanding of it will make you a smarter investor. And having a better understanding of it will help make you far more successful in all your financial and investment decisions.\n\nI’m sure many of you will want to listen to this episode more than once because of the amount of content packed into this audio-only reply. My suggestion is to listen to it at least once, then click the link in the show notes to watch the animated video. The animations give it another dimension that helps you visualize and better understand the concepts. So don’t feel overwhelmed if this is your first time hearing this.\n\nPlus, Ray shares his three rules-of-thumb that you can take away and apply to your own personal economy.\n\nNow, just sit back and enjoy this audio-only portion of “How the Economic Machine Works”.\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI038.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1458226895, "title": "Viewing Properties Just Got Easier – WeGoLook | PREI 037", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Wouldn't it be great to have a set of eyes, hands and feet in another market to help you check or verify almost anything you want?\n\nOn this episode our guest is Robin Smith, the CEO of WeGoLook.com.  WeGoLook is an inspection company leveraging a sharing economy of over 20,000 agents.  They can inspect and verify properties, autos, boats, antiques, electronics, furniture, and almost any other asset.\n\nLearn how they can help you with your real estate investing by taking care of inspection and verification tasks that you can't easily or quickly do yourself.\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Rental Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "30:32", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI037.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1457625669, "title": "An Aussie’s Journey into U.S. Real Estate | PREI 036", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On this episode our guest is Reed Goossens, the owner of RSN Property Group.  He lives in Los Angeles and is originally from Australia down under.  His background is as a structural engineer and currently owns properties in New York, Pennsylvania, and Texas.\n\nReed moved to the U.S. in 2012 to pursue a career in structural engineering, however he discovered a passion for real estate investing.  With limited funds and no credit, Reed went from purchasing a small duplex to growing his own real estate investing firm, RSN Property Group.  Reed now syndicates large multi-million dollar deals across the U.S.\n\nListen in as Reed shares his journey into U.S. real estate from his first property to commercial syndications.\n\n- - - - - - -\n\nDownload your FREE copy of:  The Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "33:55", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI036.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1457022630, "title": "Make Better Decisions Using Neighborhood Info | PREI 035", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "It's not enough to analyze a property, or even the overall market.  The neighborhood surrounding your property is permanently attached and important to consider when investing in rental properties.  You want to make sure that you understand where you're investing and that it fits your goals and investment criteria.\n\nOn this episode we talk to Dr. Andrew Schiller.  Dr. Schiller is the Founder, CEO and Chief Scientist of Location, Inc.  He is responsible for inventing the search and neighborhood matching algorithms that powers www.NeighborhoodScout.com.\n\nThis is an episode you'll want to listen to twice.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "43:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI035.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1456419654, "title": "Market Spotlight: Investing in Indianapolis | PREI 034", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Why invest in Indianapolis?\n\nOn this episode we take a close look at the Indianapolis, Indiana market and why it has been a perennial market for real estate investors.  The affordability, price points and quality of properties makes it one of the favorite markets among real estate investors.\n\nThe Indianapolis market is landlord friendly, and ranks as one of the cleanest and safest cities in the country.\n\nIf you're looking for cash-flow in a solid stable market then Indianapolis turnkey rental properties may be the right addition for your portfolio.  Find out more by contacting one of our Investment Counselors at Norada Real Estate Investments.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "31:56", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI034.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1455950707, "title": "My Father’s Passing, Best Way to Get Started, Due on Sale, IRA Exit Strategy | PREI 033", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "After having been forced to take a little time away from recording new episodes, I am back to pick up where I left off.\n\nOn this episode I take a moment to reflect on how real estate has provided me with the TIME freedom to spend with my father who has been saddled to a hospital bed for over seven (7) months up until his unfortunate passing early this month.\n\nI also address three listener questions on the best way to get started in real estate investing.  Another question about a lender's ability to accelerate a loan using the \"Due on Sale\" clause -- and how to avoid it.  And finally an interesting question about an IRA exit strategy when turning 70 1/2 and you are required to make the minimum required disbursements (MRD).\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "17:57", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI033.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1452812892, "title": "Rich Dad Advisor, Tom Wheelwright on Tax-Free Wealth | PREI 032", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "On this episode we learn how to keep more of what we make and legally pay less tax (or not tax) on our income and real estate!\n\nOur guest is Tom Wheelwright -- a leading tax and wealth expert, speaker, and a Rich Dad Advisor to Robert Kiyosaki (author of Rich Dad Poor Dad). Tom is best known for making taxes fun, easy and understandable and is the bestselling author of Tax-Free Wealth.\n\nYou can buy his book at most retailers or on Amazon:\n\nTax-Free Wealth: How to Build Massive Wealth by Permanently Lowering Your Taxes\n\nVisits Tom's company website (ProVision Wealth Strategists) at www.taxfreewealthadvisor.com\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed \n\n\n\n \nRich Dad Advisor, Tom Wheelwright on Tax-Free Wealth\nIt’s my pleasure to welcome Tom Wheelwright to the show. Tom is a leading tax and wealth expert, a speaker, and a Rich Dad Advisor to Robert Kiyosaki, author of Rich Dad Poor Dad. Tom is best known for making taxes fun, easy and understandable, and is the best-selling author of Tax-Free Wealth. He specializes in helping investors permanently reduce taxes, and that’s the reason I wanted to bring him on the show today. Tom, welcome to the show. \n\nHey, thanks so much for having me. It’s great to be on your show.\n\nIt’s my pleasure to have you. I’ve been actually looking forward to this episode because taxes are one of those things that nobody likes to think about, nor do they like to pay it. It’s been said that taxes are the largest single expense, in fact, that’s a quote from Robert Kiyosaki. I think it’s timely to have you here on the show in January, and I’m pretty excited to talk to you.\n\n\n\nI’m always excited to talk about tax. As we were talking beforehand, I am, first and foremost, a tax nerd. I absolutely love tax, I love the tax law. I was actually doing a little research the other day, and I think the Bible has 800,000 words to it, and the tax code, just the law, no ruling, regulation, anything else, has over two and a half million. There’s this famous quote from Albert Einstein saying, “The most difficult thing in the world to understand is income tax.” I just like that quote because it makes me feel good about myself, but I do recognize that it is something that people, like you say, taxes are bad word, it’s a bad thing. But there are so many opportunities to reduce your taxes, that if we can turn it into a good word, then we now have just a lot more money to use to invest and build our wealth.\n\nWe’re both very big on education, and I’ve read your book in 2012 when it came out, your book Tax-Free Wealth. One of the things you say in there is that, taxes can make you rich or make you poor, it’s your choice. Let’s start off by talking about what tax-free wealth is. How do you describe that to people?\n\nTax-free wealth is really a function of understanding how the tax law works and what it really is. Most people look at the tax laws, and in fact, most tax advisors look at the tax law as, this is the government out to get us, and it is completely the opposite. I’ve been a student of taxes for over 35 years. What’s really clear to me is that, there’s only one line in the tax law that actually raises revenue. There’s a line that says, basically, all income is taxable unless we say it isn’t. Then there’s about 29 pages of charts and tables that tell us how much to pay on that income. The rest of the tax law, the rest of the two and a half million words is an instruction guide on how to reduce your taxes. Once we get that in our minds, then all of a sudden … if we’re looking at this as, if I understand this, I can do something about it, which is different than, there’s nothing I can do.", "duration": "55:51", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI032.mp3", "type": "episode", "tags": ["Episodes", "legally pay less tax", "pay less tax", "ProVision", "ProVision Wealth Strategists", "Rich Dad Advisor", "tax free wealth", "Tom Wheelwright"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1452153660, "title": "13 Things Successful People Do Differently | PREI 031", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Welcome to 2016... We hope you had an awesome start to your New Year!\n\nI want to take a moment to wish all of you and your families a very Happy New Year!  We hope that 2016 is full of joy and prosperity.\n\nThe beginning of a new year lets us revisit and refine our investing goals.  And, as you know, our focus here is to educate, motivate and empower you to become better real estate investors.\n\nWe have big plans and goals for 2016, and we can't wait to share them with you.\n\nWhat goals have you set for yourself in the coming year?  What do you want to accomplish?  What habits do you want to change?\n\nIt should be no surprise that successful people had to do things differently to get to where they got.  They worked hard, made good decisions, stayed motivated and focused on what was important to them.  That will be you if you believe in yourself.\n\nHere are some things successful people did that you can do as well to achieve your goals.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "29:58", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI031.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1450944105, "title": "Pros and Cons of “Active” Real Estate Investing with Mike Hambright | PREI 030", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we discuss some of the pros and cons of \"active\" real estate investing -- the opposite end of \"passive\" real estate investing.  That means you're actively involved in the deal -- whether that is wholesaling, rehabbing, or flipping properties.  It's certainly not for everyone, but it can be a good business for those with the desire and time to do so.\n\nOur guest is Mike Hambright.  Mike is real estate investor, mentor and entrepreneur who has purchased and renovated hundreds of houses from when he started in 2008.  Mike recruits and mentors new franchisees into the \"We Buy Ugly Houses\" system.  And he's also the founder of FlipNerd.com.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "34:58", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI030.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1450339297, "title": "Nationwide Rental Property Insurance | PREI 029", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we continue our discussion about rental property insurance.  This is a supplement to the last episode on insurance.\n\nOur guest is Ed Babtkis -- the founder of Ross Diversified Insurance Services.  They are licensed in 49 states and insure thousands of properties around the United States.  They’re property owners themselves, so they fully recognize the need for customized insurance for real estate investors.\n\nOne of the unique things about Ross Diversified is their ability to cover rental property insurance on a nationwide basis.\n\nEd Babtkis can be reached at www.RossDiv.com or call them at (800) 210-7677.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "29:12", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI029.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1449734511, "title": "Rental Crisis in the US? | PREI 028", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Is there a Rental Crisis in the US?  It depends on how you look at it!\n\nIn this episode I look at the U.S. rental \"crisis\" and what it means for tenants and landlords.  What are the trends?  Are opportunities getting better or worse?  Where do we go from here?\n\nWhether you're starting out, or a seasoned real estate investor, this is a question worth investigating.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "18:43", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI028.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1449129709, "title": "How to Self-Manage Your Properties | PREI 027", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we discuss the considerations and process for self-managing your rental properties.  Can it be done?  Many people self-manage - even from thousands of miles away.\n\nOur guest is Lucas Hall, the Chief Landlordologist at Cozy, and the founder of Landlordology.com.  He has been a successful landlord for over 10 years, self-managing dozens of happy tenants.\n\nSome of the topics we discuss include:\n\n\tWhy did you choose to self-manage over hiring a professional manager?\n\tHow should an investor decide whether to self-manage or hire a property manager?\n\tWhat are the pros and cons?\n\tWhat is your management process?\n\tHow can the free tool at Cozy.co help a landlord?\n\tWhat tips can you share for self-managing landlords?\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "55:14", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI027.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1448524891, "title": "Property Management Secrets with Brenton Hayden | PREI 026", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we discuss the importance of property management and what things to consider when selecting and working with a property management company.\n\nOur guest is Brenton Hayden -- the founder and chairman emeritus of Renters Warehouse USA, a six time honoree of the Inc. 500|5000 list.  Brenton attended Harvard Business School and MIT’s Sloan School of Management and was named the youngest franchisor in America by Inc. Magazine in 2011 at the age of 25.\n\nBreton can be reached on LinkedIn at https://www.linkedin.com/in/brentonhayden.\n\nHis company's website is www.RentersWarehouse.com.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\n- - - - - - -\n\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. This is the show where busy people like you learn how to build substantial passive income while creating wealth for the long term. Today's show is a very important show about property management. As you know, my eighth rule of successful real estate investing is to use professional property management. You never should manage your properties on your own. There's a few exceptions to that, but generally speaking, it's not a good idea.\n\nProperty management is a thankless job and it requires a solid understanding of tenant landlord laws, a solid understanding of marketing skills, strong people skills. These are all things that allow you to deal with your tenants and your tenant complaints and excuses when they come up. You see, your time is your most valuable resource, it is precious. You should spend your time with your family, on your career, and looking for more investment property. Property management is not the thing you should be doing.\n\nWhat do you look for in a property manager? There's different reasons to have property management. For example, your property manager or at least the professional property manager will know how to market your property to keep it rented. Vacant rental properties are a drain on you and a drain on your cash-flow, and it doesn't make a productive asset. An experienced property management company will know how to aggressively market that property and keep it leased.\n\nThe second, you get better tenant screening, an experienced property management company is more likely to have an effective system for screening and qualifying tenants that will ensure that your property has quality tenants that will meet their financial obligations. That means that they'll take better care of your property too.\n\nThirdly, having a professional property management company will protect your investment. An experienced property management company will take better care of your property. Now, what do I mean by that? A property management company that has been in business for a number of years, they'll have seen and heard everything. They would have come across virtually every possible problem and scenario and be able to confidently handle those problems, as they arise, quickly and efficiently.\n\nLast but not the least, having professional property management makes owning your rental properties a more simple and convenient investment. You see, a company with years of experience in property management, they have systems in place. They'll be able to have a streamline process setup so owning rental properties becomes a simple passive, not disconnected, but a passive investment for you. That gives you the time to do other things while you still enjoy the financial benefits of owning that investment property.\n\n \n\n\n\n \nProperty Management Secrets with Brenton Hayden\n \n\nOn today's show, we have a very special guest, someone I’ve known for a great number of years.", "duration": "47:51", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI026.mp3", "type": "episode", "tags": ["Episodes", "Brenton Hayden", "property management", "property management company", "property management secrets", "Renters Warehouse USA"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1447315297, "title": "What Foreigners Need to Know When Purchasing Property in the U.S. | PREI 025", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we talk to Chris Picciurro, the co-founder of Integrated Financial Group, about the many important tax-related topics related to investing in the United States as a foreign national.  There's a lot to consider from withholding taxes, tax reduction strategies and asset protection.  This episode is full of great content and a must listen if you're an investor from any country outside the U.S.\n\nHis contact information is:\n\nChris Picciurro\n1 (888) 434-7791  x106\nwww.integratedfg.com\nhttp://www.linkedin.com/in/picciurro\nTwitter: @PiccCPA\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed \n\n\n\n \nWhat Foreigners Need to Know When Purchasing Property in the US with Chris Picciurro\nWelcome to Passive Real Estate Investing. I’m your host Marco Santarelli. I just finished recording an interview with a very knowledgeable CPA who’s the co-founder of Integrated Financial Group, and what we discussed is taxes. But don’t let that turn you off. Taxes as it relates to foreign national investors. If you are looking to invest in the United States or you have been investing in the United States, you’ll definitely want to listen to this episode. \n\nChris specializes in taxes for non-resident and non-US citizens that are looking to buy or are already purchasing investment property in the United States. He has some great advice. We stopped to look at estate taxes, withholding taxes, how to structure your entities. Now this is not case specific. We had to be somewhat general, but there’s so much great content. \n\nI hope you get a lot out of this episode as we talk to him about purchasing property here in the US. I hope you find this episode informative because tax laws can be complicated but it really comes down to a case by case basis. Stay tuned.  \n\nIt’s my pleasure to welcome Chris Picciurro. He is the Executive Officer and Co-founder of Integrated Financial Group. This guy has a list of credentials longer than my arm. I’m just going to highlight some of the stuff here. He has over 15 years’ experience as a CPA, including an adjunct instructor at Davenport University. He’s an Accounting Instructor with an MBA program, I think I got that right. He’s a graduate of Michigan State University. Has an MBA from the University of Detroit. He is extremely knowledgeable when it comes to taxes, especially as it relates to foreign investors. His list goes on and on. I’m not sure what this means but Chris maybe could tell us a little about it, Rich Dad Educational Events. Anyway, Chris, welcome to the show.\n\nHi, Marco, it’s good to talk to you again. How are you?\n\nI’m doing fantastic.  I’m excited to have you on the show here because we work with investors not only around the United States but around the world. A lot of them come from Canada, Australia, England, we have some people from Japan, so it varies. I know you can talk a lot about taxes as they relate to citizens within and outside the United States. But for today, at least, I want to put more of a focus on taxes as they relate to foreigners investing within the country. That’s framing this episode. Let’s start off by talking about where you’re located. Maybe you can explain this Rich Dad Educational Event.\n\nOur headquarters is in the Detroit Area, outside of Detroit, Michigan. Although the scope of our practice is not only throughout the United States but it’s throughout the world. We specialize in assisting non-US residents that buy investment property here in the United States. We have been very fortunate to work with clients in over 40 different countries at this point and our client base spans over 30 US States as far as where these investments are taking place in t...", "duration": "54:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI025.mp3", "type": "episode", "tags": ["Episodes", "asset protection", "Chris Picciurro", "foreign national", "Integrated Financial Group", "non US resident", "tax reduction", "tax-related topics", "withholding taxes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1446773042, "title": "Ask Marco – Top 10 Real Estate Books, How Important is a Property’s Age, Investing as a Foreigner | PREI 024", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode of \"Ask Marco\" we answer more listener questions including:\n\n\tDo you have any newspapers or real estate journals you read frequently?\n\tAny books you can recommend to someone with little capital?\n\tWhat benchmarks do you use when evaluating a property as it relates to the property's age?\n\tDo old houses appreciate as well as newer houses?\n\tDoes a remodel catch an old house up to new house profitability?\n\tWhat is the process like for a Canadian to invest in real estate?\n\tAnd more...\n\n \n\nHere is my list of the Top 10 Real Estate Investing Books\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "20:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI024.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1446153675, "title": "Client Case Study on Turnkey Real Estate Investing | PREI 023", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we talk to one of our youngest investor clients who is on track to purchase seven (7) turnkey investment properties this year.  He started at the age of 22, and plans to acquire a lot more next year in 2016.\n\nHe shares with you some tips and suggestions on how he got started, what he looks for in his investments and how you can do the same.  There is no magic, just following a system and doing your due diligence.  All this and more on today's episode.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nGet your FREE coffee mug by leaving us a Rating and Review on iTunes.  Here's how.\n\nSee all our available Turnkey Investment Properties.\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed", "duration": "49:30", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI023.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1445497319, "title": "The “Buy & Hold” Strategy with Linda McKissack | PREI 022", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Linda McKissack is an investor, entrepreneur, best-selling author, business coach, and a highly regarded speaker.  In 2013, Linda was co-author of the national best-seller “HOLD - How to find, buy and rent homes to build wealth”.  Her authenticity makes you believe – If she can do it then so can I.\n\nIn this episode we talk to Linda about the \"Buy & Hold\" strategy and her huge success investing in single-family homes.   She has accumulated 108 units in real estate, and is working on other passive income projects right now.  Her basic strategy and formula is:  Find, Analyze, Buy, Manage, Grow.\n\nHere is the Amazon link for her book:\n\nHOLD: How to Find, Buy, and Rent Houses for Wealth\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)", "duration": "45:02", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI022.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1444892439, "title": "Hot Investment Opportunities in Jacksonville, Florida | PREI 021", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Jacksonville is a very large coastal city located in the state of Florida.  Unlike some cities where white-collar or blue-collar occupations dominate the local economy, Jacksonville is neither predominantly one nor the other.\n\nWith a population expected to more than DOUBLE over the next 10 years, Jacksonville offers exceptional investment opportunities hard to find in most markets around the country today.\n\nIn this episode we explore the five key fundamentals that create the \"perfect storm\" for real estate investors in Jacksonville.  Listen in as we dive in and uncover a golden investment opportunity.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)", "duration": "42:24", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI021.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1444293489, "title": "The Truth about Property Insurance | PREI 020", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In today's episode I talk to one of my insurance agents (Joshua Dupree) to answer many common (and not so common) questions that real estate investors ask.  Insurance is a necessity but there is so much confusion surrounding what coverage to get, how much coverage, what deductible, and replacement cost versus actual cash-value.  All that and so much more.\n\nDon't miss this episode - it is full of great information that might have you review and questioning your current insurance policy.\n\nFor those interested, here is Joshua's contact information:\n\nJoshua Dupree\nMissouri Farm Bureau Insurance Services\n(816) 833-4440\nwww.mofb.com\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)\n\nWelcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. On today's show, we're going to talk about the truth about property insurance. We get a lot of questions from investors about where to get insurance, how much insurance, how high their deductible should be, what's covered and then there's the always confusing question about replacement cost versus actual cash value, which seems to be debated in perpetuity online in real estate forums. I wanted to bring my insurance agent on, a guy named Joshua in Missouri where I'm buying properties right now. I asked him a bunch of questions about property insurance, what's the proper coverage, how to compare different policies, how much deductible is enough, etc, etc. It's really not as confusing as you might think, but it's important to understand what you're looking at and how to compare one policy to another policy.\n\nWithout further delay, we're going to get him on here in just a moment. But before I do, I wanted to talk about a listener question that came in recently. The question was, \"Can I put my property in an LLC after I close with conventional financing?\" The short answer is, yes, you can. After you close escrow on your property and you take title, you can do whatever you want with your title. In other words, if you want to take it out of your name and put it into your LLC, for example a holding LLC, a limited liability company, you're more than welcome to do that.\n\nNow, keep in mind that lots of mortgage documents, most mortgage documents have what's called a due-on-sale clause. Technically speaking, if you do transfer title out of your name, when you have a mortgage on that property and you put it into another entity, you technically breached or triggered that due-on-sale clause. What that means is that if the lender wanted to, they could accelerate the loan and demand that the loan is due in full and payable immediately.\n\nNow, I've never seen that happen. I've heard of it happening. But I think to be quite honest with you, it is extremely rare because at the end of the day, if the lender is getting a payment every month like clockwork from you, they're not going to care anything about whether you're holding title in your name or in an LLC. They may not like it but they're not likely going to accelerate the loan because it's just too costly and too much of a risk for them to try and do that knowing that they’re going to get monthly payments as opposed to try and collecting the whole amount of that mortgage balance from you.\n\nIf you close escrow on a property, you could put it into a trust, you could put it into an LLC. You're free to do what you choose to do with it. Just keep in mind that there is this due-on-sale clause in the document, but you can hold title in any entity or trust that you choose. Many investors do this. It's not really a prudent thing to hold title to your rental portfolio in your name. It's a bit of an exposure. It's like having a target on your back saying, \"Look, I own all these assets.\" If you ever get into a lawsuit,", "duration": "52:01", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI020.mp3", "type": "episode", "tags": ["Episodes", "actual cash-value", "insurance agent", "insurance coverage", "insurance deductible", "insurance policy", "Joshua Dupree", "Property insurance", "real estate investors", "replacement cost"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1443513547, "title": "Ask Marco – Making the Leap, Due Diligence, The First Step | PREI 019", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode of \"Ask Marco\" we answer some listener questions.  Here is the actual email text:\nHello Marco,\n\nI'm looking to purchase my first investment property sooner rather than later.  I've been reading tons of books, blogs, and and listening to podcasts incessantly for the past couple of months, including the Passive Real Estate Investing Podcast (which is a great podcast. Thank you!)\n\nI live in NYC which has way too high an entrance cost into the market. Having lived in Portland Or for 9 years, I know the areas and market.  It has a much lower entrance cost than NYC.  But, I feel it's kind of at the top end of a boom and I would still need to save for about a year for down payment money.\n\nBeing a fan of your podcast I decided to look into Norada and was kind of blown away at how accessible rental properties are in other markets.  I got excited at the prospect of being able to acquire multiple properties within a year.  So, I guess my first question is addressing my lack of knowledge about these cities. I know NYC and Portland. I'm not too familiar with, say, Kansas City or Dallas and I'm uncertain of exactly what I'd be buying.  This is my biggest source of uncertainty.\n\nSecond, I love that Norada has a lot of the due diligence right there for each property.  But, in the spirit of \"trust but verify,\" what research would you recommend I put forward beyond the wonderful data provided?\n\nAnd lastly, say I saw a property you have on Norada and decided it was what I wanted to purchase.  What would the first steps be?\n\nThank you for your time and help,\n\nRobert F.\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)", "duration": "15:04", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI019.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1443078037, "title": "The Success Mindset with J. Massey | PREI 018", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we explore to importance of mindset and how some people achieve their goals faster and easier than others.\n\nOur guest is J. Massey -- a full-time real estate investor, entrepreneur, popular podcast host, author, speaker, coach and all-around problem solver.  He invests his time looking for investment opportunities (i.e. problems to solve through real estate transactions), and teaching others how to find and manage similar opportunities.\n\nIn 2014 he released his highly acclaimed book, Cashflow Diary: 10 Steps to Creating Wealth in ANY Economy!\n\nYou can get a free copy of J. Massey's book at www.CashFlowDiary.com/freebook\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)", "duration": "43:10", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI018.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1442476849, "title": "Market Spotlight: Stability in Atlanta, GA | PREI 017", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Atlanta is a large city located in the state of Georgia.  Atlanta is a decidedly white-collar city, with fully 89% of the workforce employed in white-collar jobs, well above the national average.  In addition, Atlanta is a major college town. As is often the case in college towns, the many students that live in Atlanta have a strong influence on the local culture and music scene.\n\nThe citizens of Atlanta are among the most well-educated in the nation: 46.8% of adults in Atlanta have a bachelor's degree or even advanced degree, whereas the average US city has 21.8% holding at least a bachelor's degree.  The per capita income in Atlanta in 2010 was $35,890, which is wealthy relative to Georgia and the nation.\n\nIn this episode we explore the greater Atlanta market and the reason why it might make sense for you to invest there.  We talk to one of our local market specialists, host of The Deal Farm podcast and long-time team member to learn more about the benefits that Atlanta has to offer.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available Turnkey Investment Properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nPlease give us a RATING & REVIEW   (Thank you!)", "duration": "25:52", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI017.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1441787253, "title": "How to Purchase Property in Other Markets | PREI 016", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Have you ever asked how do you purchase property in other markets or out-of-state? Well there is a clearly defined method that works every time.  It has been refined over the years and in this episode we break down that process into phases and talk about each one.\n\nSome of the topics we discuss include:\n\n \tSelecting a market.\n \tSelecting a neighborhood and property.\n \tDoing your due diligence.\n \tFinancing your purchase.\n \tThe closing process.\n \tWhat to do post-closing.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available turnkey investment properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nGive us a RATING & REVIEW   (Thank you!)\n\n\nHow to Purchase Property in Other Markets\nWelcome to Passive Real Estate Investing episode sixteen. I'm your host, Marco Santarelli. Welcome. Thanks for joining us again. Today's show is about how to purchase property out of state or out of your area or in another market. It's what I've developed over the years and I call it the purchase process checklist. Essentially, I started investing out of state from California in three different states back in 2004. I was buying up a lot of property in a very short period of time.\n\nThat process was not something that I knew exactly how to do from day one. It was a process that I learned very quickly. Through that process, I made a lot of mistakes, I did lose some money. But I also learned how to properly, quickly and efficiently identify investment opportunities, put them under contract, do my due diligence pre contract, post contract and get to a close.\n\nAlthough there's no rocket science in this process, it is important to understand. Because a lot of investors find this process to be somewhat foreign, especially if you haven't done it once or twice. Knowing what to look for and how to purchase property out of state or out of your local area is very important if you want to be successful. Because the truth is, a lot of people live in markets that are inflated and overpriced. The numbers just don't make sense there. For example, coastal markets like in California, New York, New Jersey. The rent to value ratios there are so low, they might be .5%, .4%, .3%. The numbers just don't make sense.\n\nOn top of that, those property values are so high that your investment capital, which is limited, will only go so far. When you look outside of your local market, you will find markets that are probably better off economically, have better opportunities, more choice for good quality income property. You'll find that your cash on cash returns are higher and your overall down payment will be lower, which means that you can take your fixed amount of down payment capital and leverage that into a larger real estate portfolio, meaning that you can purchase more properties than you could locally.\n\n\n\nLet's start with basically phase number one, that is select your market. Once you know what your investment strategy is and you've detailed out your investment criteria, then you can narrow down the markets that meet your strategy and criteria. In other words, there's over 400 markets in the US. You can't be in all those markets. It's also very difficult to know where to start. If you define your investment criteria, then you can eliminate majority of those markets and focus on certain ones. Obviously, we have our favorites. Within our company, we focus on about eight or nine different markets for various reasons, but they're all really good markets.\n\nIf you focus on maximizing your cash flow, then the markets you want to focus on are the ones that'll provide you higher rent to value ratios. These are typically what I call linear markets. Those are usually found in the midwest and parts of the southeast. If you want to understand linear and cyclical markets a little better, go back and listen to episode number six.\n\nIf your focus is to maximize your appreciation p...", "duration": "26:18", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI016.mp3", "type": "episode", "tags": ["Episodes", "build passive income", "business coach", "choosing the right neighborhood", "evaluate a market", "how to choose a market", "how to choose a neighborhood", "invest in the right market", "Purchase Property in Other Markets", "real estate counselors", "real estate entrepreneurs", "rental property tips"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1441263619, "title": "How to Track Your Real Estate Portfolio | PREI 015", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we talk to Joel Grasmeyer, a real estate investor, engineer, and entrepreneur who started PropertyTracker.com in 2004 to create user-friendly, yet powerful tools for real estate analysis.\n\nSome of the topics we discuss include:\n\n\tThe importance of tracking your rental properties.\n\tWhat metrics do most investors like to track?\n\tWhat tools do real estate investors use?\n\tWhat is PropertyTracker.com?\n\tMobile phone Apps that can also help investors.\n\nGet a FREE 30-Day Trial plus a 20% discount here:\n\nhttp://www.PropertyTracker.com/Norada\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available turnkey investment properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nGive us a RATING & REVIEW   (Thank you!)", "duration": "25:53", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI015.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1440672131, "title": "Financing Your Real Estate Investments | PREI 014", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we talk to Aaron Chapman, an 18 year veteran in the mortgage industry with a focus on real estate investors, about financing real estate investments.\n\nSome of the topics we discuss include:\n\n \tThe investor's mindset and why that's important.\n \tThe landscape of mortgage loans for investors.\n \tWhat is loan sequencing.\n \tMortgage loan products available today.\n \tQualification requirements.\n \tHow to finance more than 10 properties.\n\nYou can visit Aaron's website at www.BighausChapman.com.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available turnkey investment properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nGive us a RATING & REVIEW   (Thank you!)\n\n\nFinancing Real Estate Investments | PREI 014\nWelcome to Passive Real Estate Investing episode 14. I'm your host, Marco Santarelli. Today's show is about financing your real estate investments. This is a very important subject matter because real estate is an investment class that allows you to finance up to 80% of the purchase price using other people's money at historically low rates and control that property over the course of 30 years under a mortgage that is paid off by your tenant. This is incredible. Nowhere else in the world can you do this like you can in the United States.\n\n\n\nFinancing is a confusing subject because regulations are thick, they continually change, mortgage terms and interest rates fluctuate. It's hard to keep up on everything that's going on and the changes in the industry. There are people out there who really know their stuff and can help you in understanding and navigating this space in terms of strategizing your mortgage financing to getting the best product to help you finance those purchases. It's critical that you work with the right people.\n\nToday on the show, we have one of the mortgage brokers and portfolio lenders actually that we work with to help our investor clients finance their purchases, not only just get a loan but strategize on how to best finance all their properties and build their portfolio. The focus is beyond one property. You really should have a focus that encompasses your goals and where you want to go with your financing, where you want to go with your portfolio. It's not enough to say, \"I'll just pick a property today and I'll think about buying another one next year and we'll deal with the financing situation then.\" It's better to look at the big picture and just see where you have to go.\n\nFor example, we have some clients that want to purchase fourplexes and we have some clients that want to purchase single family homes. I advise that they start off by purchasing the fourplex first because the down payment amount on his first four mortgages would be five percent lower than the down payment on it as if he had purchased it later after purchasing the single family homes first. The net result to him was a down payment that was five percent lower by starting off with the more expensive property. Many investors know this but it's surprising how many investors really don't know what is referred to as mortgage sequencing. This is just an example.\n\nToday, I wanted to bring on one of the companies and one the people that we work with. Very smart guy, understands this space of mortgage financing for investors very, very well. He's an eighteen year veteran and his name is Aaron.\n\n\n\nIt's my pleasure to welcome Aaron Chapman to the show. He's an eighteen year veteran in the financing industry with a focus on real estate investors. He has a team of eleven total staff members who help him finance investment loans. He's been married for nineteen years, has four children. Here's an interesting fact, he's with the local sheriff's department and he's with the rescue unit and he has been there for six years. The part that he's in is the technical off-road and helicopter rappel rescue technician. Hopefully Aaron,", "duration": "40:52", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI014.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1440062025, "title": "Market Spotlight: Cash Flow in Kansas City, MO | PREI 013", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we take a look at Kansas City, MO and why it's such a great market for real estate investors.  Most investors are not even aware of the incredible opportunities available to them there.  So we'll dive in and take a look at why it's a great market and what you can expect to find for your real estate investment portfolio.\n\nKansas City is a largest city in Missouri made up of 147 constituent neighborhoods.  With a population of over 463,000 people in the actual city, the greater metropolitan population is expected to grow to 2,200,000 by 2020.\n\nThe overall education level of Kansas City citizens is substantially higher than the typical US community, as 29.6% of adults in Kansas City have at least a bachelor's degree.\n\nJobs are plenty with many large employers spread across a diverse range of industry sectors, and the cost of living is 15.3% below U.S. average.\n\nClick here to view the latest Kansas City investment properties.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee all our available turnkey investment properties.\n\nSUBSCRIBE on iTunes  |  Stitcher  |  Podcast Feed\n\nGive us a RATING & REVIEW   (Thank you!)\n\n\nMarket Spotlight: Cash Flow in Kansas City, MO\nWelcome to Passive Real Estate Investing episode 13. I'm your host, Marco Santarelli. Today's show is a market spotlight. Today we're going to look at Kansas City. We've been in Kansas City for about eight years with tremendous success. There is so much opportunity there and you could pick up properties in a wide range of price ranges, from $50,000 on the low end to $150,000, $160,000 on the high end. That's really not even the high end, you could get $200,000, $300,000 properties there, although I don't recommend those as investment grade properties. The numbers don't work out as well on those types of properties.\n\nKansas City has been growing year after year. It has a large growing population that is expected to increase to about 2.2 million by the year 2020. That's only about six years away. Kansas City is a large city in the state of Missouri. It has a population of about 470,000 people. It's made up of over 147 constituent neighborhoods. Kansas City has a very diverse economy. It's neither blue collar nor white collar. It's got a mixed workforce and it expands every sector, from healthcare to professionals, office workers, service providers, industrial, sales jobs, management type positions, administrative support, technology is a new big one.\n\nKansas City has more people living there that work with computers and math than 95% of places around the US. That's an interesting statistic. Of the large cities around America, Kansas City is one of the most car oriented. 83% of the people in Kansas City drive to work in their own car every day, most often alone. Also, the overall education level of Kansas City people or citizens is substantially higher than the typical US community. About 29.5% of adults in Kansas City have at least a bachelor's degree. The average American community has only 21.4%.\n\n\n\nAlso the per capita income in Kansas City back in 2010 was over $25,000 per person, which is actually wealthy relative to Missouri. It's considered upper middle income relative to the rest of the United States. What this means is it equates to an annual income of about $103,000 for a family of four. Kansas City contains every type of person. Its demographic ranges from the very wealth to poor people as well. It's not much different than any other metropolitan area.\n\nWe love Kansas City. We've been there for many years. We've had properties there from as little as $45,000 in B- neighborhoods all the way up to, like I said, $150,000 properties. Cap rates are very high so they're attractive to investors. Population is growing, median home price has been going up year over year for a number of years but not crazy high, double digit appreciation rates.", "duration": "49:26", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI013.mp3", "type": "episode", "tags": ["Episodes", "Cash Flow", "Cash Flow in Kansas City", "Kansas City", "local market specialists", "Mo", "real estate counselors", "real estate entrepreneurs", "real estate investing", "real estate investing tips", "real estate markets", "rental property tips"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1439458254, "title": "Passive Income Investing in Mortgage Notes | PREI 012", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode we talk to David Campbell, the founder and Hassle Free Cash Flow Investing.  He started investing in real estate part-time while he was working as a full time high school band director with zero net worth.  Within six years and before the age of 30, David had become a financially independent millionaire through the vehicle of part-time real estate investing.  David has been involved with new home construction, land development, commercial real estate and has been focused as a professional mortgage note investor for over a decade.\n\nYou will learn:\n\n\tHow to make money as the bank by acquiring an income producing mortgage note secured by quality real estate.\n\tWhy now is the best time in the market cycle to acquire a mortgage note.\n\tHow to buy a mortgage note to create a portfolio of tax-free and tax-deferred passive income for life.\n\tWhy the most savvy investors are buying real estate outside of their IRA and buying mortgage notes inside their IRA but usually not the other way around.\n\n \n\nGet your FREE copy of David's white paper on Mortgage Note Investing by emailing him at lending@hasslefreecashflowinvesting.com\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee our available turnkey investment properties.\n\nSUBSCRIBE ON ITUNES  |  Stitcher  |  Podcast Feed\n\nGive us a RATING & REVIEW", "duration": "56:44", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI012.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1439278257, "title": "Investing Using Your Retirement Accounts | PREI 011", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Since the early 2000′s, the number of self-directed IRAs has more than doubled!  These plans give individuals the ability to invest into assets that they understand and can control such as real estate.  Investors who have knowledge and expertise in a particular investment can purchase them in a tax-free or tax-deferred environment\n\nThe and Checkbook IRA and Solo 401k are viable solutions that allow you to investment in virtually any asset including real estate, provide you with “Checkbook Control” over your retirement account, and minimize or eliminate custodian fees.\n\nIn this episode we talk to Dmitriy Fomichenko the founder and president of Sense Financial Services LLC, a boutique financial firm specializing in self-directed retirement accounts with checkbook control.\n\nWe also take a look at another available turnkey investment property in our Deal of the Day segment.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee our available turnkey investment properties.\n\nSUBSCRIBE ON ITUNES  |  Stitcher  |  Podcast Feed\n\nClick here to give us a RATING & REVIEW", "duration": "37:39", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI011.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1438920668, "title": "Asset Protection for Real Estate Investors | PREI 010", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "The number one problem most real estate investors face today is knowing \"how to protect\" not \"what to protect.\"  Caught between attorneys, tax professionals, and self-proclaimed gurus, the average real estate investor finds himself awash in the quagmire of information and ideas with little coherency or consistency.\n\nUnfortunately, the reality is that most professionals do not understand the complex nature of real estate asset protection from the legal and tax perspective.  As a result you are left with a piece-meal plan based upon a fragmented stream of advice that seldom allows you to feel secure in your planning.\n\nIn this episode we talk to asset protection attorney Clint Coons to examine some of the entities and strategies used by real estate investors to protect their wealth.\n\nClint is a successful real estate investor and the manager of Anderson Business Advisors and Law Group.\n\nCheck here to get your Free Asset Protection Blueprint Consultation.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSee our available turnkey investment properties.\n\nSUBSCRIBE ON ITUNES  |  Stitcher  |  Podcast Feed\n\nClick here to give us a RATING & REVIEW", "duration": "37:18", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI010.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1438588859, "title": "Passive Investing in Syndicated Deals – Joe Fairless | PREI 009", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "From being the youngest vice president of a New York City ad agency to creating a company that in 6 months controlled over $7,000,000 of property, Joe Fairless lives up to his Fearless Fairless nickname. He’s the host of the popular podcast, Best Real Estate Investing Advice Ever show, and is closing on a 250-unit apartment this summer worth over $14,000,000.\n\nIn this episode we explore syndications and how they compare to smaller 1-4 unit residential properties.\n\nWe also take a look at another available turnkey investment property in our Deal of the Day segment.\n\n- - - - - - -\n\nDownload your FREE copy of:\nThe Ultimate Guide to Passive Real Estate Investing.\n\nSUBSCRIBE ON ITUNES  |  Stitcher  |  Podcast Feed\n\nClick here to give us a RATING & REVIEW", "duration": "35:42", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI009.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1438156820, "title": "5 Strategies to Benefit from Inflation | PREI 008", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Inflation normally results from government policies which create inflationary pressures.  The result of inflation can be best described as more money chasing fewer resources.  The sad reality is that for most people inflation truly is detrimental and a silent theft.\n\nReal estate investors are in a unique situation whereby they actually benefit from inflation.  The only ‘hedge’ against inflation that we are aware of that works consistently over time, in any market, and any economy is real estate.  But how?\n\nWhen you understand what inflation is, and how it benefits you as a real estate investor, you will want to build your real estate portfolio to take advantage of these powerful wealth building concepts.\n\nIn this episode we explore inflation and why it's your friend.  We also give you five (5) simple strategies to benefit from inflation in any market.\n\nWe also take a look at another turnkey investment property available in our Deal of the Day segment.\n\n- - - - - - -\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\nSUBSCRIBE ON ITUNES | Stitcher | Podcast Feed\n\nGive us a Rating & Review", "duration": "28:47", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI008.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1436999203, "title": "Choosing the Right Neighborhood | PREI 007", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Classifying a neighborhood by “type”, or what many investors refer to as a “grade”, is typically nothing more than a subjective description.  Although most people will have a general idea of what is being referred to, in my experience it is usually nothing more than a qualitative rather than quantitative description.\n\nBecause of that ambiguity, we’ve developed a proprietary, simple grading system that we use with all our investment-grade properties.  In this episode we help you to better understand neighborhood types.\n\nWe also take a look at another turnkey investment property available in our Deal of the Day segment.\n\n- - - - - - -\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\nSUBSCRIBE ON ITUNES | Stitcher | Podcast Feed\n\nGive us a Rating & Review\n\n\nChoosing the Right Neighborhood\nHello. Welcome back to another episode of Passive Real Estate Investing. I'm your host, Marco Santarelli. This is the show where busy people like you learn how to build substantial passive income and create wealth for the long term. Thanks for joining us again. Today's show is very important. It's about choosing the right neighborhood and how do you go about doing that. This is an important topic.\n\nA lot of people talk about neighborhoods and how they qualify them or grade them, but classifying a neighborhood by type varies from investor to investor. In fact, what many investors refer to as a grade is typically nothing more than a subjective description. Although most people will have a pretty general idea of what is being referred to, in my experience, it is usually nothing more than a qualitative rather than a quantitative description. The fact is, is there's no formal definition out there of what a neighborhood type or neighborhood grade is.\n\nIn fact, if you go back to episode number four where I talk about turnkey real estate investing and turnkey real estate investments, even there I have talked about there not being a formal definition of what turnkey real estate and real estate investments are. Everybody has a different idea or definition of what that might be. In an effort to level the playing field and define what that is, I've gone into some detail about that in episode four. If you haven't listened to that, be sure to take a listen.\n\nWith this ambiguity, we've, over the years, developed a somewhat proprietary but simple grading system that we use to grade all of our investment grade properties. To help you better understand this, I'm going to go over a basic overview and describe each of the neighborhood types and the grading system and what it means so you have an idea of what it should mean in case you don't know. If you have your own idea, I'm sure this is going to be fairly similar to your existing model or paradigm of neighborhood grading.\n\n\n\nHopefully, this will help you to better understand how to look at a neighborhood and grade it or put it into some sort of spectrum in order to compare one neighborhood from another and what may be a good choice versus what may be a bad choice. Ultimately, this comes down to what is your investment criteria. If you know what your goals are, you have a strategy, you've defined what your criteria is, finding the properties that fit that criteria to meet your goals becomes infinitely easier.\n\nLet's begin by describing the low income neighborhoods. These are typically what we call C and D grade neighborhoods. These low income neighborhoods generally have a large portion of their residence on government assistance. For example, the section eight housing program. The ratio of renters to owner occupied homes in these areas are often greater than 50% and more often they're as high as 80%. A C grade neighborhood would probably be 50 to 60, 70% tenant occupied. A D grade neighborhood would be as high as 80% or more. These are general metrics but it gives you pretty good idea. I do find that there is a pretty strong correlation in most neig...", "duration": "20:19", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI007.mp3", "type": "episode", "tags": ["Episodes", "choosing the right neighborhood", "grading property types", "how to choose a neighborhood", "investment grade properties", "neighborhood grade", "neighborhood type", "real estate counselors", "real estate entrepreneurs", "real estate investing", "real estate investing tips", "rental property tips"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1436367657, "title": "Understanding Linear and Cyclical Markets | PREI 006", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "What’s the difference between a linear real estate market and a cyclical market? Is one better than the other? Today we explore the different market types and what they mean to you as a real estate investor.\n\nWe also take a quick look at a turnkey property available in one of our linear markets with great cash-flow and high rates of return.\n\nWe also take a look at a real world example available today from www.NoradaRealEstate.com.\n\n- - - - - - -\n\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help us reach new listeners.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\nUnderstanding Linear and Cyclical Markets\nWelcome back to another episode of Passive Real Estate Investing. I'm your host, Marco Santarelli. This is the show where busy people like you learn how to build substantial passive income while creating wealth for the long term. Thanks for joining us. If this is your first time here, welcome. If not, we're glad to have you back.\n\nToday's show is about something that I talk about on a very regular basis. Something that most people understand conceptually but a lot of people still don't completely understand. This is really important if you're a real estate investor, especially when you're in the early stages of selecting what markets to invest in. This is the concept of linear and cyclical real estate markets.\n\n\n\nCyclical markets are real estate markets that tend to have larger price moves up and down over the years. Property values will move up and down like a roller coaster and they have noticeable peaks and troughs. They are essentially the shooting stars of the housing market. These are the markets that have the booms and busts. The length of the cycle can vary from market to market because, as you know, all real estate is local. That's the saying in real estate. These cycles can last from seven to ten years from end to end. Many of these cyclical markets are found along the east and west coast of the United States where the household incomes are higher and land for new construction is in short supply.\n\nGood examples would be coastal markets along the coast of California, New York, New Jersey, as well as many parts of Florida, from Miami on up north. When conditions are ripe and the annual housing price gains in these areas go up, you can see 20 to as much as 30% or more in property values in a single year. These are crazy rates of appreciation and they are absolutely not sustainable.\n\nYou may remember back in 2005, 2006, we've seen appreciation rates in southwest Florida, in the areas like Lee County go up 32 to 40% in a single year. There were two years back to back where they had large double digit returns. We all know what happened. Years later, that market became one of the ground zeros of the foreclosure crisis. Las Vegas, Phoenix, Riverside, California, southwest Florida, these were areas that had some of the largest number of foreclosures.\n\nWe saw property values increase dramatically and then come crashing down. These local booms burn themselves out by pushing prices to unaffordable levels. When those prices get to those unaffordable levels, very few, if any, people can afford to buy the median priced home. At that point, what happens is buyers dry up, there's an excess amount of supply and that equilibrium no longer exists. The pendulum swings from one end to the other and property values come crashing down since there's no one to buy these properties because of the lack of demand. You get a galette of inventory.\n\nI often refer to these markets as bubble markets because they appreciate in value so dramatically in a relatively short period of time but they come crashing down as the economy changes and brings property values back down as quickly as it went up. Often, at double digit rates.\n\nWe try to avoid these cyclical markets. In fact,", "duration": "14:09", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI006.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1435849220, "title": "Cash-Flow and Rates of Return | PREI 005", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In today’s episode we discuss the importance of understanding and calculating a properties cash-flow and rates of return. Specifically we look at capitalization rates, cash-on-cash returns, and the total return on investment (ROI).\n\nA good understanding of these numbers are required to make smart investment decisions and to be able to properly compare one investment to another.\n\nWe also take a look at a real world example available today from www.NoradaRealEstate.com.\n\n- - - - - - -\n\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help us reach new listeners.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\nCash-Flow and Rates of Return\nWelcome back to Passive Real Estate Investing. I'm your host, Marco Santarelli. This is the show where busy people learn how to build substantial passive income and create wealth for the long term. If this is your first time here, welcome. We're glad to have you. If you're returning, welcome back.\n\nToday's show is about cash flow and rates of return. This is something that every investor needs to know. It's important to know how your properties performing for you. Or if you're analyzing a property because you're looking to purchase, then it's important that you know how to analyze that property to know what the rates of return are and to be able to compare property to other investment options that you have. This is a very important topic today. I'm going to break this down into two main sections, cash flow and then rates of return. Both are equally important because the rates of return come from the cash flow of that property.\n\n\n\nLet's begin by talking about cash flow. Cash flow is loosely defined as the income from a property that's left over after all expenses and bills are paid. That's a simplistic definition and it's not exactly correct. Let's break it down. Income is obvious, it's the gross rental income that comes from a property. If you have a property and it rents for $1,000 a month, that is your gross rental income. Now, assuming that comes in every month, that will be what is collected by you or your property manager and from there, you would deduct expenses.\n\nSometimes you'll have other income coming in from a property. It's not that common but it is possible to have late fees from tenants who miss a payment or are late on their payment because rents are generally due on the first and late on the fifth. There may be a $50 or more late payment fee that will be charged and that's added income for you. Not all that common, but on larger properties and sometimes on fourplexes, you'll have income from a washer and dryer. For the most part, the income is made up of the gross rental income from that property.\n\nWhen it comes to expenses, there's a long list of potential expenses but there are few that you can't get around. The largest expense you typically have will be property taxes. Property taxes will vary from state to state, county to county. They're usually the highest expense and you can't get around them. Property taxes will vary from about one percent to as high as five percent. Texas, for example, will average somewhere around 2.2%.\n\n\n\nAt the end of the day, property taxes are a mandatory expense that you will have. Some people are under the false belief that if you invest in a state or a market where property taxes are high, that may not be a good deal or it should be avoided because it cuts into your cash flow. That's not true because taxes are relative to the income.\n\nIn most cases, again I use Texas as an example, you will find that even though you have higher property taxes relatively speaking, you also have higher income or rent. That income that your tenant is paying is going to make up for those higher property taxes. I say \"higher\" because again, it's all relative.\n\nThe next most common expense, and I will say it's a mandatory expense,", "duration": "32:51", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI005.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1434995742, "title": "Turnkey Real Estate Investing Explained | PREI 004", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Today’s episode discussed what “Turnkey Real Estate Investing” is and further defines what a turnkey real estate investment is. A good understanding of this is important to make smart investment decisions and help avoid common pitfalls and traps investors make when buying these types of properties.\n\nWe also discuss our 5-Point Success System to help you compare turnkey providers. Picking the right turnkey provider is not just about the property.\n\nWe’ll also provide some tips, advice and comments on due diligence, rent guarantees, unnecessary fees, and the “2% Rule”.\n\n- - - - - - -\n\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help us reach new listeners.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\nTurnkey Real Estate Investing Explained\nWelcome to Passive Real Estate Investing. If this is your first time here, we're glad to have you. If this is not, then we're glad to have you back. Today's show is about turnkey real estate investing. This is a topic that's near and dear to my heart because I've been involved with turnkey investments for about eleven and a half years now.\n\nI started investing out of state in late 2003 and I've seen the good, the bad and the ugly. Back then, turnkey real estate investing wasn't really a subject matter or term that was kicked around too much by real estate investors. People would talk about passive real estate investments, rent ready real estate investments, turnkey real estate investments. It was loosely defined and it was a general understanding of what turnkey meant. It wasn't a topic that had that much attention.\n\nIt does today. In fact, it's a hot topic. It's gained great popularity over the last ten years, especially over the last three or four. Today, it sees a lot of interest and controversy in real estate forums as well as other venues like real estate clubs.\n\n\n\nWhy is this important? First of all, I want you to understand what turnkey real estate investing is as well as what a turnkey real estate property is. These are two different things as far as the way I look at it. I'm going to break that down for you today. You need to understand what it is and what it isn't in order for you to make better decisions. That's my second objective today, is to help you make smart decisions when it comes to passive real estate investments or turnkey real estate investments.\n\nLet's break it down into different definitions and get a good lay of the land and then we can connect all the dots. This will hopefully educate you to better understand this particular area of real estate investing. From there, I'll give you five point system that we use to compare turnkey providers and turnkey companies. You can use the same system in order for you to look around and decide on who you want to work with and who's the better choice for you to help you achieve your goals and your criteria.\n\nRegardless of where you choose to invest, there are two opposite ends of the investing spectrum when it comes to your involvement and required resources. On the one end, you have the do it yourself model or the do it yourself investment style, what I call active real estate investing. This is essentially a business where you're active involved, rolling up your sleeves, maybe getting your hands dirty.\n\nDo it yourself real estate investing puts all the risk and responsibility squarely on your shoulders. Typically, that involves everything from sourcing the property, acquiring it, funding it, renovating it, maybe managing it, selling it and coordinating literally every step in the process. Of course, it's not likely you'll be involved in every single piece of that process by yourself, but you will be involved to some degree every step of the way. This is the most time consuming and often stressful option. But for some, it's what they enjoy.\n\nDo it yourself investing also requires the larges...", "duration": "28:09", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI004.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1434380403, "title": "Why Real Estate is the IDEAL Investment | PREI 003", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode Marco discusses why real estate is the IDEAL investment.\n\nReal estate is the most historically proven wealth creator.\n\n\n\nIn the episode we discuss what makes real estate the IDEAL investment.  We break down the five major elements of real estate and discuss when the best time to be investing is.\n\n- - - - - - -\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help share the word.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\nWhy Real Estate is the IDEAL Investment\nWelcome to Passive Real Estate Investing. I'm your host Marco Santarelli. This is the show where busy people like you learn how to build substantial passive income while creating wealth for the long term. If you're new to the show, I encourage you to go back and listen to the first two episodes. I cover some foundational and introductory information there. If you're joining us again, welcome back.\n\n\n\nWhy is real estate the ideal investment? Real estate has been the most historically proven wealth creator. More people, especially people in the middle class, have become millionaires and billionaires through real estate than any other investment in history. Back in 2012, Warren Buffett was interviewed on CNBC's Squawk Box and he said, and I quote, \"If I had a way of buying a couple hundred thousand single family homes, I would load up on them.\"\n\nThis really got a lot of people's attention, not just on Main Street but on Wall Street. In fact, since then, there have been a number of hedge funds that have come up with billions of dollars and invaded many markets across the country, starting with places like Phoenix moving east to Dallas, Houston, Atlanta. They just came in and they started buying up all they could possibly buy. They really didn't care about the rates of return as much as the fact that they wanted buy at a \"low price\" and just build up a portfolio.\n\nThe problem with buying real estate at the institutional level and on such a grand scale is that it's very difficult to do. This market, the real estate market, is a very fragmented market. It's a fragmented industry. Every real estate market is local and every market has its own real estate agents and brokers. It has its own set of property managers and inspectors and whatnot.\n\nIt's very difficult to manage this as an investment on a grand scale. But that's really an advantage for us as a real estate investor. We can take advantage of these inefficiencies of scale, this fragmentation. It helps us as real estate investors because it allows us what used to be called mom and pop investing. It allows us to really build a large business out of it or a really large real estate portfolio for ourselves so we have that passive income through the cash flow.\n\nReal estate is made up of many elements. It is not a simple one sided type of investment. Because of that, it makes real estate an ideal investment. Let me break that down. Why is it an ideal investment? Ideal is not just an adjective for real estate, it's also an acronym. Each letter in the word ideal represents a major benefit or factor of real estate.\n\n\n\nThe I in ideal represents income. Income is probably the most important ingredient when it comes to real estate or any investment for that matter. Because if you don't have cash flow from an investment, it really isn't much of an investment in my book.\n\nNot all investments provide income. If you were to go out and buy, let's say, $100,000 or $10,000 worth of stock from the stock market, unless you bought a blue chip company stock that pays an annual or quarterly dividend, there really isn't any cash flow, there is no income. That's what differentiates real estate from stocks and many other investments, is that real estate has a regular monthly predictable income stream or generation cash flow that you can count on. That is a key benefit.\n\nNow,", "duration": "21:10", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI003.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1434292813, "title": "10 Rules for Successful Real Estate Investing | PREI 002", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "In this episode Marco discussed his 10 Rules for Successful Real Estate Investing.\n\nAfter many years of successes and failures, Marco came up with the following rules of successful real estate investing.  These are the same rules he follows today and shares with investor clients at Norada Real Estate Investments.\n\nThis is an important and foundational subject so be sure to listen.  You can also read the original article here:  10 Rules of Successful Real Estate Investing\n\n\n\n- - - - - - -\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help share the word.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\n10 Rules for Successful Real Estate Investing\nWelcome the Passive Real Estate Investing. I'm your host, Marco Santarelli. This is our second episode of our exciting new show. This is the show where busy people like you learn how to build substantial passive income while creating wealth for the long term. If you're new and you missed the first show, I encourage you to go back and listen to that introduction. We cover passive real estate investing, what it is, how that compares to active real estate investing. It lays a good foundation of what the show is about and where we're going as well as an introduction about myself.\n\nToday we're going to talk about the ten rules for successful real estate investing. I find this to be very foundational and very important. After many years of successes and failures through acquisitions, dealing with tenants, managing myself, working with property managers, market ups, market downs, seeing speculation in the market, speculating myself, getting caught up in that whole frenzy back in the early 2000s and then riding down a deflating bubble, I've learned many, many things.\n\nOver the course of those years, I've come up with these rules for successful real estate investing. These are the same rules I follow today and they're the same rules that we share with clients at Norada Real Estate Investments, a company that I own and manage that sells turnkey investment properties nationwide here in the US.\n\n\n\nThe first is educate yourself. This is critically important and probably the most important rule. Knowledge is the new currency. If you don't educate yourself, then you are doomed to follow other people's advice. That applies to almost everything, whether you're talking about equities and the stock market or real estate or anything else for that matter.\n\nI like what Robert Kiyosaki talks about. He breaks education down into three categories. There's academic education, and this is what we all go to school to learn, the important stuff, the basics, what teachers teach us. This foundation is the reading, writing, learning and learning about the functions in the world.\n\nBeyond that, there's professional education. This is what we learn to help become successful within our careers. This is usually the stuff we learn in college or trade schools or maybe even on the job. It's information that we use for our profession. A good example would be attorneys or CPAs or dentists or trades people, like a machinist. This is information and skills that we need to be successful at work, at our job.\n\nThe third kind of education is what we call financial education. This is the type of education that teaches us what we should be doing with our money to be successful. In today's world, financial education is crucial, especially with the world, economy and recession or depression. However, our school systems don't teach us about financial education and so most people have never really been taught what they need to know in order to take control of their financial lives.\n\nIt surprises me that some people get out of high school and they don't even know how to balance a checkbook. Financial education is crucial. This all comes down to educating yourself, knowing about money, knowing about assets,", "duration": "25:23", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI002.mp3", "type": "episode", "tags": ["Episodes"]}, {"seriesId": 1006557991, "seriesTitle": "Passive Real Estate Investing", "pubDate": 1434206237, "title": "What Is Passive Real Estate Investing? | PREI 001", "author": "Expert Advice for Creating Wealth and Cash Flow through Real Estate Investing with inspiration by Robert Kiyosaki \"Rich Dad\" | A Smart Passive Income Alternative to the Stock Market, Dave Ramsey, Clayton Morris, BiggerPockets and Grant Cardone.", "summary": "Welcome to our first episode of *Passive Real Estate Investing*.  We are excited to have you and look forward to many content-rich episodes.\n\nIn this inaugural episode we take a minute to introduce our host, Marco Santarelli, as he shares his real estate investing journey which started at the age of 18.  We also lay out the goals for this podcast so you know where we will be taking you in future episodes.\n\nEnjoy the show!\n\n- - - - - - - - - - - - - -\n\nSubscribe on iTunes and Stitcher so you don’t miss an episode!\n\nPlease remember to RATE and REVIEW our show to help share the word.\n\nGet your FREE copy of The Ultimate Guide to Passive Real Estate Investing.\n\n\nWhat Is Passive Real Estate Investing?\nHello. Welcome to Passive Real Estate Investing. I'm your host, Marco Santarelli. This is a new show, a show where busy people like you learn how to build substantial passive income while creating wealth for the long term. If you desire to better yourself and desire to better your financial future, then this is the show for you.\n\nWhat's my goal with this podcast? It's to inspire you to start or continue building your real estate portfolio. It's to teach you proven strategies for making money with real estate in any market. It's to help you avoid the common and costly mistakes, many of which I've had and made myself over the years. It's to give you actionable tips and advice. It's to help put you on the road to financial freedom. Because without passive income, it's difficult or nearly impossible in today's environment to actually achieve true financial independence and retirement, however you define retirement.\n\n\n\nWhat is passive real estate investing? That's what this show is all about. In order to understand passive real estate investing, let's start by understanding what active real estate investing is. Active real estate investing is a do-it-yourself investment strategy. It involves your time, your capital, your risk. You are engaged and involved in the process, either entirely from beginning to end, or heavily in parts of the process as you go through it.\n\nIt takes up a significant portion of your time and involvement. It's really you and your time working for cash. It's you that makes it happen. It's you that's involved. It's, in many ways, like a job, JOB. If you look at job as an acronym, for many people it means Just Over Broke. It still a job, whether you're self-employed or not.\n\nThe primary objective is to generate chunks of cash. You do this through either assignments of contract or from the equity you build in a property, if you're rehabbing a property. I'll get to that in a minute here. The primary objective is to generate chunks of cash, piles of cash. It's really just a one or two time payment and that's it, there is no cash flow.\n\nLet me give you a few examples here. Wholesaling, although I don't really consider wholesaling by definition to be investing, because what wholesaling is, it's the assignment of a contract. It's not really selling a property, you're selling a contract that you have in tying up a property to another investor. You're getting an assignment fee. You're just controlling property, you don't technically own the property.\n\nThere's many ways to wholesale. Some people drive various neighborhoods looking for distressed properties, other people are marketing through post cards and whatnot. But that whole process of wholesaling takes time, it takes some capital, it involves some risk, although not risk in the property but risk in lost time. That's wholesaling. Once you sign that contract, you get a chunk of cash.\n\nAnother example of an active real estate investing strategy would be a quick flip. Some people like to look for properties that they could flip quickly. That could be because it's a distressed property and needs work or maybe it's a distressed homeowner and they can pick up that property up at a discount. You would essentially buy that property,", "duration": "22:31", "imageUrlLg": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/600x600bb.jpg", "imageUrlSm": "http://is1.mzstatic.com/image/thumb/Music71/v4/c1/5f/de/c15fde6d-57d5-e9a2-a0f6-37ebe863e5e2/source/60x60bb.jpg", "audioUrl": "http://media.blubrry.com/passiverealestateinvesting/traffic.libsyn.com/passiverealestateinvesting/PREI001.mp3", "type": "episode", "tags": ["Episodes"]}]}