{"series": {"feedUrl": "http://www.bloomberg.com/feeds/podcasts/odd_lots.xml", "genres": ["Business News", "Podcasts", "Business", "Investing"], "title": "Odd Lots", "country": "USA", "author": "Bloomberg News", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "type": "series", "id": 1056200096}, "episodes": [{"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1488580204, "title": "The Incredible True Story of the Real Life 'Trading Places'", "author": "Bloomberg News", "summary": "If you have any interest at all in finance, then it's mandatory to have seen the 1983 movie \"Trading Places.\" You remember, right? Two wealthy Philadelphia commodity brokers bet on whether anyone, even down-and-out Eddie Murphy, can be trained to become a successful trader. What you might not realize is that something very similar happened in real life. In this week's Odd Lots, we examine the amazing tale of the Turtle Traders. In 1983, successful commodities speculator Richard Dennis took out a full-page ad looking for novices to train in the art of trading. His novices -- who did spectacularly well -- studied for just a few weeks and were dubbed his \"Turtles.\" Joining us to tell the story is Michael Covel, who wrote a book on the Turtles, and Jerry Parker, a former Turtle who still trades using the same technique today.", "duration": "36:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v__yaZ.X9EFI/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1487972658, "title": "Could Buddhism Save The Global Economy?", "author": "Bloomberg News", "summary": "There's a widespread sense that something remains broken in the global economy. Despite a comeback in official measures of economic performance, like GDP and the unemployment rate, there's a widespread sense of disillusionment and discontentment with the status quo. Clair Brown, an economics professor at UC Berkeley teaches a class on Buddhist Economics and has written a book on the subject. On this week's episode of the Odd Lots podcast, Brown argues that the application of Buddhist principles could help economists and policymakers focus on what will actually satisfy people, as opposed to material measures that leave them feeling cold and empty.", "duration": "28:40", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vjCM1J1zzGHM/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1487367563, "title": "How Poker Explains the Battle of Passive and Active Investing", "author": "Bloomberg News", "summary": "Among the biggest trends in the world of markets is the rise of passive investing. Rather than pay high fees to active mutual fund managers (who often fail to beat the market), people are pouring money into passive strategies that track major indices, but with little cost. So what are the ramifications of this trend for investors who choose to remain active? On this week's Odd Lots podcast, we speak with Michael Mauboussin, who heads global financial strategies at Credit Suisse and is not just an expert on the world of investing, but also on the role of luck in success. As he sees it, trading is like a game of poker, and in poker you want to play against weaker, less-skilled players. But as more and more of those less-skilled players opt not to trade (choosing passive strategies) then the game gets harder.", "duration": "29:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vY4bPUpzrRMM/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1486763632, "title": "Why It's Really Hard to Create a New Currency in a Revolution", "author": "Bloomberg News", "summary": "Creating a new form of money is always tough. Will it hold its value? Will people trust it? Will people use it? All these challenges are even tougher if you're in the middle of a political chaos. On this week's Odd Lots, we speak with Rebecca Spang, a history professor at Indiana University and the author of a book about the monetary history of the French Revolution. Her book examines the disastrous attempt to create a new land-backed currency, the Assignat, in the late 1700s. The discussion sheds light on some fundamental issues that are still relevant today.", "duration": "28:03", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v1lAXumXKGZo/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1486159355, "title": "Why Negotiating a Ransom Is the Trickiest Trade in the World", "author": "Bloomberg News", "summary": "There are all sorts of reasons why markets break down. A lack of trust. Incomplete information. Divergent incentives. A lack of experienced actors. So it's hard to imagine a trickier market than kidnapping. Emotions are running rampant. You know very little about your counterparty. And there's no guarantee that anyone will stick to an agreement. On this week's Odd Lots, we speak with Anja Shortland, who is the research group leader for Political Economy of Peace and Security at King's College in London, about the economics of ransom payments, which she terms \"the trickiest trade in the world.\" We talk about the role of kidnapping insurance and professional negotiators -- and the huge mistake that most cinematic depictions of kidnapping make.", "duration": "30:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vcpQFIjf_pHs/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1485551500, "title": "64: Stay in School, Even if You're Planning to Join the Mob", "author": "Bloomberg News", "summary": "It's almost a truism that better-educated people earn more money. But suppose you're not interested in a normal job? What if you want to go into the mafia? Well, it turns out that you should still stay in school. On this week's Odd Lots podcast, we speak with Giovanni Mastrobuoni about the relationship between salary and educational attainment in organized crime. He's the co-author of a paper titled \"Returns to Education in Criminal Organizations: Did Going to College Help Michael Corleone?\" Based on data sets from the first half of the 20th century, Mastrobuoni and his colleagues were able to show that mafia members who got more education also got paid more in the underworld. We discuss how they discovered this, and what it means for the economics of education.", "duration": "26:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vbeu2yHZQ4g0/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1484950210, "title": "63: This Is How Monetary Policy Works in The Islamic State", "author": "Bloomberg News", "summary": "The Islamic State is mostly discussed in terms of its threat to the safety and security of the world. But as a geopolitical entity, its leadership has to deal with mundane considerations such as operating a financial system. So how does it work? On this week's Odd Lots podcast, the first in a series on money, markets and crime, we speak with Graeme Wood, the author of a new book about ISIS, about the monetary system and how it fits into ISIS ideology. We also discuss how ISIS uses the internet to promote its ideology and to recruit.", "duration": "27:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vOzWWvYv1A50/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1484346052, "title": "62: How The Biggest Bull Market Could Come Crashing Down", "author": "Bloomberg News", "summary": "The stock market is currently in one of its longest bull markets ever, but that doesn't hold a candle to what's going on bonds. According to Paul Schmelzing, a PhD candidate at Harvard and a visiting researcher at the Bank of England, you have to go back more than 500 years (!) to find a bull market in bonds longer than than the one we're experiencing now. After bonds tumbled since last summer (especially since the election) there's a lot of interest in whether we're on the cusp of a major downturn. In this week's Odd Lots, Schmelzing walks us through the history of bull and bear markets in bonds and explains why we could see some gigantic losses ahead.", "duration": "27:09", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vpRgTn2lRe1c/v6.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1483738206, "title": "61: Here's What's Going to Happen in 2017", "author": "Bloomberg News", "summary": "Welcome to the start of the new year! 2016 defied almost everyone's expectations, but that won't stop us from making predictions for 2017. On this episode of Odd Lots, we're joined by our Bloomberg News colleagues as we look ahead and forecast what will transpire in markets, politics, finance, economics and deals. Featuring: Max Abelson, Ed Hammond, Dan Moss, Megan Murphy and Mike Regan.", "duration": "28:31", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v.4RWdMjy_EQ/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1482525590, "title": "60: These Were the Most Interesting Stories of 2016", "author": "Bloomberg News", "summary": "It was quite a year, 2016! Trump and Brexit alone made it one for the history books. But there was more than political upheaval. In this end-of-year episode of Odd Lots, we speak to five reporters and editors from Bloomberg News to find out what they thought were the most interesting and important stories of the year. Among the huge stories that you might have missed: A momentous turn by the Bank of Japan, the incredible significance of the Mexican Peso, and of course, a Hamptons house party called #sprayathon. Featuring: Max Abelson, Ed Hammond, Dan Moss, Megan Murphy and Mike Regan.", "duration": "31:09", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vzV7kP4.gIzg/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1481927105, "title": "59: What Sneakers Can Tell You About How Financial Markets Work", "author": "Bloomberg News", "summary": "One of our favorite topics here at Odd Lots is market structure. On multiple occasions, for example, we've talked about how trading bonds is fundamentally different than trading stocks. This week our guest is Josh Luber, who has built a market for a non-financial asset: sneakers. The market for collectible sneakers (like Air Jordans) is worth over $1 billion, but it's very hard to get transparent pricing, in part because the action happens across a variety of different sites and venues. Luber explains how his startup StockX wants to unify the industry, bring about transparency, and fundamentally change how this market works.", "duration": "26:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vaUgtS9L3Q2w/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1481320123, "title": "58: Ignore Investing's Mathematical Underpinnings at Your Peril", "author": "Bloomberg News", "summary": "What's the optimum amount of money you should bet on a particular outcome? The answer is dictated by mathematics, yet plenty of people still go against the laws of numbers and probabilities when it comes to investing. This week, we speak with Victor Haghani, CEO of Elm Partners Management and the co-founder of the collapsed hedge fund Long-Term Capital Management, about the most important mathematical concepts for investing. We also discuss the pros and cons of quantitatively led finance.", "duration": "25:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vIawf4wDEhUQ/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1480718670, "title": "57: Was November the Start of a Huge Turning Point In Markets?", "author": "Bloomberg News", "summary": "Something huge happened in November. No, we're not talking about the U.S. presidential election. We mean the worst month in history for the the Bloomberg Barclays Global Aggregate Total Return Index, a bond market index that's more than two decades old. So is this the start of something big, or was it just a blip? In this week's episode, we speak with Bloomberg Strategist Mark Cudmore, a former FX trader, about what's happening in markets around the world. We talk about currencies, inflation, growth, China, the election, the eurozone and more... a full global tour!", "duration": "26:54", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v.9vZ7APynF0/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1480096962, "title": "56: How To Launch Your Own Form Of Money", "author": "Bloomberg News", "summary": "By now you've probably heard of Bitcoin. But Bitcoin isn't the only digital currency. In fact, there are hundreds of \"altcoins\" out there, all of which are different from Bitcoin in varying degrees. One of the hottest new currencies is ZCash, a digital currency designed to provide more anonymity than Bitcoin. And unlike Bitcoin, whose founder is pseudonymous and unknown to the public, ZCash was backed by a company with a known team. In the latest episode of Odd Lots, ZCash founder Zooko Wilcox explains how and why he launched his own currency and explains why anyone would actually use it.", "duration": "24:08", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vm6IT690FG4Q/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1479508212, "title": "55: Here Are The Signs That A Civilization Is About To Collapse", "author": "Bloomberg News", "summary": "All great civilizations eventually collapse. It's inevitable. So what are the signs of their demise? On the latest edition of Odd Lots, we speak with Arthur Demarest, a professor at Vanderbilt University who specializes in the end of civilization. Demarest is an anthropologist and archaeologist who's most well known for his work on the Mayans. He tells us about his work, what he's learned -- and what we should be watching out for today.", "duration": "0:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v3lfzeULqUJo/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1478899788, "title": "54: How Trump Did Something Yellen, Draghi Could Only Dream Of", "author": "Bloomberg News", "summary": "There's a lot to process from last week's U.S. election. One surprising thing already is the market reaction. Equities surged following the vote, and interest rates are sharply higher. Market measures of inflation expectations and Fed hikes now suggest that people see more inflation and more rate hikes in the future. This is something our top central bankers have had a very difficult time in doing. How come? On this week's Odd Lots, we spoke with David Beckworth, a research fellow at the Mercatus Center, about Trump, fiscal policy, monetary policy and the changing market outlook for interest rates and inflation.", "duration": "27:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vTYbpvIKA0LA/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1478293192, "title": "53: Why We Stopped Trusting Experts", "author": "Bloomberg News", "summary": "One could argue that \"expert\" has become a bad word. People routinely roll their eyes at the advice of experts and sometimes mock them. Perhaps nowhere is this more clear than the Federal Reserve. In the 90s, Alan Greenspan was lauded as the author of the great economy. Today, the Fed is a political punching back. On this week's Odd Lots podcast, Joe Weisenthal and Tracy Alloway talk to Sebastian Mallaby about Greenspan, experts and the huge changes at the Fed in the last couple of decades.", "duration": "30:21", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vpcolZV3O0Vc/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1477689568, "title": "52: What Math Models of Herding Cows Can Teach Us About Markets", "author": "Bloomberg News", "summary": "Investors are often said to exhibit herding behavior when they follow each other into crowded positions — creating market bubbles that are susceptible to sudden pops when everyone begins stampeding for the exit. This week we take the analogy literally and speak to three professors who have created a mathematical model to examine why cows synchronize their behavior and — crucially — why they stop. Jie Sun, Erik Bollt, and Mason Porter, the authors of \"A Mathematical Model for the Dynamics and Synchronization of Cows,\" extrapolate their findings to humans and modern markets. This episode is co-hosted by our resident bovine expert, Lorcan Roche-Kelly.", "duration": "0:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vcOSKEmm1u2Y/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1477084215, "title": "51: Why Everyone Is Freaking Out About Globalization", "author": "Bloomberg News", "summary": "Dani Rodrik, a professor of International Political Economy at Harvard University, was writing about the downside of globalization before it was cool. The rise of Republican presidential nominee Donald Trump, the U.K.'s decision to leave the European Union and the expansion of nationalist political parties around the world has since given fresh impetus to the notion that globalization isn't working for everyone. In this episode we discuss how we ended up with 'hyperglobalization,' what the technocrats got wrong, and what exactly can be done to fix it.", "duration": "33:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v3Hz3D4fdctQ/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1476478200, "title": "50: What Slavoj Žižek Would Say About Poker and the Peso", "author": "Bloomberg News", "summary": "What does psychoanalytic philosophy tell us about capitalism? In this edition of Odd Lots, we speak to Ole Bjerg, a professor at the Copenhagen Business School. Bjerg studies the work of Slavoj Žižek, a Slovenian philosopher, and also writes about matters of finance, markets and money. In this episode, Bjerg discusses the game of poker and what it says about capitalism as a whole.", "duration": "31:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vGGw.NndvHYA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1476279138, "title": "49: The Man Who Wants to Better Trading by Slowing It (Correct)", "author": "Bloomberg News", "summary": "Brad Katsuyama has racked up oceans of newspaper ink since being propelled into the public spotlight as the protagonist of Michael Lewis's book on high-frequency trading, Flash Boys. The 38-year-old co-founder and chief executive of IEX, an exchange with a 'speed bump' designed to slow down lightning-fast traders on behalf of longer-term investors, won U.S. regulatory approval in June. In this special edition of Odd Lots, Katsuyama speaks with Bloomberg View Columnist Matt Levine about the next big steps in stock market structure. (Corrects episode number in headline)", "duration": "0:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vd8S_ZAtQUSA/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1475499132, "title": "48: The Lost History of Financial Market Modernization", "author": "Bloomberg News", "summary": "How is it that stocks are traded on electronic exchanges in the blink of an eye but bonds still trade over-the-counter by phone and sometimes even by fax? Today we discuss one of the most pervasive mysteries of market structure with Chris White, the former Goldman Sachs executive who's now CEO of ViableMkts, and his old boss, Les Seff, COO at AIMPaaS LLC, to discover why bond trading remains so darn old-fashioned despite numerous attempts to pull it into the 21st century. Looking back at history, we can see a pattern to market modernization that was initiated by the OTC equity market almost 50 years ago. Can this history provide us with insights that can put fixed income markets on a path to modernizing?", "duration": "27:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vmu_HY4NXNt4/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1474665909, "title": "47: Why it's Time to Stop Using the Word 'Disruption'", "author": "Bloomberg News", "summary": "\"Disruption,\" \"incubation,\" \"innovation\"... you hear these words nonstop these days as people talk about the incredible changes taking place in society thanks to technology. This week on the Odd Lots podcast our guest tells us we all need to stop. Or at least use these words a lot less. Lee Vinsel is a professor of science and technology studies at the Stevens Institute of Technology and he explains the harmful impact of language and buzzwords, and why we need to focus more on \"maintaining\" the infrastructure and technology that sustains everyday life.", "duration": "27:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vjjevw7cRN5A/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1474064800, "title": "46: Space Robots Are Helping Hedge Funds Invest", "author": "Bloomberg News", "summary": "The most valuable commodity for investors is information, and hedge funds and asset managers are going to great lengths to get it -- even to outer space. This week on the Odd Lots podcast, Tracy Alloway and Bloomberg View columnist Matt Levine are joined by James Crawford, a former NASA scientist who founded Orbital Insight. Crawford's company uses satellite photos to do things like track retail sales by studying parking lots and track oil supplies by scanning global oil tanks. He explains how his company figures out what to look for and how to look for it, and how investors and governments use his information to make decisions.", "duration": "28:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vG8b86feV1Ok/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1473697347, "title": "45: Why A Whistleblower Walked Away From Over $8 Million", "author": "Bloomberg News", "summary": "Could you walk away from a reward of over $8 million? The guest on our latest episode of the Odd Lots podcast did just that. Eric Ben-Artzi was a risk officer at Deutsche Bank who concluded that his bank was mis-marking the assets of part of his derivatives portfolio to a significant degree. When he couldn't get his colleagues to reprice the derivatives he called a hotline and blew the whistle, ultimately leading to a huge reward. In this episode he explains what he saw that was wrong and why he ultimately didn't take the money.", "duration": "33:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vZt3l_YP2Sbw/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1472847901, "title": "44: What a 12-Year Knows About Money That an Economist Doesn't", "author": "Bloomberg News", "summary": "\"What is money?\" This seemingly simple question has the ability to drive people crazy. Is it a unit of account? Is it something about exchange? Does it have to be blessed by the government or backed by something hard? On this week's podcast, we speak with fund manager Eric Lonergan, the author of \"Money (The Art of Living),\" to answer this question as well as the other vexing ones that spring from it. Ultimately we get an answer that's as simple as the question itself, one that would make more sense to a typical 12-year-old than an economist.", "duration": "0:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vMYhBavsi13U/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1472479736, "title": "43: Seinfeld Can Teach You Everything You Need About Economics", "author": "Bloomberg News", "summary": "The hit show Seinfeld is often referred to as the show about nothing, but maybe it's actually a show all about economics. Alan Grant is an associate professor of economics at Baker University and a proprietor of The Economics of Seinfeld, a website that catalogues all the ways the legendary sitcom imparts valuable economic lessons. In the latest edition of the Odd Lots podcast, Grant talks about what you can learn from watching the show, and the specific lessons of various episodes, including The Chinese Restaurant (a lesson in opportunity cost), The Contest (a lesson in time preference) and the apartment (rationing mechanisms and rent control).", "duration": "21:31", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vGN049JuxUC8/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1471872464, "title": "The Millennial Generation Is Stagnant And Older People Are Part", "author": "Bloomberg News", "summary": "In developed economies, younger generations have faced stagnant wages, mediocre employment prospects and dizzying costs of homeownership. One culprit: The generations that came before. Policies that helped older generations recieve strong pensions and affordable housing have made life more difficult for the young. In this week's Odd Lots podcast we talked to Laura Gardiner of the Resolution Foundation about her new report on \"renewing the generational contract\" between generations.", "duration": "26:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vaejK5O9ZnqA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1471267055, "title": "41: Billionaires Help Tell the Story of Brazil's Boom and Bust", "author": "Bloomberg News", "summary": "The 2016 Summer Olympics in Rio de Janeiro have been tainted by protests, economic slowdown, and a massive political scandal. In this episode we take a look at Brazil's boom and bust as told through the prism of the country's elite. Alex Cuadros is the author of \"Brazillionaires: Wealth, Power, Decadence, and Hope in an American Country.\" He tells how a commodities boom gave rise to larger-than-life Brazilian billionaires including mining mogul Eike Batista, soybean farmer-turned-senator Blairo Maggi, and beer-and-burger-king Jorge Paulo Lemann. He tells us why 'Brazillionaires' sometimes argue over their place on public wealth rankings, what happened when Batista's Porsche went missing, and how Brazil's billionaires favor dead bugs in their decorating.", "duration": "31:44", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vKXrn9YdPWUk/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1470662927, "title": "40: Why Summer Has Just Gone on Sale", "author": "Bloomberg News", "summary": "This week is the summer edition of Odd Lots and we're talking about the market forces shaping the price of two essential ingredients for any pool party: inflatable toys and barbecue meat. Bloomberg Reporter Polly Mosendz walks us through the $4 million dollar battle blowing up over the inflatable pool toys popularized on Instagram and now the subject of a major dispute between retailers vying for the top sales spot on Amazon Inc. Then Bloomberg's Lydia Mulvany tells us why meat prices are cheaper than ever and the cost of grilling staples including burgers, ribs and pork chops could go even lower. So grab your inflatable donut, pick up your BBQ tongs, and join the Odd Lots fun.", "duration": "20:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vxerx11u7R9Q/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1469824008, "title": "39: The Insurance Market for Modern-Day Pirates", "author": "Bloomberg News", "summary": "This week Odd Lots takes to the high seas to discuss how modern-day pirates in the form of illegal fishers are able to take out insurance policies on their blacklisted boats. We speak with Dana Miller, a marine scientist who published a study last month showing a significant number of insured illegal vessels. We discuss how one of the world's most regulated financial industries interacts with one of the world's most lawless and whether new processes introduced by insurers could help boost the world's supply of fish.", "duration": "21:11", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vr0FNPNkAjDE/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1469467085, "title": "38: The Fed Made a Massive Mistake Letting Lehman Go", "author": "Bloomberg News", "summary": "There's nothing better than financial crisis hindsight and earlier this month we got a big dose of it in the form of a 218-page paper by Laurence Ball, Department of Economics Chair at Johns Hopkins. In the paper, Ball makes the case that — contrary to statements by some policymakers — Lehman Brothers could have been rescued back in 2008 and the U.S. made a massive mistake in choosing not to do so. We talk to Ball about the genesis of the paper and what it means for markets today.", "duration": "26:30", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vcpqYm.jHTwk/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1468848577, "title": "37: Why We Are Increasingly Divided Into Ideological Bubbles", "author": "Bloomberg News", "summary": "The result of the U.K.'s Brexit referendum blindsided many and led to acrimonious accusations by supporters on either side of the vote. In the U.S., the rapid rise of Donald Trump and Bernie Sanders as presidential candidates has similarly surprised. Those able to properly gauge the public mood have made money, while those without their fingers on the pulse have lost it. This week we speak to Sean Blanda, editor in chief of 99U and the author of a recent article on why \"The Other Side Is Not Dumb.\" We discuss the balkanization of world opinion, why the proliferation of social media ends up dividing us instead of bringing us together, and how best to break out out of one's own ideological bubble.", "duration": "23:09", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vylfM0NgVUK8/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1468257151, "title": "36: How A Quant Saw Huge Changes That Took Place on Wall Street", "author": "Bloomberg News", "summary": "Emanuel Derman was one of the pioneers of quantitative finance, having gone from studying physics to working on Wall Street in 1985. His memoir, My Life as a Quant, is a must-read book that tracks the evolution of finance in recent decades as it's become more and more driven by mathematics. In the latest episode of Odd Lots, Derman discusses his career, the difference between finance models and physics models, and where Wall Street is going next.", "duration": "29:35", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vEoW9b4SMXvA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1468257140, "title": "36: How A Quant Saw Huge Changes That Took Place on Wall Street", "author": "Bloomberg News", "summary": "Emanuel Derman was one of the pioneers of quantitative finance, having gone from studying physics to working on Wall Street in 1985. His memoir, My Life as a Quant, is a must-read book that tracks the evolution of finance in recent decades as it's become more and more driven by mathematics. In the latest episode of Odd Lots, Derman discusses his career, the difference between finance models and physics models, and where Wall Street is going next.", "duration": "29:35", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vJT_49yXJanw/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1467401246, "title": "35: There Was a Huge Opportunity The Night of the Brexit Vote", "author": "Bloomberg News", "summary": "In the runup to the Brexit vote polls were mixed. Some showed remain winning. Others showed leave winning. Nonetheless, markets, pundits, and bookmakers always seemed to be pretty sure that remain was going to win. Whoops! In this episode of Odd Lots, we speak to Mike Smithson, an expert on political betting in the UK. He explains how the markets got it so wrong and how, on the actual night of the vote, there were some huge opportunities for gamblers willing to take the right risks.", "duration": "22:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vmUh3vN4reZA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1467034163, "title": "34: The Highway Built by Oil Markets and Political Intrigue", "author": "Bloomberg News", "summary": "On this week's episode we take a trip down one particular road on the Gulf peninsula to explore how sudden market shocks — and the political discord that sometimes comes with them — can help shape the physical space around us. In the 1960s, the Middle East was in the throws of massive change as the oil boom sent some economies skyrocketing and left others in the (literal) dust. The construction of the E11 highway in the Trucial States — which would later grow into the United Arab Emirates (UAE) — became a lightning rod for political intrigue and developmental subterfuge involving British interests and the Arab League at a time of mass economic upheaval. Today the highway stretches across the UAE and links its two biggest cities, Abu Dhabi and Dubai. Matthew MacLean is a Ph.D. Candidate in History and Middle Eastern Studies at New York University. He joins us to discuss the building of one of the UAE's first paved roads and the rise of the country's car culture.", "duration": "20:53", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vKwcFnK.AwAA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1466429985, "title": "33: How ``Fed Watching'' Became a Thing", "author": "Bloomberg News", "summary": "When Federal Reserve Chair Janet Yellen speaks, the world watches — and one group watches especially closely. ``Fed watchers'' have made a career out of analyzing and dissecting the words and actions of Fed policymakers, particularly in the aftermath of the 2008 financial crisis that has seen the U.S. central bank launch thousands of stimulus programs. This week we speak to one of our favorite Fed watchers. Tim Duy is the professor of practice and senior director of the Oregon Economic Forum at the University of Oregon, a Bloomberg contributor and author of the aptly named Tim Duy's Fed Watch. He walks us through how the central bank came to dominate market discourse, and gives his tips on how best to engage in a bit of Fed watching of one's own.", "duration": "25:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vrfLZD4s6pCo/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1465823721, "title": "32: The Amateur Activists Who Took On The Foreclosure Machine", "author": "Bloomberg News", "summary": "The Great Recession was characterized by a historic and gigantic wave of foreclosures all around the country. Left and right, people were being removed from their homes. But because of the explosion of mortgage securitization -- the slicing and dicing of financial assets that got Wall Street into so much trouble -- there was often a failure to do the proper paperwork required for such evictions. This week on Odd Lots, we talk to David Dayen, the author of the new book Chain of Title, about a group of activists in Florida who self-taught themselves to become experts on securitization and foreclosure law in order to fight back in court against what they argued was fraudulent activity.", "duration": "26:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v1m63B2dTclQ/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1465218583, "title": "31: Welcome Aboard Starship Bank", "author": "Bloomberg News", "summary": "David Hendler made his reputation as a bank analyst at the independent research firm CreditSights Inc., foreseeing many of the problems that led to the financial crisis of 2008 and vocally criticizing the \"too good to be true\" trading profits posted by big financial institutions. Today he runs his own consultancy, Viola Risk Advisors LLC. He joins us this week to talk bank business models of the past, present, and future. We tackle some of the biggest topics in the financial industry — are bond trading desks permanently broken or just on an extended vacation? What will the lender of the future look like? And where do current risks in banking lie?", "duration": "19:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v1T23STGYFsk/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1464380497, "title": "30: How Finance Took Over the World", "author": "Bloomberg News", "summary": "The U.S. spends 8 percent of its GDP on finance -- twice the amount it did 40 years ago, according to economist Brad DeLong. That figure set off a wave of soul-searching recently as commentators asked how ``the financialization of the world'' came to be and others attempting to answer that very question. This week, we speak with Satyajit Das about how finance took over the economy, markets and monetary policy. A former banker, trader and corporate treasurer, Das is well-placed to walk us through the development of global financialization and its pitfalls. Along the way we talk bonuses, negative interest rates, home safes and (of course!) alien invasions.", "duration": "23:02", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vDt25AS7qlJ0/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1464034835, "title": "29: How an Old-School Chess Shop Survives in Modern New York", "author": "Bloomberg News", "summary": "At a time when retail sales are dominated by online behemoths like Amazon Inc. and big chain stores, independent brick-and-mortar shops are under growing pressure. Imad Khachan defies the odds to run the Chess Forum in New York's Greenwich Village. Here, chess fans can buy game sets or compete against each other for a small fee. It's an old-fashioned business model under assault by the digital world on two fronts as more chess players opt to compete online. We talk with Khachan about the challenges of running his dark horse-chess enterprise.", "duration": "24:18", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vjQvAjyIq0QM/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1463174940, "title": "28: Finance's Hot New Thing Ended Up In An Old-School Scandal", "author": "Bloomberg News", "summary": "Peer-to-peer lending was supposed to disrupt the traditional way people borrowed money. Instead of going to some giant, soulless institution, online platforms offered a way for people to post what they needed to borrow money for, and for other individuals to loan them the money. In other words, rather than have a bank match up savers and borrowers, why not just cut out the middle? But as the industry has grown up, it looks more and more like the old establishment firms it was trying to disrupt. And now, the industry faces an old-school scandal. This week, Odd Lots co-host Tracy Alloway (who is an expert on these firms) explains how it all happened.", "duration": "25:49", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v83ykX2ChRbc/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1462367610, "title": "27: Kentucky Derby Edition: Flip This Horse", "author": "Bloomberg News", "summary": "If you're like most people, you only bet on horses once a year, the day of the Kentucky Derby. You might try to cram a little beforehand, bone up about the favorites, and then place an ignorant losing wager. This year can be different! On this week's Odd Lots, our guest is Bloomberg's David Papadapolous, who in addition to his day job as a top editor is our resident expert on all things equine. Papadapolous explains the art of pinhooking -- buying a horse at auction and then flipping it -- and the tricks of the trade that a veteran horse handicapper uses to find \"value\" in a bet. He also offers some specific insight that you can use to make an educated Derby wager.", "duration": "30:08", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/voUVOKqtHc9U/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1462195048, "title": "26: How To Make Money By Betting On The U.K.’s Big Referendum", "author": "Bloomberg News", "summary": "In less than two months, the U.K. will vote on whether to leave the EU in the so-called Brexit referendum. The stakes are potentially massive for the economies of the U.K. and Europe, for the London financial industry and for the British pound. Gamblers also have a lot on the line. This week on Odd Lots, hosts Tracy Alloway and Joe Weisenthal speak to Mike Smithson, the editor of PoliticalBetting.com, an expert on, well, betting on politics. Smithson takes us through the history of political gambling and offers tips on how to make money on this vote, as well as future political events.", "duration": "22:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vRDb9lVa1Ihc/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1461590213, "title": "25: Americans Are Miserable, and It's Swaying The Election", "author": "Bloomberg News", "summary": "How can you tell whether people in any given country are happy or not? That's the topic we wrestle with on the latest edition of the Odd Lots podcast. First we talk to Peter Atwater of the firm Financial Insyghts about the growing signs that a significant swathe of the population is depressed and how that's showing up in markets, the culture and of course the election. Then we speak to Bloomberg Intelligence economist Carl Ricadonna about the so-called Misery Index, a super simple way of measuring the economy that has a surprisingly good track record for predicting Presidential results. We talk about the history of this indicator, and what it's telling us ahead of the November vote.", "duration": "27:31", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vbxCYsF5OWHM/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1460748910, "title": "24: Meet The Most Important Country Singer in Economics", "author": "Bloomberg News", "summary": "Country music lost a legend when Merle Haggard passed away earlier this month at the age of 78. At first glance, there doesn't seem to be much connection between Haggard's music and markets (excluding the fact that he once pined for the days of silver-backed currency in one of his songs), but there is a country music artist that bridges the gap between Merle and this podcast.\n\nMerle Hazard, the nom-de-twang of Nashville-based money manager Jon Shayne, became famous online for his endlessly catchy songs explaining economic topics during the financial crisis and featuring lyrics such as: \"Inflation or deflation, tell me if you can, will we become Zimbabwe, or will we be Japan?\" He's continued to play and write new songs since then, including one recently assessing the outlook for interest rates.\n\nIn this week's episode, Hazard reveals all about his life as country music's most economically-sophisticated singer.", "duration": "22:47", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vV2CDbFK0rjE/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1460148414, "title": "23: Iceland Jailed Its Bad Bankers But People Are Still Angry", "author": "Bloomberg News", "summary": "Iceland is known for geothermal beauty, fishing and as the birthplace of Bjork. It also made international headlines in 2008 thanks to a banking crisis that tipped the country into recession and reverberated around Europe. Now, Iceland is back in the headlines after the leak of the so-called Panama Papers unveiled offshore accounts held by Iceland's prime minister and sparked mass protests that eventually unseated him.\n\nWhile the island nation is one of the few countries that sent bankers to prison after the financial crisis, discontent remains rife among its small population, underscored by the rise of the anti-establishment Pirate Party.\n\nJoining us to discuss all things Icelandic are Edward Robinson and Omar Valdimarsson, authors of Welcome to Iceland, Where Bad Bankers Go to Prison from the latest edition of Bloomberg Markets magazine.", "duration": "29:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vNXQ7huXrRmQ/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1459778782, "title": "22: The Unbearable Brightness of Being a Shadow Bank", "author": "Bloomberg News", "summary": "A high-flying hedge fund manager lost everything back in 2007 after an accounting scandal prompted investors to pull money from his $12 billion fund. Almost a decade later, Dan Zwirn has been cleared of all wrongdoing by U.S. securities regulators and is busy rebuilding his investment empire, specializing in lending to companies that don't usually have access to traditional bank financing.\n\nZwirn's new fund, Arena Investors LP, is one of a crop of so-called shadow banks seeking to plug a financing gap exacerbated by the financial crisis and new regulation. Max Abelson of Bloomberg News co-hosts this week's episode, in which we talk the pros and cons of non-bank financial intermediation.", "duration": "27:07", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vt8ME8OxJZLI/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1459176096, "title": "21: The Fraught Life of a Dumpster-Diving U.S. Short-Seller", "author": "Bloomberg News", "summary": "Short-selling, the practice of betting against stocks by agreeing to sell equities that you don't own, has been in the headlines recently. The share price of Valeant Pharmaceuticals International Inc. has fallen nearly 90 percent from its peak since being targeted by prominent short-sellers including Citron Research's Andrew Left and Bronte Capital's John Hempton, while some other types of short-sellers have been given the Hollywood treatment with the release of the film version of Michael Lewis's The Big Short.This week, Tracy joins forces with Bloomberg Markets Reporter Luke Kawa, to take a look at the fraught life of the American short-seller. We speak with Marc Cohodes, managing general partner at Copper River Management LLC, well-known short-seller and part-time chicken farmer. Known for his high-profile campaign against Overstock.com, Cohodes highlights the less glamorous side of short-selling including protracted legal battles and sifting through trash cans for clues to a company's sales volume. He also speaks about the social benefits provided by short sellers, the fine line they must walk during public battles, and why Canadians can't stand when someone bets against a domestic company.", "duration": "25:16", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vWxkOGfIeVCU/v6.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1458574594, "title": "20: The Time NYSE Floor Traders Tried to Prank President Reagan", "author": "Bloomberg News", "summary": "For years, the image of a stock market trader was synonymous with images of Testosterone-fueled traders wheeling and dealing on the floor of big exchanges. But change has swept stock markets in recent years, diminishing their role in everyday trading. Now, the vast majority of stock trades take place through computerized systems, giving rise to huge debate over the dangers and benefits of high-frequency and automated trading.\n\nThis week, Pimm Fox, co-anchor of Taking Stock on Bloomberg Radio, joins Odd Lots co-host Tracy Alloway to speak with Keith Bliss, senior vice president at Cuttone & Co. and one of a dwindling number of floor traders left at the New York Stock Exchange. We visit a bygone era when 5,000 traders swaggered through the crowded floors of the NYSE -- unafraid to prank their bosses, or indeed, even the president of the United States.", "duration": "26:18", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vXBpMtKARUsE/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1457970707, "title": "Episode 19: Pow! Pow! El-Erian Talks Central Bank Ammunition", "author": "Bloomberg News", "summary": "Asset purchases! Currency devaluations! Low interest rates! Negative interest rates! And... more? The world's central banks have unleashed a torrent of unconventional monetary policy since the 2008 financial crisis, hoping to heal economic wounds and revive markets' animal spirits.\n\nRescuing us from another Great Depression is no longer seen as sufficient. Seven years on, doubts are starting to build about the ability of central banks to continually boost economic growth. Talk of central banks \"running out of ammunition\" reached a crescendo earlier this year and coincided with a dramatic market sell-off. More economists are saying fiscal policy needs to play a greater role, while the European Central Bank last week demonstrated it may still have some bullets left in its armory.\n\nWe sit down this week with Mohamed El-Erian, BloombergView columnist and chief economic adviser at Allianz SE, as well as Dan Moss, executive editor of global economics for Bloomberg News, to discuss the limits of central banks.", "duration": "22:55", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vUgB.atAb.a0/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1457360931, "title": "Episode 18: The Obscure Report That Spawned the ETF Industry", "author": "Bloomberg News", "summary": "In 1987, investors watched in horror as the Dow Jones Industrial Average plunged 22 percent in an event that became known as \"Black Monday.\" Months later, the U.S. Securities and Exchange Commission published an 840-page report into the incident; in it was buried a seed that would eventually sprout into the $3 trillion market for exchange-traded funds. Eric Balchunas, ETF analyst for Bloomberg, has the story of the stock exchange executives who seized upon an idea to create what is now one of the world's most pervasive financial products - and the investors who passed them up.", "duration": "28:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vi7Ok217Q420/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1456769392, "title": "Episode 17: How One Analyst Uncovered a $7 Billion Fraud", "author": "Bloomberg News", "summary": "In late 2008, as markets tanked thanks the the global financial crisis, two massive Ponzi schemes unraveled. One was the $17.5 billion fraud engineered by Bernie Madoff. The other was the smaller but no less interesting one run by R. Allen Stanford, a flamboyant Texan who lived in the small Caribbean island of Antigua and operated a bevy of companies under the Stanford brand.\n\nBest known for his involvement in the sport of cricket, Stanford soon found himself under a much less flattering spotlight -- all thanks to the work of one independent financial analyst, Alex Dalmady.\n\nThis is the story of how Dalmady did a favor for a friend and then ended up uncovering a $7 billion investment fraud. Seven years after Dalmady's work set in motion the events that culminated in Stanford's downfall, we discuss the research note that spawned an international investigation and whether we can expect more such schemes to emerge in the wake of recent market upheaval.", "duration": "25:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vVZBYI8naXys/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1456158244, "title": "Episode 16: Making Money When Everyone Else is Losing Theirs", "author": "Bloomberg News", "summary": "Everybody knows by now that a handful of hedge funders made a fortune by betting against housing before the market crashed back in 2008. But, people who bought at the bottom, when everyone else was panicking, also did extremely well. In the latest episode of Odd Lots we speak with Bloomberg Alastair Marsh, who discovered two traders who won big time by buying the most toxic assets in the world during the depths of the panic in early 2009.", "duration": "22:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vAaueF1y88zA/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1455639225, "title": "How a Rural Irish Farmer Became an Expert on the Euro Crisis", "author": "Bloomberg News", "summary": "In theory, anyone with an internet connection can became an expert on just about anything from just about anywhere. In the latest edition of Odd Lots, we speak with Lorcan Roche Kelly, a cattle farmer, and former explosives engineer in rural Ireland who decided in the early days of the euro crisis to figure out what the heck was going on with his nation's banks. Lorcan tells the story of how he went from a farm in Sixmilebridge, Ireland to advising hedge funds on what sovereign bonds they should buy, and ultimately to Bloomberg. He also breaks down why once again, people are getting nervous about the Eurozone financial system.", "duration": "29:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vf2e2Hzr.7As/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1454949213, "title": "Episode 14: The World’s Only Stand-Up Economist", "author": "Bloomberg News", "summary": "On today’s episode, we’re taking the “dismal” out of the dismal science by interviewing Yoram Bauman, who bills himself as the world’s only stand-up economist. Join us for a Laffer curve-a-minute romp through the humor of homo economicus. Along the way, we find the upside in the economic assumption that all human beings are selfish jerks and learn what classes would be included in the University of Comedy curriculum. We also take a look at some of the funniest economics papers of all time, including a satirical work that sparked a minor squabble among economists by trying to determine who's the better singer in the band AC/DC, plus the age-old classic: Japan’s Phillips Curve Looks Like Japan. In addition, Yoram conducts the first ever stand-up routine performed over cell phone to an audience of five business journalists.", "duration": "24:20", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vlRKF0jlE584/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1454337803, "title": "Episode 13: How a Professor Won Gambling on an Obscure Sport", "author": "Bloomberg News", "summary": "Episode 13: Everyone dreams of being able to win almost every time when gambling. Of course, whether it's blackjack, horse betting, poker or the stock market, it's really hard to consistently win. But one professor, armed with advanced mathematical knowledge and computers, was able to beat the system while gambling on the obscure sport of Jai Alai. In this week's Odd Lots podcast, Steven Skiena, who teaches computer science at Stony Brook University in New York, tells the story of how he made 500 percent on his money in six months by gambling on Jai Alai. Skiena also explains how his approach applies to much bigger arenas, including algorithmic trading on the stock market.", "duration": "25:53", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vymtLPbW7ujw/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1453740446, "title": "Episode 12: How a Consultant Foresaw the 2015 Commodities Crash", "author": "Bloomberg News", "summary": "On this episode, co-host Tracy Alloway is joined by Bloomberg Markets reporter Luke Kawa for a journey back in time. As the global elite mingle at the World Economic Forum's annual meeting in Davos, Switzerland, we look back at a WEF gathering five years ago. Back then, the mood was buoyant -- markets had recovered from the 2008 financial crisis and the euro-zone debt crisis had yet to fully unfold. But Barrie Wilkinson, a partner at Oliver Wyman Ltd., wasn't feeling so jubilant. As bankers, regulators, and politicians congratulated themselves for a job well done, he was warning of a brewing crisis that would start with a crash in commodities prices in 2015. Now, parts of his 27-page report seem eerily prescient.", "duration": "23:40", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vuFuq.RKMgkw/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1453221159, "title": "Episode 11: How David Bowie Became a Financial Product", "author": "Bloomberg News", "summary": "When the world lost David Bowie this month, it lost one of modern music's undisputed geniuses. Less well-known is Bowie's contribution to the financial world. In this episode of Odd Lots, hosts Tracy Alloway and Joe Weisenthal speak with David  Pullman, the banker who worked with Bowie to develop \"Bowie Bonds,\" which paid investors on the cash flow from the artist's song royalties. This episode covers how these bonds came to be, their lasting\\u0010impact on financial markets and what it was like to work with David Bowie.\\u0010\\u0010Speaking of financial history, in this episode we also talk about the Beige Book, a monthly publication from the Federal Reserve that gives an anecdotal look at the U.S. economy. Joining us are Bloomberg News editor Paul Cox (arguably the father of the Beige Book) and Fed reporter Matt Boesler.", "duration": "33:15", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vssDpOB.vREo/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1452542410, "title": "Episode 10: How the World Ended Up With a Boring Banana", "author": "Bloomberg News", "summary": "This week, we're taking on one of the most fragile commodities markets around. No, it's not oil (though we do get to that later in the program), it's the market for bananas. Dangerously reliant on a single, boring breed of the tropical fruit, banana growers now face a rampant disease that threatens one of the world's biggest food supplies. We talk to Dan Koeppel, author of \"Banana: The Fate of the Fruit That Changed the World,\" about the development of a monoculture-based banana market and the pitfalls of having a single breed monopolizing the local supermarket.     \n\nSpeaking of monopolies, we then take a swift detour from the banana republics of yesteryear to visit the oil-drenched Middle East of today, where Saudi Arabia is considering an initial public offering of its massive state-owned oil company", "duration": "31:10", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/voIVSOkoYUyo/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1451922646, "title": "Episode 9: The 2016 Predictions Episode", "author": "Bloomberg News", "summary": "(Bloomberg) -- It’s a new year and a new episode of Odd Lots. Co-hosts Joe Weisenthal and Tracy Alloway have re-stoked our proverbial holiday fire, refilled our wine glasses and are ready to continue our conversation with a newly relaxed group of Bloomberg News reporters and editors. This time we’re looking ahead to 2016, making predictions for key markets and finance events during the next 12 months. Hear how sentiment could affect stocks, why the Federal Reserve is about to become even more important and exactly what trouble might be in store for perma-bears. Featuring: Matt Boesler, Ed Hammond, Matt Levine, Dan Moss and Chris Nagi.", "duration": "22:15", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vE2LKSb8QVig/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1451320711, "title": "Episode 8: These Were Our Favorite Stories of 2015", "author": "Bloomberg News", "summary": "(Bloomberg) -- Gather ‘round the Odd Lots fire. Co-hosts Joe Weisenthal and Tracy Alloway have assembled a collection of Bloomberg News reporters and editors to spread holiday cheer by sharing their favorite market stories and happenings of 2015. We discuss the stock market sell-off of Aug. 24, the fall of Silk Road, drama in the pharmaceuticals industry, how we all survived the first U.S. interest rate increase in almost a decade, China’s movie-goers, and the many, many people worried about bond market liquidity. Featuring: Max Abelson, Matt Boesler, Ed Hammond, Matt Levine, Dan Moss, and Chris Nagi.", "duration": "22:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vR3vLNmRpMtI/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1450729796, "title": "Episode 7: How One Woman Tried To Sound Housing Crash Alarm", "author": "Bloomberg News", "summary": "The film “The Big Short” has sparked lots of attention about the origins of the financial crisis and the people who saw it coming. While lot of attention is being paid to a few men who made a fortune on the housing collapse, this week Tracy and Joe talk to the editor of the blog “Calculated Risk” about Doris Dungey, an early blogger and whistleblower who tried to warn the world about brewing problems in the mortgage market. Between 2006 and 2008, Dungey, who wrote under the pseudonym “Tanta,” became an influential must-read for her prescient, good-humored writing and analysis.", "duration": "22:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vLPwDEwUHP5o/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1450122532, "title": "Episode 6: Meet The Man Who Made Millions Trading Mules", "author": "Bloomberg News", "summary": "This week we're thinking about what it means to be a trader in today's electronified markets and contrast it with trading in the era of horse and buggies. That's right, we're going back in time to talk mule trading and the story of the legendary Ray Lum, who spent years buying and selling livestock all over the U.S. in the early 1900s. William R. Ferris, history professor at the University of North Carolina and author of Mule Trader: Ray Lum's Tales of Horses, Mules, and Men, tells us about Lum's adventures in the South, including the purchase and transportation by train of 80,000 mules from South Dakota to New Orleans. He explains why the \"trader is the poet of capitalism,\" how the term \"day trader\" can be traced to stable storage trades and why some things—like boozy dinners between brokers and their clients—never seem to change. It's arbitrage of the animal sort, with storage trades thrown in to boot.Along the way, we ask whether traders provide a social service and explore the trade-off between modern efficient markets and the bygone era of 100 percent mark-ups on (mule) trades.", "duration": "25:05", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vcA9hsxPQeXw/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1449509255, "title": "Episode 5: 6,000 Years of Interest Rates", "author": "Bloomberg News", "summary": "(Bloomberg) -- What better way to prepare for what may be the first U.S. rate hike in almost a decade than to tour 6,000 years of interest-rate history? This week, Joe and Tracy speak with NYU Stern finance professor Richard Sylla, co-author of A History of U.S. Interest Rates. We start in Babylonia, where Hammurabi codified the relationship between debtors and creditors, and end with zero percent interest rates in the U.S. in the 21st century. Along the way, we journey to the Roman city that pledged its public colonnades as collateral, learn why medieval French princes had such terrible credit histories and figure out why today's negative interest rates in parts of Europe really are a historical oddity. In other words, Odd Lots read a 700-page book on interest rates so you don't have to. (No, really, you should read it. It's a great book).", "duration": "22:46", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vu3nObbY2lc4/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1448903711, "title": "Episode 4: Can a Hedge Funder Cut Prescription Drug Costs?", "author": "Bloomberg News", "summary": "(Bloomberg) -- Hedge-fund manager Kyle Bass has a plan that could cut the high cost of prescription drugs in the U.S. -- and make himself a lot of money. The strategy: Take short positions in a number of pharmaceutical companies while also trying to overturn their drug patents in court. Joining hosts Tracy Alloway and Joe Weisenthal to discuss Bass's unusual tactic is Guan Yang, an occasional Bloomberg View contributor who has researched the odd intersection of Wall Street and patent law.", "duration": "19:54", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vnYSTA5P7VrU/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1448298890, "title": "Episode 3: The Strange Story Behind the Beanie Babies Bubble", "author": "Bloomberg News", "summary": "(Bloomberg) -- Two market bubbles stand out from the late 1990s. Technology stocks that were supposed to make everyone a zillionaire. The other: A series of mass-produced stuffed animals priced at $5 each. Odd Lots hosts Joe Weisenthal and Tracy Alloway speak with Zac Bissonnette, author of \"The Great Beanie Baby Bubble: Mass Delusion and the Dark Side of Cute,\" to figure out exactly what made millions of people believe that these plush cuties were destined to soar in value. We dive into the psychology behind one of the weirdest speculative manias of all time and draw a connection with the dotcom bubble.", "duration": "22:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vbCzDMw7oNKQ/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1447698066, "title": "Episode 2: Under the Hood of the $8 Trln Corporate Bond Market", "author": "Bloomberg News", "summary": "(Bloomberg) -- It's definitely big and it might be broken. It's the bond market! The corporate bond market, that is. In the second episode of Odd Lots, hosts Tracy Alloway and Joe Weisenthal talk corporate debt with Chris White, the creator of a Goldman Sachs bond trading platform and a longtime market structure specialist. We learn about the difficulties of shaking up an $8 trillion market that has so far proved stubbornly resistant to change. We also hear why White stopped calling internal meetings at Goldman, and discover the difference between \"two-minute guys, two-year guys and 10-year guys\" at the storied investment bank.", "duration": "20:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vkoQbSvZtBNU/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1446829800, "title": "Episode 1: Tom Keene on Mathiness and His Favorite Guitar", "author": "Bloomberg News", "summary": "(Bloomberg) -- Tracy Alloway and Joe Weisenthal kick off the Odd Lots podcast by interviewing the legendary television and radio host Tom Keene. On Tom’s mind this week: Fat tail risks, mathiness on Wall Street and how he rediscovered his favorite guitar. And don’t forget Newtonian mechanics and bow ties.", "duration": "22:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vDcrAIysLYKk/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}, {"seriesId": 1056200096, "seriesTitle": "Odd Lots", "pubDate": 1446672431, "title": "The Odd Lots Preview", "author": "Bloomberg News", "summary": "(Bloomberg) -- Welcome to Episode Zero of the Odd Lots podcast! Every week, hosts Joe Weisenthal and Tracy Alloway take you on a not-so random weekly walk through hot topics in markets, finance and economics. In this introduction, Joe and Tracy discuss what you can expect from the show and introduce the guest of the first episode, the legendary Tom Keene.", "duration": "3:02", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music111/v4/14/27/2d/14272d17-5b21-9ce3-a85c-b211c33ef484/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vdlHr649pf6Y/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "news podcasts", "bloomberg podcast"]}]}