{"series": {"feedUrl": "http://feeds.feedburner.com/PrinceStreet", "genres": ["Food", "Podcasts", "Arts"], "title": "Prince Street", "country": "USA", "author": "Finch & Partners / Dean & DeLuca", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "type": "series", "id": 1099321224}, "episodes": [{"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1488650784, "title": "LIVE FROM PRINCE STREET: MARTHA STEWART", "author": "Finch & Partners / Dean & DeLuca", "summary": "Caviar with oligarchs, pot brownies with Snoop, baking with spelt and anesthetizing a chicken before slaughter: welcome to the world of Martha Stewart. LIVE FROM PRINCE STREET, our new podcast spinoff, features the kinds of interviews that deserve a show all to themselves. The first one brings together Martha Stewart, on the occasion of publishing her 88th book, A NEW WAY TO BAKE, and author and journalist Bill Buford, whose own new book, DIRT, about moving his family to France to learn to cook like the French masters comes out later this year.&nbsp;", "duration": "1993", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PPY1698154106.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1486571100, "title": "Episode 11: Desire", "author": "Finch & Partners / Dean & DeLuca", "summary": "Love or money, chocolate or wine, everything you desire, we're talking about it on this episode of Prince Street. Christina Tosi shares love tips, and cookie tips, with Sierra Tishgart; Isaac Mizrahi and Alex Guarnaschelli discuss pleasure vs. ambition; and Jay McInerney, top sommelier Paul Grieco and <em>Cork Dork</em> author, Bianca Bosker debate their favorite February wines. Plus the power of Ayurvedic truffles with Melanie Dunea, Marco Canora's healing broths, highschoolers with surprising affections and a live performance from Mizrahi's new cabaret act at Café Carlyle.", "duration": "4041", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST8162913443.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1484142060, "title": "Episode 10: Secrets", "author": "Finch & Partners / Dean & DeLuca", "summary": "Secret recipes, secret crimes, secrets of success --we have them all on this episode, revealed by guests like Scarlett Johansson and Alex Guarnaschelli, and some famous American ghosts, too. America's OG celebrity chef, Wolfgang Puck, is finally taking on the Big Apple. In the seventies, what did he do in Indianapolis to change the natives' eating habits? And what has made his restaurant Spago one of Hollywood's longest running hits?&nbsp; Giorgio DeLuca reveals to Alex Guarnaschelli that the secrets of his success were his friends, his neighbors, and his joy in the pleasures of the table. When Missy Robbins quit A Voce in 2013 she stunned the New York food world. Now she's back with Lillia, just voted one of the top new restaurants of 2016 by <em>The New York Times</em>. Tune in to find out how she makes her pasta so extraordinary. Scarlett Johannson's secret love becomes Griffin Dunne's desire, when he tries to express his gratitude to the crew of his upcoming Amazon series, <em>I Love Dick</em>. African-American chef Ashbell McElveen was asleep in London when he was awakened one night by the ghost of James Hemings, Thomas Jefferson's slave chef. McElveen unburies a crime and reveals one of America's darker culinary secrets. Finally: Après ski with Wolfgang Puck? Find out what dish brings the 67-year-old chef back in time to the snowy slopes of his native Austria.", "duration": "3261", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST1221454060.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1481114340, "title": "Episode 9: Holidays", "author": "Finch & Partners / Dean & DeLuca", "summary": "Anthony Bourdain visits the ghosts of Christmas future and present, and has a special message for the Anthony of the past. Celebrity chef Alex Guarnaschelli digs deep into family holiday triumphs and tumult with her mother, the legendary cookbook editor, Maria Guarnaschelli.<em> Top Chef's </em>Gail Simmons reveals which animal part prompts her Madeleine Moment and invites Eden Grinshpan home to discuss why Hanukkah and Chinese food go hand in hand.&nbsp; Howie Kahn goes to the dinner party of the year with fashion designer Lela Rose, chef Massimo Bottura and Edible Schoolyard NYC and then we head south as one correspondent decides to go home for the holidays for the first time in years in an attempt to outcook her family of Atlanta chefs. Plus, authors Jonathan Franzen and Bill Buford return to finish the food fight they started on our last episode. Where do they land on Bouley and Boulud and is there such thing as too much butter?&nbsp;", "duration": "3583", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST6861612744.mp3?updated=1481126608", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1478095200, "title": "Episode 8: Community", "author": "Finch & Partners / Dean & DeLuca", "summary": "Love, rivalry and astonishing creativity: these are just a few of the things we heard about when we asked our guests, What does community mean to you? Renowned architect Ole Scheeren may be about to do for fast food what he did for fashion with his new design for Dean &amp; DeLuca. Authors Jonathan Franzen and Bill Buford debate their diets and opposing passions for rare birds. Chef Daniela Sotto-Innes from Cosme in Manhattan shares with Eden Grinshpan the secret of her wildly popular duck carnitas. Griffin Dunne makes the case for the French toast and camaraderie served up by a beloved--and endangered--New York institution. Hear why apple picking is extra intense in The Bronx. Take a culinary road trip with <em>LA Times </em>food critic Jonathan Gold with a taste from his upcoming memoir. And visit rural Kentucky for a Madeleine Moment from Boyd Holbrook, star of <em>Narcos. </em>All this and Scarlett Johansson, too!<br /><br /><br /><br /><br /><br />", "duration": "4148", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST5196277172.mp3?updated=1478103109", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1475665200, "title": "Episode 7: Triumph", "author": "Finch & Partners / Dean & DeLuca", "summary": "This month, Prince Street celebrates TRIUMPH with tough and touching stories about hard-won victories. We travel to Bangkok, Haiti, and even into the mind of John Malkovich, to hear how our guests&nbsp; transform their lives--and the lives of others--through food.&nbsp;<br /><br />Dan Giusti left Noma in Copenhagen, and an ongoing gastronomic revolution there, to launch a movement of his own: fixing the problem of public school lunches in America. We're with him for his very first lunch service and discover why cooking for kids is the hardest thing he's ever done.&nbsp;<br /><br />Alexis Gallivan is on a mission to help empower women in 3rd world countries. Hear how she's doing it with desserts in Port Au Prince, and why working in Haiti is even tougher than in Rwanda.&nbsp;<br /><br />At the Cecil in Harlem, Eden Grinshpan learns from chef Joseph \"JJ\" Johnson about the history of Afro-Asian cuisine, and how to cook this spicy food that New Yorkers are lining up for.&nbsp;<br /><br />Howie Kahn goes behind the scenes of this year's Emmy-nominated episode of&nbsp;<em>Chef's Table&nbsp;</em>to hear how the filmmaker David Gelb changed the life of Asia's top rated chef Gaggan Anand.<br /><br />And for a dietary triumph (of sorts), John Malkovich joins us from Paris to talk about....being, and eating, and the one food that taught him he could do anything he put his mind to.", "duration": "3287", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST6830881931.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1473238800, "title": "Episode 6: Fullness", "author": "Finch & Partners / Dean & DeLuca", "summary": "Fullness means radically different things to our six guests this month. What does it mean to you?&nbsp; &nbsp;<br />For Stephanie Danler, who reads from her bestselling novel&nbsp;<em>Sweetbitter</em>, a sense of completeness came from her first restaurant job in New York City, at Union Square Cafe. For champion Yasir Salem, fullness could spell defeat at the biggest event on the competitive eating circuit. Eden Grinsphan finds out why even impatient New Yorkers will wait hours for a hamburger named \"Emmy.\" In his newly released book,&nbsp;<em>Ten Restaurants That Changed America</em>, Yale's Paul Freedman argues that dining out helped civilize and democratize our country. Noah Bernamoff talks to the founder of a company that wants to make any restaurant-food dream come true--right to your door. And the star of&nbsp;<em>Full Metal Jacket</em>&nbsp;and the new hit series,&nbsp;<em>Stranger Things</em>, reveals why the smell of a drive-in snack bar triggers his moving Madeleine Moment. &nbsp;", "duration": "3289", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST2313512137.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1470388753, "title": "Episode 5: Anxiety", "author": "Finch & Partners / Dean & DeLuca", "summary": "We’re keeping it real this month on Prince Street with a show about anxiety. We understand—it’s summer, time for ice cream and the beach. But we also know that nerves are not seasonal, especially when it comes to... food.&nbsp;On this episode, Phil Rosenthal, creator of the hit sitcom&nbsp;<em>Everybody Loves Raymond</em>&nbsp;and host of the award-winning&nbsp;<em>I’ll Have What Phil’s Having</em>, reveals one of the secrets of his success, and why he thinks more people should be anxious. Find out why author and food editor Kat Kinsman might disagree, especially when it comes to the dangerous kind of anxiety that increasingly afflicts people in the restaurant industry. Chef Erik Ramirez teaches Eden Grinshpan how to make Peruvian ceviche while swapping tips on how to reduce anxiety. Sierra Tishgart steals a moment with chef Jessica Koslow of LA's Sqirl, who is launching two new projects while publishing her first cookbook at the same time. And Jay McInerney reads from his twelfth book, out this month, his latest novel,&nbsp;<em>Bright Precious Days</em>.", "duration": "2900", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PST5282613566.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1467950400, "title": "Episode 4: Rule Breaking", "author": "Finch & Partners / Dean & DeLuca", "summary": "Rule breakers are the focus this July on Prince Street, those who use food to push boundaries and change culture. Chef Bun Lai forges an unexpected path for sushi-making, while staying mindful about the state of our oceans; Jay Mcinnerney stands in as his guinea pig. Sierra Tishgart explains how renegades run Take Root, a 12-seat, Michelin-stared restaurant in Brooklyn. Howie Kahn visits Ruth Rogers of London's legendary River Cafe for a lesson about how rule breaking fosters sustainability. Plus, Mike Solomonov and Eden Grinshpan wipe some hummus. Noah Bernamoff meets his maker at Katz's Deli. And Scarlett Johansson shares a poignant food memory.&nbsp;", "duration": "3074", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PNC1074436997.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1464927938, "title": "Episode 3: Craving", "author": "Finch & Partners / Dean & DeLuca", "summary": "Craving is the topic this month on Prince Street. A professional line-waiter explains the psychology of cult-craving. Alex Guarnaschelli tells us why she's driven to test herself in her latest challenge--stand-up comedy. When she is reunited with her mother, a young Somali-American woman discovers a sauce recipe from her country that will change her life. Mario Batali and Jay McInerney share memories of the late great novelist Jim Harrison.", "duration": "3150", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PNC5815825039.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1462507200, "title": "Episode 2: Risk", "author": "Finch & Partners / Dean & DeLuca", "summary": "On this episode of Prince Street, we asked some of the most interesting people in the food world to tell us about a moment in their life when they chose the riskier path. Chef-extraordinaire Eric Ripert of Le Bernardin talks about writing his first memoir with novelist Jay McInerney; Howie Kahn talks to former U.S. Army Captain Kimberly Jung about starting Rumi Spice, her saffron exporting business in Afghanistan ; Sierra Tishgart reports on the big gamble two editors are taking by launching two print food magazines aimed at gay men. All this, plus an encounter with Canadian Prime Minister Justin Trudeau, Scarlett Johansson and more.", "duration": "2856", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PNC5560763446.mp3", "type": "episode", "tags": []}, {"seriesId": 1099321224, "seriesTitle": "Prince Street", "pubDate": 1460137620, "title": "Episode 1: Preparation", "author": "Finch & Partners / Dean & DeLuca", "summary": "What does it mean to truly be prepared? Can you be — for the bigger moments in life? In this episode, you'll hear how all kinds of people get ready. Novelist Jay McInerney talks to legendary filmmaker and wine maker Francis Ford Coppola at his historic vineyard in Napa Valley; Eden Grinshpan finds out ramen master Ivan Orkin is preparing for his next culinary gamble; Griffin Dunne gets a donut-cooking lesson --on US Coast Guard ship; and Pakistani-American banker Umber Ahmad launches into the competitive world of international bakeries. Plus a 'ghost in the machine' and some pre-schoolers, too!", "duration": "2321", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music71/v4/c0/06/7e/c0067e72-1ee4-0b5b-67ad-a8945d1b04cc/source/60x60bb.jpg", "audioUrl": "http://traffic.megaphone.fm/PNC3148775696.mp3", "type": "episode", "tags": []}]}