{"series": {"feedUrl": "http://www.bloomberg.com/feeds/podcasts/material_world.xml", "genres": ["Business News", "Podcasts", "Business", "Investing"], "title": "Material World", "country": "USA", "author": "Bloomberg News", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "type": "series", "id": 1116763041}, "episodes": [{"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1488839699, "title": "Is Trump's 'Made in America' Push Healthy for Your Wallet?", "author": "Bloomberg News", "summary": "Jenny and Lindsey explore what Trump's campaign to revive domestic manufacturing means at the mall. Some companies, including Knot Standard, the custom suit-maker that dressed the younger male Trumps for the inauguration, say the U.S. doesn't have the technological infrastructure or employee knowhow to get the job done. Others, such as hoodie-maker American Giant, say that's baloney. Either way, after a decade of plummeting prices, shoppers may need to prepare themselves to spend more on the clothes they've been coveting.", "duration": "0:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vs5PybprLzgg/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1487688351, "title": "How to Live Forever Young", "author": "Bloomberg News", "summary": "Immortality may remain forever the stuff of science fiction, but our ability to live long and prosper is finally within reach -- if a select group of so-called biohackers can be believed. Take Bulletproof founder Dave Asprey, so committed to the lifestyle that he plans to live to the age of 180. Or consider Jim Fadiman, who studies the benefits of microdosing on psychedelic drugs such as LSD and says small changes can have big benefits. They're just two of the scores of experts, professionals and skeptics whom Jenny and Lindsey spoke with for this week's Material World. We also explore more mainstream efforts to live better, from diet and exercise to smartphone apps that help less-committed people quantify their wellness goals and success.", "duration": "28:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v8w5cPYGWRqE/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1486418207, "title": "Why There's No Excuse Not To Buy Better Underwear", "author": "Bloomberg News", "summary": "Material World is taking a look at the basics -- underwear. Technology and innovation has infiltrated the rest of your closet. Now, entrepreneurs say it's time to upgrade your underwear drawer. There's plenty to pick from: The global men's underwear market is expected to expand to $11 billion in 2020 from $8.4 billion in 2015, according to Persistence Market Research. That 31 percent jump dwarfs the expected 14 percent growth in the overall men's apparel market to $33 billion in 2020, according to Edited. Jenny and Lindsey talk with the founders of My Pakage and Tommy Johns, mens' brands, and Thinx, the so-called period underwear, to explore trends driving this market. Plus, they host a consumer-expert panel to find out if the new products actually live up to the hype.", "duration": "22:42", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vgOHV89RnUUc/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1482845277, "title": "Shopping in Trump's America: A Look Ahead to 2017", "author": "Bloomberg News", "summary": "This year was full of surprises -- Brangelina called it quits, the U.K. voted to leave the European Union and Donald Trump became the next president of the United States. It's hard to predict what lies ahead in 2017.\n\nJenny and Lindsey are joined by others on Bloomberg News's consumer team to do just that. They discuss what retail might look like next year. Skinny pants, beards and progressive advertising themes could be out. Shoulder-pads, fast food and sugar may be in. The team tries its best to guess what living in Trump's America will mean for shoppers.", "duration": "23:05", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v2mV3t9cRibE/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1481583086, "title": "Zombie Brands Are Hard to Kill", "author": "Bloomberg News", "summary": "The holidays are upon us, and with them a shopping season that can make or break a struggling retailer. Yet bankruptcy doesn't always mean the end. Many struggling chains linger well past their expiration dates and others find second lives under new ownership. The deciding factor is the strength of the brand.\n\nJoin us as Lindsey and Jenny explain the bankruptcy process -- and why some brands survive while others don't. Jamie Salter tells us why he bought Aeropostale, the teen apparel chain, four months after it filed for bankruptcy in May. Bazillion Points book publisher Ian Christe describes his conflict with Borders, the bookseller that went out of business in 2011. Ryan Cotton, a managing director at Bain Capital Private Equity, explores what sets successful brands apart, while Bloomberg's Lauren Coleman-Lochner breaks down the mechanics of filing for bankruptcy.", "duration": "26:21", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vHRtZ0oOEHjg/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1480429151, "title": "America's Sugar Addiction: Why So Sweet?", "author": "Bloomberg News", "summary": "This time of year feels like a continuous feast. With pumpkin spice lattes and apple pie and holiday cookies at every turn, Americans are constantly confronted by sugar. More than half of the nation's people are trying to eat less sugar -- and some are trying to quit altogether. So why is it so hard to tame that sweet tooth?\n\nJenny and Lindsey dig into the ingredients that keep us chomping long past our necessary caloric intake: sugar, salt and fat. Jacqueline Raposo, a food writer and host of the \"Love Bites\" podcast, talks about the challenges of her month-long pledge to abstain from sugar. New York University's Nutrition and Food Studies Professor Marion Nestle explains why certain tastes appeal. Bestselling author and New York Times investigative reporter Michael Moss and Bloomberg's Craig Giammona speak to the companies that rely on sugar, salt and fat to attract consumers and how Big Food and Big Soda are being forced to change tactics.", "duration": "25:54", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vGNxin66D2AQ/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1479167790, "title": "Celebration Inflation: We're Partying Hard & Companies Love It", "author": "Bloomberg News", "summary": "The holiday season is almost upon us. But these days it feels as if we're always celebrating. When it's not Halloween or Thanksgiving or Christmas, it's Valentine's Day, St. Patrick's Day, National Margarita Day, National Siblings Day or National Pet Day. Companies have even created their own corporate holidays to get in on the action, such as Black Friday or Amazon Prime Day.\n\nThis week, Jenny and Lindsey dig into a phenomenon they call celebration inflation. People may be skipping the mall these days, but they're happy to shop if it means snapping the perfect Instagram picture or throwing a \"Pinterest perfect\" party. We're spending more on events, whether they're nationally recognized days or other celebrations such as birthdays, weddings and bachelorette parties. Jenny and Lindsey explore the growing industry surrounding celebrations to find out why our partying patterns have changed and who is benefiting.", "duration": "21:48", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vRzXUyz6kvW4/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1477948229, "title": "How The Kardashians (and Other Celebrities) Get You To Buy Stuff", "author": "Bloomberg News", "summary": "Celebrities, they're just like us! Or rather, marketers have long relied on the fact that we want to be just like them. Slapping a famous name and image on to products has been a sales tactic for more than a century. But consumers's thirst for authenticity and attachment to social media have changed the ways that fame can be used.\n\nJoin us as Jenny and Lindsey dive into the world of celebrity to find out why the relationship between companies and stars increasingly revolves around investments, not endorsements. Khloe Kardashian tells us why she no longer feels obliged to accept every product offer dangled her way. The comedians behind the Fat Jewish and Babe Walker on Instagram and Twitter explain the origins of White Girl Rose. And Jody Levy, co-founder and creative director of WTRMLN WTR tells us what one famous backer -- Beyonce -- brings to the table.", "duration": "0:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v84nCFjIXxt4/v4.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1476741016, "title": "The Costly Companionship of Cats and Dogs", "author": "Bloomberg News", "summary": "Cats and dogs have never had it so good. Hosts Lindsey Rupp and Jenny Kaplan explore the $63 billion U.S. pet industry. As Americans wait longer to have kids, they're spending more on their furry relatives instead, from pet insurance and premium diets to Halloween costumes. To break down the changes in the industry and find out if all this money actually makes a difference to our speechless friends, our hosts talk with celebrity chef Rachael Ray, who launched her own pet-food line called Nutrish, a New York City veterinarian and representatives from Petco and PetSmart.", "duration": "25:44", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vSqNBITjhPh8/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1475527539, "title": "American Made, Bought and Sold", "author": "Bloomberg News", "summary": "Hosts Lindsey Rupp and Jenny Kaplan are talking patriotic marketing. In an Olympic and election year, consumers have been overwhelmed with red, white and blue. Budweiser actually branded its iconic beer \"America\" during the summer. Do these ploys attract buyers? What about items that are made in America? For more insight the hosts talk with Wrangler Jeans, Bloomberg reporter Shannon Pettypiece on Wal-Mart and Budweiser.", "duration": "25:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vtvrGYZ.Qe7U/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1474325056, "title": "Having a Baby Never Cost So Much", "author": "Bloomberg News", "summary": "Having a baby costs more than ever. The average American parents will pay about $245,000 to raise a child born in 2013 through the age of 18 -- and that's just for basics! It isn't just higher costs that are changing the business of raising babies, industry experts tell Jenny and Lindsey in this episode. These days, new parents rely more on technology, care less about brands and are more attuned to product ingredients than previous generations. Mainstream companies such as Johnson & Johnson, once the only option for new parents, are struggling to keep up with changing demands as customers flock to upstarts like the Honest Co. for products they can trust.", "duration": "26:20", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vjxeRgHPwXGw/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1473166065, "title": "Pink It & Shrink It", "author": "Bloomberg News", "summary": "Marketing to women is getting more nuanced than the stereotyped, often sexist, efforts of the past -- mostly. How are companies that sell typically macho-things like beer and guns appealing to the fairer sex? Some do it better than others with inclusive messages. The toy industry is making stereotypically masculine toys more palatable for girls. The internet is allowing marketers to target customers based on their interests. Will advertisers ever really know what women want?", "duration": "0:00", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vU.xepg6jpzY/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1471899425, "title": "The Future of Vegan Food Is Here, and It’s Not Gross", "author": "Bloomberg News", "summary": "For many years, packaged vegan foods were expensive, sometimes unappealing, knock-offs of animal products and byproducts made for diet extremists. Not any more. Companies that make plant-based fare, such as Treeline Cheese and Beyond Meat, want their products to go mainstream. They're working hard to appeal to meat-eaters, not just vegetarians. Others, like Santa Margherita Wine, call being vegan more of a perk than a goal. But will Americans ever really be willing to spring for a more expensive cashew-based cheese or skip beef for an imitation burger?", "duration": "26:28", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vM8GzJq6UHhs/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1470687413, "title": "Skinny Jeans Are Killing the Fashion Industry", "author": "Bloomberg News", "summary": "Skinny jeans have dominated the denim world for 10 long years and the fashion industry has had enough. Apparel companies are eager for pant styles to change, prompting customers to spend more on updating their entire wardrobe. Yet the skinny silhouette has serious staying power, according to Nancy Zhang, chief operating officer of New York boutique chain Otte. Sid and Ann Mashburn, who own a retail chain, describe how skinny became a style staple, from denim to athletic apparel to menswear. And Bloomberg's Matt Townsend bets the time has come for skinnies to meet their end. Are trends finally starting to show signs of change?", "duration": "21:01", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vw1QQRbuhNlo/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1469481272, "title": "Sex Sells", "author": "Bloomberg News", "summary": "Attitudes toward the sex toy industry have changed dramatically thanks to the Internet, making what was once a taboo subject pervasive in popular culture. In this episode, Lindsey and Jenny take a closer look at the $15 billion \"adult product\" market, with guests including Phil Harvey, who founded the adult store chain Adam & Eve in 1970 and explains to them how the industry has blossomed during the past 40 years. Challenges persist, however. As Babeland founder Claire Cavanah says, sometimes it's tough just to do basic banking. And Dame Products founders Alexandra Fine and Janet Lieberman tell our hosts that they used crowdfunding to make a new toy, but faced hurdles trying to advertise it.", "duration": "28:30", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vP9hlmHkRR5I/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1468270379, "title": "Cash, Sweat and Tears: The Big Business of Fitness", "author": "Bloomberg News", "summary": "The business of slimming has gained serious weight. From Soul Cycle to Lululemon, people are focused on getting fit -- and shelling out significant cash in the process. But just how big is the fitness economy? Are we in a fitness bubble? Join us as Jenny and Lindsey dig into the business side of this cultural phenomenon. Guests include Bloomberg New York Bureau Chief Jason Kelly, who chronicled this world in his book, “Sweat Equity: Inside the New Economy of Mind and Body”; Tom Cortese, co-founder and chief operating officer of Peloton; and Rohan Gunatillake, founder and director of Buddhify.", "duration": "27:14", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vMS0kV94.1.4/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1467061143, "title": "Hustling In The World Of Food Trucks and Pop-Ups", "author": "Bloomberg News", "summary": "More people are skipping a trip to a mall and looking for a unique experience, helping fuel the growth of pop-up shops and food trucks. With that in mind, Jenny and Lindsey take a closer look at the growing trend of temporary and mobile retail. Michelle Lam, founder of lingerie company True&Co., describes her \"nomadic\" retailing strategy and its benefits. But operating out of a confined space like a truck has its challenges too, and Adam Sobel of The Cinnamon Snail breaks down the obstacles facing street vendors. Is wanderlust the future of retailing?", "duration": "27:59", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/v1i.aWV1XRrc/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1465850438, "title": "There's Something About Mary Jane", "author": "Bloomberg News", "summary": "As Cannabis seemingly barrels toward federal legalization, Lindsey and Jenny dig into the unique challenges faced by ganja-preneurs in the American states where it's already gained legal status. After a quick breakdown of the plant's history, pot icon Cheech Marin joins us to explain the pitfalls of operating within a semi-legal industry. And cannabis activist Charlo Greene is on hand to explore the  groups that stand a good chance of being left behind.", "duration": "34:44", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vrWBSEdkMyV8/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1464653337, "title": "Craft Is Dead. Long Live Craft.", "author": "Bloomberg News", "summary": "More than ever, people want the stuff they buy to be hand-crafted. Lindsey and Jenny discuss why that is and what that means for big and small businesses. Is ``craft'' simply a meaningless marketing word? Is the movement dying now that big companies are trying to get a piece of the action? Can people tell the difference between ``artisanal'' and generic? The musicians behind the Hanson Brothers Beer Company explain why this is just the beginning of the craft revolution. Bloomberg Reporter Craig Giammonna spells out why for big companies, the race is on to think small. And the founder of Ample Hills Creamery talks about what it takes to grow into a successful business while staying true to the ice cream parlor's Brooklyn roots.", "duration": "27:22", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vDgTCFPm6LrY/v3.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}, {"seriesId": 1116763041, "seriesTitle": "Material World", "pubDate": 1464024265, "title": "Welcome to Material World", "author": "Bloomberg News", "summary": "Meet Jenny Kaplan and Lindsey Rupp, two reporters at Bloomberg News who will be your guides through the consumer universe. What's going on with all the things you buy? Bloomberg is excited to present a taste of this new show. Stay tuned for the first full-length episode May 31.", "duration": "2:44", "imageUrlLg": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/600x600bb.jpg", "imageUrlSm": "http://is5.mzstatic.com/image/thumb/Music62/v4/17/cf/08/17cf083e-9225-b505-fd21-51c7ec683bc9/source/60x60bb.jpg", "audioUrl": "https://assets.bwbx.io/av/users/iqjWHBFdfxIU/vlNZF8g11OGs/v2.mp3", "type": "episode", "tags": ["business", "podcasts", "boston"]}]}