{"series": {"feedUrl": "https://feeds.publicradio.org/public_feeds/make-me-smart-with-kai-and-molly/itunes/rss", "genres": ["Business", "Podcasts"], "title": "Make Me Smart with Kai and Molly", "country": "USA", "author": "Marketplace", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "type": "series", "id": 1181589165}, "episodes": [{"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488825813, "title": "Video: \"Squirrel!\"", "author": "Marketplace", "summary": "You may have noticed President Donald Trump tweeted this weekend. But try not to get distracted. We're talking about that, a busy week for tech news and Kai's leftover preferences on this week's live video.\nJoin us every Monday at 10:30 a.m. Pacific Standard Time on Facebook for our weekly editorial meeting. We like to hear what you're thinking about. And if you can't join us live, let us know what's on your mind in the comments section. We're always checking in throughout the day.\nAnd be sure to subscribe to the podcast on iTunes, on our site or wherever you get your podcasts.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488578892, "title": "Blog: A short history of Uber's many scandals", "author": "Marketplace", "summary": "It's been a tough month for Uber.The super-rich Silicon Valley darling is no stranger to bad PR, but lately Uber's been batting back boycotts, lawsuits and embarrassing leaks all at once. A fresh scandal even broke while we were reporting this story. So how did an app with such a simple pitch — tap a button, get a ride — attract so much trouble? Let's take a look back.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488566048, "title": "Video: FCC Chairman Ajit Pai wants to change our privacy settings", "author": "Marketplace", "summary": "FCC Chairman Ajit Pai intends to roll back rules that require internet providers get customer consent before selling their data. The EPA announced it will not need information about methane from oil and gas well operators. What that means and a whole lot more as we wrap up the Make Me Smart week. Make sure to join us Monday, March 6, at 10:30 a.m. Pacific Standard Time for our weekly editorial video on Facebook Live.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488394055, "title": "6.5: Complexification", "author": "Marketplace", "summary": "President Donald Trump addressed Congress last night and we're back to look at what wasn't in the speech and how to read between the lines.  Plus: founders remorse?  CEO Travis Kalanick apologized to his drivers and employees, this time for losing his temper with a driver who challenged the ride-hailing company's business strategy. We'll talk about reputation, remorse and the ramifications for other companies.", "duration": "00:22:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/03/01/mms_20170301_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488314126, "title": "6: Reddit CEO Steve Huffman is not horsing around", "author": "Marketplace", "summary": "Kai Ryssdal and Molly Wood interview Steve Huffman, the co-founder and CEO of Reddit, a social sharing platform where more than 200 million users share everything from wholesome memes to \"ask me anything\" sessions with newsmakers and celebrities to topics we couldn't possibly describe. Huffman also has the \"most Reddit answer\" to our Make Me Smart question, and we give you a way to think about the president's budget.  Here's the letter Kai mentions up top, by the way.", "duration": "00:28:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/02/28/mms_20170228_20170228_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1488220781, "title": "Video: The envelope, please?", "author": "Marketplace", "summary": "Oscar aftermath, previewing President Donald Trump's budget and how to make your producer crazy. Just another Make Me Smart editorial meeting! Join us every Monday at 10:30 a.m. Pacific Standard Time on Facebook for our weekly editorial meeting. We like to hear what you're thinking about. And if you can't join us live, let us know what's on your mind in the comments section. We're always checking in throughout the day. And be sure to subscribe to the podcast on iTunes, on our site or wherever you get your podcasts.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1487894082, "title": "Blog: What the protest economy means to you", "author": "Marketplace", "summary": "We’re less than two months into 2017, and already we’ve seen one of the largest days of protests in U.S. history, multiple cities divesting from a major bank and an endless list of boycotts proposed by President Donald Trump’s supporters and opponents alike. We’re in a constant state of protest, say Kai Ryssdal and Molly Wood on this week’s Make Me Smart, one that could very well last the next four to eight years.So what does that mean for the economy? Hint: It goes beyond the widespread scarcity of pink yarn that occurred after the Women’s March, though Molly says that did happen.Some of our listeners wrote in to share their stories of how they’ve observed protests informing their local economy, including Naomi, who works at a party store in Bethesda, Maryland:Normally, January and February are our slowest months, enough that we even shorten our hours during this period. But the week before the women's march was crazy. We sold out of almost all our posterboard (all white and most of the colors) and foam board, sold out of pink and pinkish yarn, and sold out of the large sizes of sharpies. At the hardware store next to us, they were running low on paint stirrers because everyone was taking them to use to hold up the signs. We're still out of Elmer's glue, and apparently, so are a number of stores near us.Over in Utah, some small business owners are bracing for the opposite effects after the largest outdoor recreation trade show in the country announced it will not return to Salt Lake City in 2018 after 20 years there. The Outdoor Retailer show occurs biannually and buoyed local businesses.Following the lead of Patagonia and other vendors, the show is pulling out of Utah in protest of Republican politicians’ fight against Bears Ears National Monument and other federally owned land they want turned over to the state.Here’s a take on the situation from Kyle Vines, whose sustainable rock climbing gear business in Colorado stands to benefit if the trade show moves to the area:[I]n 2018 there is a good possibility that Outdoor Retailer could move to Denver, Colorado. That is where our company is located. Having an event of this scale near our headquarters could be huge for our small business. We have our fingers crossed that the trade show will move here. It is crazy to think that Utah Official's inaction and subsequent los[s] could potentially be our gain in a weird way.So we know some small business owners have a stake in the protest economy, but what about entire cities? An Op-ed by Ben Cohen of Ben & Jerry’s written ahead of the 2004 Republican National Convention in New York City challenged the notion that protesters are a “ragtag bunch” and put it simply: “cash-carrying people are cash-carrying people.”Cohen scolded then-Mayor Michael Bloomberg for not welcoming protesters alongside convention-goers and overlooking the revenue they’d bring to the city by way of hotel rooms, restaurants, transportation and other purchases.If protesters were properly invited and assured of a safe place to protest, who knows how many would come? Two million? Three million? This could translate into a billion dollars or more for the city.Revisiting this article now, it’s hard not to think back to the women’s march on Jan. 21, a permitted event that brought in nearly a half million people — three times that of Inauguration attendees — and surely boosted Washington D.C.’s local economy for the weekend.Get in touch on the \"Make Me Smart\" website with your own comments and questions for Kai and Molly.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1487699018, "title": "5: Reputation in the age of the protest economy", "author": "Marketplace", "summary": "Reputation matters. Whether it's U.S. Secretary of Defense James Mattis in Iraq, or Vice President Mike Pence in Brussels, Belgium or Travis Kalanick, CEO of Uber. And that's just the stuff that happened this weekend!Sallie Krawcheck answers our Make Me Smart question. Krawcheck is the founder and CEO of Ellevest, an investment platform for women. Previously she was the chief financial officer and ran wealth management at Citigroup.  Also, she ran Merrill Lynch after it was purchased by Bank of America. Molly spins a yarn about the protest economy.  And a listener makes us smart on what you're really supposed to do if you meet a bear. Hint: Don't run.", "duration": "00:26:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/02/21/mms_20170221_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1487282986, "title": "Blog: Scientists and other volunteers are banding together to save data", "author": "Marketplace", "summary": "We do the numbers every day around here. But on this week's \"Make Me Smart with Kai and Molly,\" we got a listener question about the numbers, specifically, data created and distributed by the federal government.President Donald Trump repeatedly slammed government economic data throughout the campaign, and voters followed. A fourth of people we surveyed last fall and nearly half of Trump supporters said they didn't trust the numbers. That attitude, combined with the administration's skepticism and at times outright denial of climate science, has inspired a loosely organized but broad coalition of volunteers dedicated to preserving government data.Groups of coders and scientists have been gathering around the country to scrape the websites for NASA, the Department of Energy, White House and others, then upload data sets and other documents to repositories like the Internet Archive and DataRefuge. PBS Newshour notes that no data have disappeared completely, but changes to government websites have made numbers harder to find. During one of the first UCLA hackathons on Inauguration Day, developers were getting to work just as all mentions of climate change disappeared from WhiteHouse.gov. The White House's data portal has since been cleared out as well. Here's NewsHour's piece on an event at New York University earlier this month: https://www.youtube.com/watch?v=Ph6kT34bh-kThe grassroots Environmental Data and Governance Initiative has planned more events around the country in the coming weeks. The Initiative has published materials and guides to organizing more \"data rescue\" events. Two other developers have created a web app that lets anyone see what data needs to be harvested and contribute from home.That's just for the easy jobs though, scrapes that simply require developers to download spreadsheets or capture webpages. Other government sites require a little more elbow grease.\"All these systems were written piecemeal over the course of 30 years. There’s no coherent philosophy to providing data on these websites,\" tech exec and volunteer Daniel Roesler, told Wired this week. Some coders have to get creative:One coder who goes by Tek ran into a wall trying to download multi-satellite precipitation data from NASA’s Goddard Space Flight Center. Starting in August, access to Goddard Earth Science Data required a login. But with a bit of totally legal digging around the site (DataRefuge prohibits outright hacking), Tek found a buried link to the old FTP server. He clicked and started downloading. By the end of the day he had data for all of 2016 and some of 2015. It would take at least another 24 hours to finish.\nThe New York Times reported this week that these \"data rescue\" missions are just one facet of a new, more politically active scientific community. Energized by Trump's climate policy, and specifically his appointment of prolific Environmental Protection Agency-resister Scott Pruitt to head that agency, researchers are organizing marches and even weighing runs at elected office.Like our guests on the show this week, many scientists behind these efforts draw a distinction between the numbers and narratives you draw out of them. But you need to make the numbers accessible first.\"I'm a great believer in science,\" Myron Ebell, who lead the EPA transition but quit before the inauguration, told the Times. \"But I'm not a great believer in politicized science.\"", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1487095056, "title": "4: It's the economy, Cupid", "author": "Marketplace", "summary": "Time take a look at a big thing that's getting lost in the first four weeks of the Trump administration. Hint: It's the economy. David Frum, senior writer for The Atlantic, answers our Make Me Smart question: \"What's something that you thought you once knew, but turns out you were wrong about?\" We talk with Eric Bickel and Michael Weis of the Quantify Louisville blog. Eric and Michael take publicly available data from the city of Louisville, Kentucky, and look for stories hidden in the data. They talk to us about specific ways to judge the value of any given statistic.And finally, as we move forward into Week 4 of the Trump administration, Molly wants to remind us that  we're going on a bear hunt. Don't worry, we'll explain.", "duration": "00:27:28", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/02/14/mms_20170214_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1487015547, "title": "Video: We're going on a bear hunt", "author": "Marketplace", "summary": "This week on Facebook Live, we got a brand new look. (Spoiler alert: it looks awesome.) Next week we're talking to Reddit co-founder and CEO Steve Huffman, and we want to ask him your questions. Then we talked about cyber security, the Council of Economic Advisers and the protest economy. Oh, and bear hunts. Make sure to subscribe to the podcast on iTunes or wherever you get your podcasts, and we'll talk with you tomorrow.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1486757460, "title": "Blog: What is even happening? A \"Make Me Smart\" look ahead", "author": "Marketplace", "summary": "Hey! Week 3 of \"Make Me Smart\" is in the books, and now we're looking ahead. As usual, we’ll kick off the week with a Facebook Live video. Here are a few topics Kai and Molly might discuss:\n\tPresident Donald Trump and First Lady Melania Trump host Japanese Prime Minister Shinzo Abe and his wife, Akie, at their property on the Mar-a-Lago estate in Florida this weekend.\n\tThe Grammys are this Sunday. And the award for best issues-based acceptance speech goes to …?\n\tTrump meets Canadian Prime Minister Justin Trudeau at the White House on Monday for what the White House describes as “a constructive conversation on strengthening the relationship between the two nations.” I think the meeting could also be reasonably described as a Level 1 GIF alert.\nvia GIPHY\n\tThe RSA Security Conference begins on Monday. Always a great source for terrifying pronouncements about the state of internet security.\n\tIf you find yourself wondering why so many tech leaders are so talkative next week, you can thank Recode’s Code Media conference. Also make sure to thank Kara Swisher, or she will know.\n\tA full Senate vote on Linda McMahon’s appointment as head of the Small Business Administration is scheduled for Tuesday.\n\tFinally, Tuesday is Valentine’s Day. Consider yourself reminded.\nAs always, let us know what you're thinking. There's a handy form on our site that sends your writing straight into my inbox. I (eventually) read every single one of your notes, and I'm always impressed by how thoughtful and helpful you all are as we make our way through our first month of podcasts. Have a great weekend!", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1486670848, "title": "Blog: The strange case of prison phone calls", "author": "Marketplace", "summary": "When we were talking about President Donald Trump's new Federal Communications Commission head Monday on \"Make Me Smart,\" Kai and Molly ran down all the ways Chairman Ajit Pai could quickly change the FCC.Before turning to net neutrality, we touched briefly on prison phone calls. They've been in the news this week, and for good reason: Phone service for the incarcerated is a complicated economic problem caught in a bizarre legal battle and the broader debate over prison reform. It's also worth about $1.2 billion a year.The FCC was sued when it tried to crack down on the charges for those calls a couple years ago, but in a letter late last week, Pai said his agency wouldn't defend the new rules anymore. That made for a very confusing situation in court Monday.“This case is really strange,” one of the judges hearing the case said. But the industry has always been strange. Here's how it works: Calls from inside state and federal prisons are run by a handful of companies, like Pay Tel Communications, ICSolutions and GTL (formerly Global Tel*Link). You might remember that last firm from its cameo on Season 1 of \"Serial,\" a podcast that hinged on calls to and from a Maryland prison. Those corporations win monopolies within prisons by offering a portion of their revenue to the state. These commissions can run above 90 percent in some places.This system can stick the actual customers — that is, the incarcerated and their families — with huge bills. Charges vary depending on where you live, but according to an FCC filing a 15-minute local call could cost up to $25. The Verge has a detailed breakdown of this \"reverse bidding\" process and typical costs in each state. Most inmates' families don't have \"Serial\" money, and a few calls a week can add up to around $1,000 a year.Prison phone service is far from a free market, and it's further complicated by the politics of incarceration. AT&amp;T provided phone service to all prisons until 1984, Cornell professor Steven J. Jackson wrote in this 2005 paper. At that time the market was small: Payphones were only installed in prisons in the '70s, and before that inmates got at most one phone call every three months. The government broke up AT&amp;T over antitrust concerns just as the War on Drugs brought in a crush of new inmates and a surge in prison construction. New companies like Pay Tel emerged to meet that demand and cemented monopolies through a system that was originally designed to increase competition, Jackson wrote.Studies have shown prisoners who communicate with loved ones are less likely to commit more crimes after they get out, the progressive Prison Policy Initiative notes, but the push and pull between security and rehabilitation further complicates the economic relationship between prison, inmate and phone company. Automated security systems drop calls frequently, and users need to pay a new surcharge to get connected. That's lead to investigations and sketchy charges around the country.The FCC voted on new rules to cap charges in 2015, bringing the cost of a 15-minute call down to about $1.65 in most places. The phone companies sued, giving way to a lengthy legal battle and a stay on the cap. So inmates and families are still paying high prices as a federal appeals court tries to sort out arguments from phone companies, states, inmate advocates and, until last week, the FCC.So that's where we're at. Got something to add, or questions about the situation at the FCC? Hit us up on the \"Make Me Smart\" website.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1486495637, "title": "3: Lord of the attention merchants", "author": "Marketplace", "summary": "This week we're talking with Tim Wu, professor of law at Columbia University and author of the book \"The Attention Merchants.\" Back in 2003, Wu coined the phrase \"network neutrality,\" the principle that internet service providers should enable equal access to all content and applications, and not favor one source of content over another. Hint: This is about what you are currently streaming as you read this. Meanwhile, pay attention. All the makers of all that content are fighting for increasingly smaller slices of your attention, and Wu talks about \"the race to the bottom\" when it comes to attention-grabbing tactics. Don't think this has not happened before in history.Also, Gloria Calderon Kellet answers our Make Me Smart question: What's something you thought you knew that you later found out you were wrong about? Calderon Kellet is the co-creator of the rebooted \"One Day at a Time\" series on Netflix with legendary showrunner Norman Lear.", "duration": "00:32:38", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/02/07/mms_20170207_20170207_64.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1486164795, "title": "Kai Ryssdal and Molly Wood take the Marketplace quiz", "author": "Marketplace", "summary": "No matter who you are, you've probably had a rough day at the office that changed your perspective, or maybe you made an impulse purchase you really, really wish you could take back. This week, Marketplace's Kai Ryssdal and Molly Wood, the hosts of \"Make Me Smart,\" took our money-inspired personality questionnaire.You can listen to \"Make Me Smart\" right here, or wherever you download your podcasts. Molly Wood: I think I know the answer to this, but in next to life or maybe later in this one, what would your career be?Kai Ryssdal: Oh, I would be a helicopter pilot in the Grand Canyon.Wood: I did not know the answer to that. Nope, I thought I did, but I didn't. Like for tourists?Ryssdal: Yeah.Wood: Tell me more. Why is this your dream?Ryssdal: 'Cause why wouldn't it be cool to fly a helicopter over, through and around the Grand Canyon? I mean, the problem is with airspace regulations being what they are, you can't actually fly a helicopter through the Grand Canyon. You've got to be like over it and all that jazz. But you know, it'd be cool.Wood: Oh, that's why it has to be the next life.Ryssdal: In my fantasy life. What is something you bought that you now regret buying?Wood: I will tell you a story about a thing that I regretted buying that turned out to be great. Very shortly after I graduated from college, I had my first big-girl job and went into a shoe store, and they had this pair of Italian leather boots. Beautiful, I mean they look like chocolate gorgeousness. I spent $200 on them and for context my rent was $325. So it was not a good idea. I took them home and I was, like, this is not a good idea, this is really not a good idea.I tried to take them back to the store, and she was like, \"Honey, nobody returns $200 leather boots after you've worn them.\"Ryssdal: Oh, you wore them?Wood: Uh-huh. So I was stuck with them. But here's the thing: I had them for 20 years.Ryssdal: Oh, yes. There you go.Wood: Italian leather boots are no joke. I answered the opposite question, but I have never loved a regret purchased more. What is the hardest part about your job that no one knows about you, poor darling?Ryssdal: Oh, man. There are so many ways to answer this question that could get me in to so much trouble. I got maybe two and a half. Number one is you can't always say what you say you want. It's tempting but you can't. The other one, and this is going to be a big, fat \"Boo hoo, cry me a river [answer],\" but daily deadline journalism can be grinding sometimes, and sometimes that's just no fun. Like at Marketplace, we go on the air 2 o'clock in L.A. and you see people going out at 12:15 to have lunch and [I'm just] like no I don't get a lunch hour. So that's kind of a drag, but honestly, there's nothing I don't like about my job.Wood: I remember doing a daily podcast, and I would see those people standing in the halls talking, and I was like, \"What the hell is wrong with you? Don't you have somewhere to be?\"Ryssdal: Yeah, you getting a whole paycheck today pal, or what? What was your very first job?Wood: I think the first time I actually ever got paid for, it was at a grocery store. I was a grocery store checker, and I loved bagging the bags, it was like Tetris. I still love it. I'm still that lady at Trader Joe's who's like, \"Oh, I'll bag it.\" Ryssdal: Somehow that doesn't surprise me at all.Wood: What is your most prized possession?Ryssdal: I mean, a younger me would have said my car, but an older me drives a minivan. I have a picture of my dad, which is him not too terribly long before he died. [My parents] had retired to Florida, and dad was working in a hospital. He was, like, a candy striper except not really a candy striper because he was a 75-year-old man, and it's just him looking straight at the camera, and it's a nice little thing that I have. I guess that's probably up there on the list. I mean, I'm not a possessions kind of guy, but that's up there.Wood: That's a good one.Ryssdal: What advice do you wish somebody had given you before you or as you were starting your career?Wood: I wish that someone had said you don't have to give everything to the company that you work for. That can be ambitious and you can do good work and you can try really, really hard, but you don't marry them. It's a company and it doesn't love you back.Ryssdal: That is so interesting, because my answer to that question is you got to play the hand you're dealt, and if that means, you know, going balls out, then that means going balls out. But you have to remember that my first two careers were sort of non-voluntary, [or I mean] you didn't have much choice once you were there. I spent eight years in the military and then four years in the State Department, and so the answer was when the bell rings you pick up the damn phone, you know?Wood: Which is so fascinating, because, yeah, I apparently evolved in the total opposite direction, which is sometimes the bell will ring, and you will say, \"You know what? No, this is my life and I'm going to live it.\" That's why I changed my mind about the Air Force Academy early.Ryssdal: There you go. And you know what? You had a better time in those eight years.Wood: Yeah, maybe.", "duration": "00:05:49", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/segments/2017/02/03/mp_20170203_seg_31_64.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1486063615, "title": "2.5: The limits of moral capitalism", "author": "Marketplace", "summary": "On this mini episode, we wanted to follow up on a conversation in this week's show about the business community at large, and the tech industry in particular, acting as an unofficial part of the checks and balances in the U.S. government. We also heard from you about whether businesses like Starbucks should even attempt \"moral capitalism.\" The coffee giant plans to hire 10,000 refugees over the next five years, and it's gotten some backlash for it.", "duration": "00:12:28", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/02/02/mms_20170202_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485974478, "title": "Blog: The business of moral capitalism", "author": "Marketplace", "summary": "Who’s more powerful? The President of the United States, or Amazon? Or JP Morgan? Or Apple? We may be about to find out.On \"Make Me Smart\" this week, Kai and I were riffing on fact that businesses seemingly have been on the verge of winning \"bigly\" in President Donald Trump’s economy — fewer regulations, significantly lower taxes, and a potential bonanza of infrastructure projects on which to bid. Instead, many of them are now coming out strongly against the president’s executive order halting immigration from “terror-prone” countries, and are even considering legal battles with the administration over it.Here’s what we said about it on the show:Kai: The businesses in this company are the establishment.Kai: Laws here mean something. When you put your money into this economy, you’re counting on the fact that the law treats everyone equally. Without that … with a thing that happens, like the immigrant visa ban, where a lawful permanent resident of the United States can be banned from coming here — and yes it’s been walked back —but when that happens, without recourse to Congress of the courts, then a stock or a bond is just a piece of paper. And that is just bad for the entire capitalist system that this country has been developed on. And I don't know where we go with that.Molly: Well, where you go is to the central question of whether business becomes one of the systems of checks and balances.In a government like ours, the economy and business are inextricably tied to our democracy—Kai called it a “capitalist constitutionalist system.” And in such a system, where the Supreme Court has given corporations the same rights as people in terms of contributing money to political campaigns, it only makes sense, that a company’s need to protect its employees and revenue streams might start to look a lot like moral activism.Those actions started quickly after Trump’s executive order last week. Facebook’s Mark Zuckerberg arguably opened the floodgates with a post on the site two days after the order, affirming his support for immigration and opposing plans to build a wall along the Mexican border. Google opposed the immigration ban, saying it had up to 200 employees stranded outside the country after the order. Amazon and Uber also were trying to help bring employees home, and other tech companies began to condemn the move, as well. Since then, the drumbeat has only grown.Amazon’s Jeff Bezos now says the company is working on possible legislative solutions, and supports a lawsuit by Washington Attorney General Bob Ferguson.\nApple is also considering legal action. Lyft, Netflix, Twitter, and other tech companies also condemned the order and pledged to fight with donations to the ACLU, among other actions.And the backlash has spread beyond the tech industry to companies like Ford, General Electric, Starbucks (which pledged to hire 10,000 refugees), Nike, Goldman Sachs and jP Morgan. “Being diverse is not optional; it is what we must be,” Goldman Sachs CEO Lloyd Blankfein said in a voicemail to employees on Sunday.Many of these companies, and even business-oriented think tanks and conservatives, are taking the stance because immigration, diversity and open markets are actually crucial to economic growth. Pro-market economists said expanding legal immigration is the only way American businesses can hire enough talent and grow their customer bases enough to hit the growth targets Trump himself has promised.  And there are PR concerns, too. Trump canceled a planned visit to Milwaukee and an administration official told CNN that it was because the company he planned to visit, Harley Davidson, was spooked by the threat of large protests. (Harley Davidson said no visit was scheduled.)So, business has come off the bench even, as CNN’s Christine Romans pointed out, at the risk of “shareholder value.”  Obviously, though, mixing business and politics isn’t without its problems, for both the businesses and potentially for consumers (you know, “citizens”).Uber faced a social media campaign when people believed it was profiting from a taxi strike in New York City that was held to protest Trump’s immigration ban. The #deleteUber campaign reportedly caused so many people to cancel their accounts that Uber had to scramble to create an automated system for it.There was a #boycottStarbucks hash tag trending briefly on Twitter, as Trump supporters rallied against the company’s support for hiring immigrants.And the stances could be financially risky, too. While we were taping our podcast on Tuesday, a friend mused to me in text that he’s considering selling Netflix stock because the President’s tweets about it (and potentially its policies) might really damage its business. Plus, we’ve seen what can happen to a company’s stock—even temporarily—when the President calls it out as not being administration-friendly.Politically-leaning outlets on both left and right are picking up new friends or foes among the companies that either speak out or stay silent as more policies roll out.Of course, our listeners are also concerned, rightly in my view, about an increase in the power of corporations over our lives. The same friend who mused about Netflix stock also pointed out the risk of “future extraterritoriality of businesses,” and their rights to maintain private security forces. Those kinds of checks and balances could get quickly out of hand. And lots of us clearly watch the same kinds of TV shows.@kairyssdal @mollywood so... how long till the United Corporations of America (or the world)? #scifidystopia— jjaricha (@wearehere18) February 1, 2017\nOthers worry that business has already influenced politics too much.@kairyssdal @mollywood It's also a very very bad thing, given that business already controls 2/3 of the other branches.— Larry Garfield (@Crell) February 1, 2017\nAnd then there’s the question of who really benefits from an increase in corporate participation.@kairyssdal @mollywood The side effect: the rich who buy from the businesses have more influence than the poor who do not.— Ken F (@sahuargrapes) February 1, 2017\n\n@kairyssdal @mollywood I agree; But will/should these companies favor US interests or their GLOBAL shareholders/employees/customers?— David Miller (@DavidMillerBG) February 1, 2017\nAll fair questions, and ones we’ll be keeping an eye on as things progress. Please keep the comments coming! Email them to us at makemesmart@marketplace.org or tweet us. We’re listening.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485892405, "title": "2: Checks and balances and business", "author": "Marketplace", "summary": "Checks and balances: that's a phrase you usually hear when we talk about the branches of government.  But on this week's \"Make Me Smart,\" we discuss the possible changing role for corporations as they react to President Donald Trump's executive order on immigration.  Plus, the robots are taking over, right? We talk to Scott Phoenix,  co-founder of Vicarious, a company that is trying to build a new kind of artificial intelligence. And Norman Lear, legendary television producer and writer, answers our \"Make Me Smart\" question: what is something you were wrong about that you were once sure of?And don't forget: we'll be live on Facebook on Monday at 10:30 a.m. PST to talk about stories for next week's podcast.", "duration": "00:37:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/01/31/mms_20170131_20170131_64.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485798890, "title": "Video: Kai and Molly answer your questions", "author": "Marketplace", "summary": "On this week's Facebook Live video, you had lots of questions about the impact of President Donald Trump's executive order, which among other things, suspended entry of refugees to the United States for 120 days. Also on your mind, what consequences that might have for the global economy. Nelson Arce asked: \"China appears to be volunteering to 'step up' to become the new global economy leader. What might that mean for the USA long term?\"  Kai Ryssdal: Not just appears to be, they are. Xi Jinping went to the World Economics Council in Davos ... and he gave a speech that the president of the United States could have given. Talking about multilateralism, and global trade, and engagement, and all of that stuff. You take that speech, you thrown in the TPP being thrown out by the Trump White House, and yeah, they're absolutely looking to take that. And here's the other thing you have to remember, in 30 years plus or minus, China's going to be the biggest economy in the world, no matter what happens. And so the question we have to think about in this country is, how are we going to feel when that happens, what are we prepared to do if we decide as a country that's not something we want, and what does it mean in the global sense? Because huge part of what it means to be the biggest economy in the world is not straight-up economic. It's cultural, with movie exports, it's technological and it's political.\"We got a lot of questions about airlines, and how they're reacting to Friday's executive order.Molly Wood: Some airlines, like Emirates, are having trouble staffing flights, because they're afraid that when their flight attendants come to the U.S., that they might not be able to get in or out. When one market shuts down, when an entire global market shuts down, pulls down the shutters, what happens? There are bound to be gigantic ripple effects.And finally, to answer a question from Kurt Liestenfeltz: No, Kai Ryssdal is still not eating the whole egg at his sad desk lunch.  Tune in next Monday at 10:30 a.m. Pacific Standard Time to ask Kai and Molly your questions. We usually start out on Kai's Facebook page, but you can also find the video on Marketplace's Facebook page.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485459909, "title": "Blog: Donald Trump's situation isn't new — presidential conflicts of interest date back to George Washington", "author": "Marketplace", "summary": "As this week's flurry of executive orders from the Trump administration has shown, the presidency has changed significantly over two centuries. But presidential conflicts of interest are as old as the republic itself.This came up on the first episode of \"Make Me Smart with Kai and Molly.\" We talked briefly about George Washington's wealth. Many of you wrote in to remind us Washington owned slaves. Others, like Ed Kitlowski, compared the Founding Fathers to President Donald Trump and his aides' talking points:\"George Washington had more to gain financially in getting independence from Britain than as President,\" Kitlowski wrote in an email this week. \"One could make a strong argument that many of our founding fathers were opportunists.... The story of our independence is more creation myth than historical record. Our history books use 'alternative facts' in regards to much of the events.\"That's an idea that first got off the ground in 1913, with Charles Austin Beard's \"An Economic Interpretation of the Constitution of the United States.\" The book lays out in great detail the financial interests of all the Founding Fathers and declares Washington \"probably the richest man in the United States at his time, and his financial ability was not surpassed among his countrymen anywhere.\" He owned land across several states worth hundreds of thousands of dollars and had thousands more in stocks and bonds.That was a challenging idea at the time, said Jason Gart, a historian and vice president at the research firm History Associates. Sure, Trump owns a lot of real estate, but it can't really compare to what Washington's holdings meant for him at the time.\"He was more than just a landowner,\" Gart said. \"To say someone is a landowner in the early republic, during that period, that means you're the top of society.\"Indeed, Washington's fortune sparked some of his resentment toward colonial rule. After winning a lower legislature seat, Washington spent his 20s and 30s building up his plantation at Mount Vernon, according to his biography from the University of Virginia's Miller Center. Washington grew tobacco at first, but trade agreements with Britain meant it wasn't a moneymaker. He changed out his fields and got into weaving and fishing, all with the goal of decoupling his business from Great Britain.That vast fortune was built on slavery: Mount Vernon was home to some 150 slaves before the Revolution and 318 when Washington died in 1799, writes University of Delaware professor Erica Armstrong Dunbar. Throughout his presidency, Washington skirted laws that would have compelled him to free his slaves, and promoted legislation that made it easier to seize runaway slaves. In fact, Washington spent his last years chasing one such runaway. Dunbar wrote a book on that slave, Ona Judge, and summarized her story two years ago in a New York Times op-ed:\nWhat prompted Judge’s decision to bolt was Martha Washington’s plan to give Judge away as a wedding gift to her granddaughter. Judge fled Philadelphia for Portsmouth, N.H., a city with 360 free black people, and virtually no slaves. Within a few months of her arrival, Judge married Jack Staines, a free black sailor, with whom she had three children. Judge and her offspring were vulnerable to slave catchers. They lived as free people, but legally belonged to Martha Washington. Washington and his agents pursued Judge for three years, dispatching friends, officials and relatives to find and recapture her. Twelve weeks before his death, Washington was still actively pursuing her, but with the help of close allies, Judge managed to elude his slave-catching grasp.\nJimmy Carter and his peanut farm represent a more recent and frequently cited example of a president who entered office with sizable investments. Separated by centuries, Mount Vernon and Trump's vast business empire may seem like apples and oranges. But Washington serves as a reminder that a man with many financial resources and potential conflicts of interest has assumed the nation's highest office before.\"I always like to joke that every time history repeats itself, the price goes up with it,\" Gart said. \"It's easy to always think that the times we're living in is unique, and they never are. They never are.\"", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485369258, "title": "Blog: Founding conflicts, conflicting numbers", "author": "Marketplace", "summary": "In case you missed it in our barrage of tweets, Marketplace’s new podcast, Make Me Smart, is live! \nIn yesterday’s inaugural (get it?) episode, we engaged in a news-filtering exercise in which we tried to separate group the flurry of actions coming from the Trump administration into those you might expect from a very conservative Republican administration and Congress, and those that fall into what might be described as\"non-standard\" territory.We also gathered voices from President Donald Trump's inauguration and from the women’s march in Los Angeles, and we tried to answer some of your questions  on whether Trump tweets might create insider trading conflicts, and on how to tell good numbers from bad.So, I promised you a nameWe also talked about the Bureau of Labor Statistic's monthly Employment Situation report, which we often short-hand as the \"jobs\" report.  We wanted to better understand the process of polling a group of people. I mentioned an interview about online polling that I did for Marketplace Tech (I think I said Marketplace Weekend, but my mistake) before the election. I couldn't remember her name when we were recording, but the interview was with Sunshine Hillygus of Duke University. She said the business of polling has gotten dangerously out of hand.“I think we have to be really careful to distinguish different types of online polls. Conducting a poll online just means it’s a particular method or mode by which we contact people. And there are scientific online polls, and then there are some really really terrible flash polls,” she said. “These are flash polls, opt-in online polls, and these are ones that are really different from the scientific polling that can be conducted online.”Take a listen to my full interview with Hillygus here, it begins at about 3:17.I know that none of that answers the question of statistics, and how government agencies come up with the numbers they come up with, and how to tell if those are fishy — we're working on that topic for a future discussion.Now, about George...Ok, on to George Washington because, wow, do you guys know a lot about George Washington. When we promoted Make Me Smart on Marketplace this week, I mentioned that Washington’s wealth came mostly from land speculation. Sean Miller, among others, wrote in with this important point:  While it is true that he obtained much of his working income as a young man as a surveyor (including surveying the land with Jefferson and L'Enfant for the federal District), Washington had a generous family backing to start with, and more importantly, Washington's income throughout his life was largely based upon his slaves. For instance, he ran the largest distiller in early America — all powered by slavery. He also operated one of the largest cider mills in America, among many other plantation efforts that produced large sums of income over his entire life (he had slaves starting when 11 years old!), so much so that he was able to free his slaves at his death, unlike many of his financially indebted contemporaries like Jefferson.In another example of the exact kind of awesomeness that comes from asking our listeners for answers, here’s one from Tom Guglielmo. He’s an associate professor of American Studies at George Washington University, and wrote about the topic of owning slaves and the conflict of interest therein:\nOn today's Make Me Smart episode, you claimed that GW's wealth came primarily from land speculation.  I have to believe some significant chunk of his wealth — perhaps most of it — came from his ownership of other human beings. Worth looking into, especially given the overall topic of conflicts of interest and, in this case, the protection and proliferation of the peculiar institution. Based on a quick search, it appears that twelve U.S. presidents owned enslaved people, and the wealth they derived from this ownership was enormous.\nIf you want to learn more about that, Guglielmo suggests research from Robert Lopresti, a librarian at Western Washington University, and this article by Ta-Nehisi Coates, which describes just how much wealth was derived from holding slaves.And in a comment I got on Twitter, @AndyRose12 pointed out that even Washington’s land speculation likely involved taking land from native populations.These are the smart follow-ups that make me so excited for the future of Make Me Smart, so thank you. We won’t always have all the answers, or a broad enough historical or cultural perspective on any given issue. But together, we just might get there.The other sideAnd speaking of togetherness, in the podcast Kai talked about the voices we heard on this week’s show: our questions from the inauguration and LA women’s march on what people on each side of our current political divide wanted the other side to know.Without reservation, most people we interviewed basically wanted “the other side” to know that they’re good people, they love America, and they want a dialogue.So the question then is, what’s keeping us from that dialogue? This is something we’re going to be exploring on the podcast, so look for that to be an ongoing theme.Make sure to tune in every Monday on Facebook at 10:30 a.m. PST to join our conversation about what should be on the podcast the following Tuesday. It’s really helpful for us to hear what you’re thinking!", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485269286, "title": "1: The land of unintended consequences", "author": "Marketplace", "summary": "On the first full episode of Make Me Smart, we explored how to tell the difference between party-line political changes and \"non-standard\" changes in the new Trump administration. We also answered your questions about whether government statistics are accurate, and heard from Autodesk CEO Carl Bass.Our first listener question this week came from Bob Price, who wanted to know whether it was possible for insiders to make a profit shorting stocks of the publicly traded companies the president mentions on Twitter. Nick Colley asked: \"Numbers get thrown around a lot — how do we as citizens question the legitimacy of those numbers?\"Make sure to review us on iTunes and anywhere you get this podcast, and join us for our next Facebook Live video on Monday at 10:30 a.m. PST.\"Make Me Smart with Kai and Molly\" is produced by Jennie Josephson, Bridget Bodnar and Nancy Farghalli. The podcast was engineered by Daniel Ramirez. The theme music was composed by Ben Tolliday and Daniel Ramirez.", "duration": "00:27:35", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2017/01/24/mms_20170124_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1485195839, "title": "Video: Welcome to Make Me Smart", "author": "Marketplace", "summary": "Welcome to the first week of our brand-new podcast, \"Make Me Smart with Kai and Molly\"! You've already heard what the show's about in general, now we want to hear from you: what  do you want to be made smart about? We went live on Facebook to get acquainted and talk it over, because none of us is as smart as all of us.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1484862296, "title": "The day we drank all the coffee", "author": "Marketplace", "summary": "We're usually split up when we tape \"Make Me Smart.\" Most of the team is with Kai at Marketplace headquarters in LA, while Molly tapes all the way up in the Bay Area. But back in December we met up in San Francisco's Mission District with a photographer to shoot our cover art and make a video explaining what the show is all about.We rolled up to The Cavalier bright and early and started ordering coffee. Lots of coffee.Ahead of our launch next week, we're excited to share this (perhaps over-caffeinated) preview with you.https://www.youtube.com/watch?v=0Nq20qp2hZwMonday, January 23rd, we'll be going live on Facebook at 10:30 a.m. Pacific to talk about the show. We'll be asking you what YOU want to hear on the show, because after all, none of us is as smart as all of us. Our first episode launches Tuesday! So make sure to subscribe on iTunes or wherever you listen to podcasts.If you're already subscribed, help us out by rating and reviewing the show. It really helps other people find us!For ALL things Make Me Smart be sure to check out our website. That's where you'll find full episodes, blog posts, videos, and a bunch of other smart stuff.Video credits:Photography: Christopher MichelVideo production: Ben HethcoatMusic: \"The Informant\" composed by Ben Tolliday and Daniel Ramirez", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1484851989, "title": "Make Me Smart on Facebook Live", "author": "Marketplace", "summary": "Join us on Monday, January 23rd at 10:30 a.m. PT for a Facebook Live video to kick off the launch of  our new podcast, \"Make Me Smart with Kai and Molly.\"We'll be taking questions and comments so we hope to hear from you. You'll find us at that time on Kai's Facebook page or via the Marketplace page. We'll be making those live video chats a regular Monday thing, to get your input on the week's news. And be sure you're already subscribed to the podcast - on iTunes or anywhere you like to get your podcasts. Our first official episode drops on Tuesday, January 24th. We'll be putting those out weekly, too.In the meantime, why not share your questions for us  by using #makemesmart or leaving us a rating in iTunes. It helps spread the word - because none of us is as smart as all of us.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1484094408, "title": "Blog: Make Me Smart update", "author": "Marketplace", "summary": "Hey everyone,Just a quick update to let you know that we're working hard to get ready for the official launch of \"Make Me Smart with Kai and Molly,\" our new podcast dedicated to, you guessed it,  getting smart about business, tech, culture, and how all those things affect each other and your everyday lives.Our first show will go live Tuesday, January 24, right after inauguration weekend.Here are some things you can do until then:Subscribe to the podcast!Listen to the mini episodes:Mini Ep 1: Unanswered and unintendedMini Ep 2: The golden lobby paradeMini Ep 3: Unlock the vault! Write us at makemesmart@marketplace.org and let us know what you want to get smarter about, and how we can help. Or tell us about your expertise, because as we're going to say a lot, none of us is as smart as all of us together.Talk to you soon,Kai and Molly", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1482355237, "title": "Mini Ep 3: Unlock the vault!", "author": "Marketplace", "summary": "It's the last mini episode of Make Me Smart before the new year, and we're going to unlock the vault and share some moments from the never before heard Make Me Smart Pilot Sessions. We discuss whether government can be run as business, why Apple got a foothold in China but Uber didn't, Molly's plan for the zombie apocalypse, and of course, Twitter. So much Twitter.Make Me Smart with Kai and Molly launches January 23rd. Sign up for more information and let us know what you think. And make sure to review us on iTunes!", "duration": "00:12:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2016/12/21/mms_20161221_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1481753364, "title": "Mini Ep 2: The golden lobby parade", "author": "Marketplace", "summary": "On the latest episode of Make Me Smart, the President-Elect meets with technology leaders from Google, Microsoft, Amazon, Facebook and more.  And, what's Kanye got to do with it?  Plus, we answer a listener question about housing starts. Make Me Smart with Kai and Molly launches January 23rd. Sign up for more information and let us know what you think.", "duration": "00:13:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2016/12/14/mms_20161214_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1481300198, "title": "Mini Ep 1: Unanswered and Unintended", "author": "Marketplace", "summary": "We discuss the unanswered questions and potential consequences of one well-meaning press release on a mini-episode of \"Make Me Smart.\" Facebook, Twitter, Microsoft and YouTube announced recently that they will team up to fight terrorist propaganda online.  Read along with the joint press release as we work through what's left unsaid, and how it might impact you.Also a listener has a question on health savings accounts. Help us answer by emailing makemesmart@marketplace.orgMake Me Smart with Kai and Molly launches January 23rd. Sign up for more information and let us know what you think.", "duration": "00:10:50", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2016/12/09/mms_20161209_128.mp3", "type": "episode", "tags": []}, {"seriesId": 1181589165, "seriesTitle": "Make Me Smart with Kai and Molly", "pubDate": 1480352504, "title": "Introducing \"Make Me Smart with Kai and Molly\"", "author": "Marketplace", "summary": "\"Make Me Smart with Kai and Molly\" is a podcast about the economy, technology and culture. Hosts Kai Ryssdal and Molly Wood will use their expertise to connect the dots on the topics they know best, and get help from listeners and experts about the ones they want to know better. Subscribe now — the conversation begins January 2017.", "duration": "00:02:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music122/v4/6e/5b/91/6e5b91ac-d9ca-49e5-ebfd-6a2c3c479439/source/60x60bb.jpg", "audioUrl": "https://play.podtrac.com/APM-MakeMeSmart/play.publicradio.org/itunes/d/podcast/marketplace/make_me_smart/2016/11/28/mms_20161128_20161128_128.mp3", "type": "episode", "tags": []}]}