{"series": {"feedUrl": "https://rss.art19.com/the-mysterious-secrets-of-uncle-berties-botanarium", "genres": ["Comedy", "Podcasts"], "title": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "country": "USA", "author": "South Coast Shenanigans and Stitcher with Jemaine Clement", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "type": "series", "id": 1197664141}, "episodes": [{"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487741100, "title": "Episode 12:  Revenge of The Towels", "author": "", "summary": "In the season one finale, tensions escalate when a dispute between Lord Joseph Banks and his Anderlugian hosts over a conical hat and some towels spirals out of control, with dramatic consequences. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello, Greedy Pete), Stephen Templer (Illustrator), Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley), Peter Daube (Captain Quaker), Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania), Rob Mokaraka (Gravy Guide), Jason Whyte (Wolfgang Von Kripp), Loren Taylor (Hjelke), Duncan Sarkies (Bjorn), Hannah Banks (Gru) and Miranda Manasiadis (Thorid). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:28:50", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/7e0cfb61-4399-4810-9485-7a6087aec287.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487740320, "title": "Episode 11: Encounter in the Anderlugians", "author": "", "summary": "As the Anderlugians host the crew of the Fortitude to an evening of glogg and salty pudding, Lord Joseph Banks has to contend with an insubordinate trouble-maker who has ideas above his station. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello, Greedy Pete), Stephen Templer (Illustrator), Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley), Peter Daube (Captain Quaker), Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania), Rob Mokaraka (Gravy Guide), Jason Whyte (Wolfgang Von Kripp), Loren Taylor (Hjelke), Duncan Sarkies (Bjorn), Hannah Banks (Gru) and Miranda Manasiadis (Thorid). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:29:35", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/665e6be7-66d5-48b2-80d7-d001fa22f4c5.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487740140, "title": "Episode 10: Tempation in the Bubbles", "author": "", "summary": "Lord Joseph Banks and his crew bravely set forth for a journey that will probably result in certain death: traversing the treacherous Boiling Ocean. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello, Greedy Pete), Stephen Templer (Illustrator), Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley), Peter Daube (Captain Quaker), Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania), Rob Mokaraka (Gravy Guide) and Jason Whyte (Wolfgang Von Kripp). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by:  Nic McGowan and Thomas Press.", "duration": "00:27:39", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b58986ae-ca70-484a-8397-2cc5d22f300c.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487137800, "title": "Episode 9: Sacrilege in Bativia", "author": "", "summary": "A religious plant ceremony offends Lord Joseph Banks' sensibilities, and he takes the law into his own hands, with disastrous consequences. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello, Greedy Pete), Stephen Templer (Illustrator), Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley), Peter Daube (Captain Quaker), Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania), Rob Mokaraka (Gravy Guide) and Jason Whyte (Wolfgang Von Kripp). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:32:53", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/14b25b5d-1fb6-46de-a58e-747b8a58b39e.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487137200, "title": "Episode 8: The Disrespectful Ex-Patriate", "author": "", "summary": "Arthur C Oldham Burroughs hosts Lord Joseph Banks to a night of reverie that leads to dangerous temptations and forces him to question the morality of his much loved Uncle Bertie. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) Peter Daube (Captain Quaker) Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania) and Rob Mokaraka (Gravy Guide). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Season 1 Audio Design by:  Nic McGowan and Thomas Press.", "duration": "00:31:35", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/dc86cc4f-71aa-4d44-9866-cf69943b3904.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1487136600, "title": "Episode 7: The Trail of Monocle", "author": "", "summary": "Lord Joseph Banks scours the port of Batavia in search of his Uncle Bertie. A clue leads him to Arthur C Oldham Burroughs, an expatriate writer with controversial views on Lord Banks' mission. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) Peter Daube (Captain Quaker) Mick Rose (Arthur C. Oldham Burroughs), Keagan Fransch (O'mara'ania) and Rob Mokaraka (Gravy Guide). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:30:22", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/63c1d878-d1f0-4d96-bb86-3b7d97def199.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1486531800, "title": "Episode 6: Consternation at Butterfly Island", "author": "", "summary": "The weather turns foul and Lord Joseph Banks' mood turns even fouler when a higher authority threatens his chances of catching an Admiralis Mirabilis. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) and Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) and Peter Daube (Captain Quaker). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:24:50", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/fa269896-cd6e-4da6-b4e5-7e6e2f0625a6.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1486530900, "title": "Episode 5: The Miracle Admiral", "author": "", "summary": "Lord Joseph Banks makes the HMS Fortitude set course for a mountainous island for a highly important mission to catch a rare butterfly. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) and Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) and Peter Daube (Captain Quaker). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:22:49", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/a5a38c9a-e899-4f88-b989-6a6f46a52dfc.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1486530000, "title": "Episode 4:  The Curse of the Shantysucker", "author": "", "summary": "Lord Joseph Banks negotiates with the Anderlugians, ramping up tensions in the process. But his efforts at diplomacy are not appreciated by all. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) and Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) and Peter Daube (Captain Quaker). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Season 1 Audio Design by: Nic McGowan and Thomas Press.", "duration": "00:22:41", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/6f87274a-3811-44f6-92a9-15a55e9beab9.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1485934200, "title": "Episode 3: The Enemy of Aristocracy", "author": "", "summary": "An ominous warbler brings news that the dreaded Anderlugians seek a rendezvous, but Lord Joseph Banks faces a greater enemy within his own ranks. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) and Stephen Templer (Illustrator) Tom Clarke (Young Nick), Gavin Rutherford (Nutty), Madeline McNamara (Edna Halley) and Peter Daube (Captain Quaker). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Audio Design by: Nic McGowan and Thomas Press. A co-production of South Coast Shenanigans and Stitcher. Executive Produced by Chris Bannon. For more information, visit www.unclebertie.com.", "duration": "00:20:59", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/ddf73132-7265-478b-b717-0f8a016fa8d2.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1485932400, "title": "Episode 2: The Dangers of Pleasure", "author": "", "summary": "Lord Joseph Banks assembles a crew for a noble mission: to go to the very source of pleasure, in order to destroy it. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Introducing Nigel Collins (Salty Jules, Dr. Fincello) and Stephen Templer (Illustrator). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Produced by Fiona Elwood. Audio Design by: Nic McGowan and Thomas Press. A co-production of South Coast Shenanigans and Stitcher. Executive Produced by Chris Bannon. For more information, visit www.unclebertie.com.", "duration": "00:22:05", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b8186741-2ebf-4907-8c51-1141ca8e11f8.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1485928800, "title": "Episode 1:   Cheese Dreams and Gravy Isles", "author": "", "summary": "Lord Joseph Banks, the squillionaire nephew of the controversial botanist Bertie Banks, has an auspicious encounter with a cheesemonger. His resulting cheese dream leads him and his servant Solander to his uncle's botanarium, where he discovers Bertie's magnum opus, and decides to embark on a great adventure. Featuring Jemaine Clement (Lord Joseph Banks), Lawrence Arabia (Solander) and Jonathan Brugh (Narrator). Written and directed by Duncan Sarkies. Music by Lawrence Arabia. Original artwork by Stephen Templer. Audio Design by:  Nic McGowan and Thomas Press. A co-production of South Coast Shenanigans and Stitcher. Executive Produced by Chris Bannon. For more information, visit www.unclebertie.com.", "duration": "00:30:20", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/c7d6ad7f-be3b-4742-a160-2f5ac1100e9c.mp3", "type": "episode", "tags": []}, {"seriesId": 1197664141, "seriesTitle": "The Mysterious Secrets Of Uncle Bertie's Botanarium", "pubDate": 1484953200, "title": "Season 1 Preview", "author": "", "summary": "Premiering Wed 2/1. From Stitcher and South Coast Shenanigans, The Mysterious Secrets of Uncle Bertie’s Botanarium is a 12 episode scripted fantasy adventure starring Jemaine Clement (Flight of the Conchords). Listen each week as Lord Joseph Banks (Clement) sets sail to find a plant known to be the very source of pleasure in the world: Heaven’s Clover.", "duration": "00:02:05", "imageUrlLg": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/600x600bb.jpg", "imageUrlSm": "http://is3.mzstatic.com/image/thumb/Music122/v4/29/4c/28/294c28ab-d1d8-d07a-224c-f4530e4b889e/source/60x60bb.jpg", "audioUrl": "http://rss.art19.com/episodes/b5222491-4530-416a-b2c3-676c31b7af4f.mp3", "type": "episode", "tags": []}]}