{"series": {"feedUrl": "http://unshakeable.libsyn.com/rss", "genres": ["Investing", "Podcasts", "Business"], "title": "Unshakeable by Tony Robbins", "country": "USA", "author": "Tony Robbins", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/60x60bb.jpg", "type": "series", "id": 1207627404}, "episodes": [{"seriesId": 1207627404, "seriesTitle": "Unshakeable by Tony Robbins", "pubDate": 1488393474, "title": "Episode 4: Who Can You Really Trust? | Pulling Back the Curtain on the Tricks of the Trade", "author": "", "summary": "<p>How often would you like your financial advisor to think of what’s best for you when giving you financial advice? Half of the time? All of the time? It almost seems like a silly question to ask; why would you say anything less than “all of the time?” The whole point of hiring an advisor is to have someone you can trust to help you make the best choices possible with your money.</p> <p>The sad truth is that many financial advisors don’t view this as the primary function of their job.</p> <p>Out of the 310,000 financial advisors in the US, how many do you think are required to act in your best interest? 50%? 25%? The shocking truth is that less than 10% of all financial advisors in the United States follow the fiduciary standard — which legally requires financial advisors to put your interests ahead of their own.</p> <p>It gets even scarier. Of the 10% of financial advisors who are fiduciaries, many are dually registered — meaning they can act as both a broker and a fiduciary. Legally, they don’t even need to notify you of their dual status, or whether they’re acting as a fiduciary or a broker at any given time! Talk about trust issues; would you ever go see a doctor who is only required to give you “good” medical advice during half of your visit? (And she doesn’t have to tell you which half of the visit.)</p> <p>If you can’t trust 90% of financial advisors to act in your best interests, and many of the remaining 10% will only act in your best interests some of the time, then who can you trust?</p> <p>That’s just the question Tony set out to answer when he wrote Unshakeable. Designed as your go-to financial freedom playbook, Unshakeable gives investors the knowledge they need to be truly unshakeable — unfazed by financial winters, prepared for anything, and wise enough to know who they can trust and who they can’t.</p> <p>Having someone by your side who you can count on to give you the best advice for your money is a key part in planning for the financial future you want. That’s why it’s so important that you make sure your financial advisor — even a registered fiduciary — keeps you on track, and doesn’t prioritize their own needs over yours.</p> <p>Even though the numbers look stacked against you, it’s possible to find a trustworthy financial advisor. There are over 5,000 firms and individuals in the US that will act in your best interest.</p> <p>In this episode of The Unshakeable Podcast, Richard Bradley sits down with Tony and Peter Mallouk to explore the process of finding a financial advisor you can trust and how to identify the ways your financial advisor may be working for personal gain, instead of for you.</p> <p>This episode of the Unshakeable podcast has been b<span style=\"font-weight: 400;\">rought to you in collaboration with Creative Planning, an SEC Registered Investment Advisor, where Tony Robbins is a board member and Chief of Investor Psychology. Mr. Robbins receives compensation for serving in this capacity and based on increased business derived by the company from his services.</span></p>", "duration": "28:38", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/unshakeable/tony_robbins_04_WhoCanYouReallyTrustV2.mp3?dest-id=480137", "type": "episode", "tags": ["money", "investing", "finance", "tony", "robbins"]}, {"seriesId": 1207627404, "seriesTitle": "Unshakeable by Tony Robbins", "pubDate": 1487651003, "title": "Episode 3: Rescuing Our Retirement Plans —  What Your 401(k) Provider Doesn’t Want You to Know", "author": "", "summary": "<p><span style=\"font-weight: 400;\">Richard Bradley interviews Tom Zgainer and Josh Robbins of America’s Best 401k</span></p> <p><span style=\"font-weight: 400;\">When is the last time you went to the store and bought something without knowing the price? Never? You may have laughed at the absurdity of the question when you first read it — who would buy anything without knowing how much it costs first?</span></p> <p>It turns out most Americans do. Over 70% of people who invest in 401(k) plans have no idea how much they pay in fees to their plan providers. That means more than half of Americans are paying to invest in a 401(k), without first knowing the price!</p> <p>Why are so many Americans unaware of the fees they pay? Why don’t more people ask to review the fees, before agreeing to a plan? Sadly, most people wouldn’t even know what to ask. For over three decades, the companies offering these 401(k) plans weren’t required to provide any information to you about how much they charge you in fees. Even now, when they are legally required to do so, 401(k) providers use convoluted documents to hide their fees in plain sight. How can you ask about the cost of fees for your plan, if you didn’t know there were any fees in the first place?</p> <p><span style=\"font-weight: 400;\">In Chapter 4 of</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em><span style=\"font-weight: 400;\">, Tony Robbins and Peter Mallouk break apart the complicated industry of retirement plans, and the fees they try to hide from you. More than 90 million Americans invest in 401(k) plans. For most of us, it seems like a no-brainer. Your employer takes the contribution straight from your paycheck, which helps you save on your taxes every year — plus you get to save for retirement. Even if you do pay some fees, it’s not that much money… right?</span></p> <p>It turns out that paying even 1% more in fees than you need to can dangerously slash your nest egg. Take the example of an average American worker, making $30,000 a year and putting 5% of each paycheck into a 401(k). Over the lifetime of this investment, an extra 1% in fees will result in a loss of almost $154,000 — and that’s not even including what you would have earned, with compound interest, if that money had been invested in your plan. For each 1% in unnecessary fees, you lose potentially 10 years of retirement income. So much for the “golden years.”</p> <p><span style=\"font-weight: 400;\">Making matters worse, most well-meaning business owners are just as unaware of the fees as their employees. They may think they’re providing the best for their employees, but the convoluted nature of the industry makes it just as difficult for them to see the true cost of fees. When it comes to 401(k) plans,</span> <span style=\"font-weight: 400;\">employers and employees are on the same side — as most business owners are also heavily invested in the company’s 401(k) for their own retirement savings.</span></p> <p>In this episode of the Unshakeable Podcast, Tom Zgainer and Josh Robbins of America’s Best 401k speak with Richard Bradley, Editor-In-Chief of Wealth Magazine, to shatter the misconceptions in the complicated world of 401(k) plans. Advocating for yourself — and your investments — may be more important than you realized; it may make the difference between thriving or barely surviving retirement.</p> <p> </p> <p><span style=\"font-weight: 400;\">Legal Disclosure: Tony Robbins is a board member and Chief of Investor Psychology at Creative Planning, Inc., an SEC Registered Investment Advisor (RIA) with wealth managers serving all 50 states. Mr. Robbins receives compensation for serving in this capacity based on increased business derived by Creative Planning from his services. Accordingly, Mr. Robbins has a financial incentive to refer investors to Creative Planning.</span></p>", "duration": "44:25", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/unshakeable/tony_robbins_03_Rescuing_our_retirement_plansV1.mp3?dest-id=480137", "type": "episode", "tags": ["money", "investing", "business", "tony", "robbins"]}, {"seriesId": 1207627404, "seriesTitle": "Unshakeable by Tony Robbins", "pubDate": 1487494518, "title": "Episode 2: Hidden Fees and Half-Truths — How Wall Street Fools You into Overpaying for Underperformance", "author": "", "summary": "<p><span style=\"font-weight: 400;\">Tony and Peter Mallouk discuss the hidden fees your financial advisor probably isn’t telling you about, and how</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em> <span style=\"font-weight: 400;\">can arm you to remove these fees before they damage your future.</span></p> <p><span style=\"font-weight: 400;\">What do you see yourself doing when you’re 75 years old? Many of us have plans for a worry free retirement but sadly, the fees that most people are paying could make that an impossibility.   There is a hole in the boat and it could very well sink you without an emergency fix.  </span></p> <p><span style=\"font-weight: 400;\">If this sounds dramatic, that’s because it is. In</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em><span style=\"font-weight: 400;\">, Tony reveals the truth about the hidden fees that most financial advisors and fund managers won’t talk about: they have a dramatic impact on your net returns and your financial security, without giving you any added benefit.</span></p> <p><span style=\"font-weight: 400;\">In Chapter 3 of</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em><span style=\"font-weight: 400;\">, Tony and co-author Peter Mallouk take an in-depth look at the real impact fees have on the average person’s retirement savings, and why these fees often go unnoticed. Overpaying in annual fees on your mutual funds takes an enormous bite out of your nest egg.  The worst part is, you’re not paying for better results — as</span> <strong>96% of all actively managed mutual funds fail to beat the market</strong><span style=\"font-weight: 400;\">. The average investor is simply overpaying for underperformance.</span></p> <p>In this episode of The Unshakeable Podcast, Tony and Peter explain the severe impact hidden fees and taxes can have on your financial future, why the industry makes it difficult to uncover these fees, and how you can remove hidden fees from your investment strategy — putting more money directly into your pocket.</p> <p> </p> <p><span style=\"font-weight: 400;\">Legal Disclosure: Tony Robbins is a board member and Chief of Investor Psychology at Creative Planning, Inc., an SEC Registered Investment Advisor (RIA) with wealth managers serving all 50 states. Mr. Robbins receives compensation for serving in this capacity based on increased business derived by Creative Planning from his services. Accordingly, Mr. Robbins has a financial incentive to refer investors to Creative Planning.</span></p>", "duration": "26:13", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/unshakeable/02_Hidden_fees_and_half_truthsV1.mp3?dest-id=480137", "type": "episode", "tags": ["money", "investing", "business", "tony", "robbins"]}, {"seriesId": 1207627404, "seriesTitle": "Unshakeable by Tony Robbins", "pubDate": 1487493904, "title": "Episode 1: Winter is Coming...But When? Power and Peace of Mind in a World of Uncertainty", "author": "", "summary": "<p><span style=\"font-weight: 400;\">Tony and Peter Mallouk introduce their new book,</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em><span style=\"font-weight: 400;\">, and explain what motivated them to write it.</span></p> <p>Like the predictability of cold winter storms that show up year after year, market corrections and crashes will continue to rear their ugly heads.   We’ve all suffered losses, or know someone who has; maybe it was when the tech bubble burst in the late 1990’s, when the stock market plunged in 2001, or when the housing market crashed in 2008, and those losses can shake you to your core. So just how does one achieve financial security and peace of mind in a new era of volatility?</p> <p><span style=\"font-weight: 400;\">In the first episode of The Unshakeable Podcast, world’s leading life and business strategist Tony Robbins and his co-author Peter Mallouk (ranked #1 financial advisor by Barron’s for three years in a row) remove the anxiety of economic winter. They discuss the facts and myths surrounding bear markets, why they make us so fearful, and how to not only prepare, but even profit when the market dips — all key concepts straight out of their latest book,</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em><span style=\"font-weight: 400;\">.</span></p> <p><span style=\"font-weight: 400;\">Written as your go-to financial freedom playbook,</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em> <span style=\"font-weight: 400;\">offers investors of all levels — from millennials to baby boomers — the knowledge, tools, and techniques to become an unshakeable investor; to dispel any fears you have of bear markets, build a strong diversified portfolio, and gain peace of mind amid economic uncertainty. Throughout The Unshakeable Podcast, a companion series to the book, Tony Robbins and Peter Mallouk sit down with Richard Bradley, Editor-in-Chief of Worth Magazine, to discuss core principles for unshakeable investing, and how you can apply them to reach your own financial goals.</span></p> <p><span style=\"font-weight: 400;\">In this episode of the Unshakeable Podcast, Tony and Peter dive into the 7 “Freedom Facts” that can open your door to financial freedom, and Tony explains why he was inspired to partner with Peter to write</span> <em><span style=\"font-weight: 400;\">Unshakeable</span></em> <span style=\"font-weight: 400;\">in the first place.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Legal Disclosure: Tony Robbins is a board member and Chief of Investor Psychology at Creative Planning, Inc., an SEC Registered Investment Advisor (RIA) with wealth managers serving all 50 states. Mr. Robbins receives compensation for serving in this capacity based on increased business derived by Creative Planning from his services. Accordingly, Mr. Robbins has a financial incentive to refer investors to Creative Planning.</span></p>", "duration": "47:59", "imageUrlLg": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/600x600bb.jpg", "imageUrlSm": "http://is4.mzstatic.com/image/thumb/Music122/v4/45/87/db/4587dbcd-1e79-2da0-0404-33b71d7d5dd5/source/60x60bb.jpg", "audioUrl": "http://traffic.libsyn.com/unshakeable/01_Winter_is_coming..._but_whenV3_tonyrobbins.mp3?dest-id=480137", "type": "episode", "tags": ["money", "investing", "business", "tony", "robbins"]}]}