{"series": {"feedUrl": "http://rss.earwolf.com/the-cracked-podcast", "genres": ["Comedy", "Podcasts"], "title": "The Cracked Podcast", "country": "USA", "author": "Earwolf and Jack O'Brien, Michael Swaim", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "type": "series", "id": 689900475}, "episodes": [{"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1488788492, "title": "25 Bizarrely Specific Ways Movies Get Reality Wrong", "author": "", "summary": "It's not something that you consciously notice, but movies speak to us in a secret language. They use a special shorthand to convey ideas or explain plot in the most efficient way possible. There's one problem though: they do it in the same couple dozen ways and recycle them over and over. And they need to stop. Or at least invent some new ones.Is someone's life crumbling away after a break-up? Just give them a beard and litter their apartment with Chinese food cartons. Want to show someone has a house or apartment, but no possessions? How about some well-placed Chinese food cartons? Is someone pulling an all-nighter with their work? More Chinese food cartons!If you're a person who even casually watches movies, you'll know so many of these the instant we bring them up and you'll never unsee them in any film going forward. To break down 25 of the biggest offenders, Jack O'Brien is joined by Cracked's Carmen Angelica, Soren Bowie and Daniel O'Brien. They talk about how people brush their teeth in movies, how men try to steal kisses and why you can never trust a fictional male nurse.Remember to buy tickets to our next live taping of The Cracked Podcast on this Saturday, March 11th at 7pm at the UCB Sunset Theatre in Los Angeles. Jack and the gang are going to talk about Amity Island, Jurassic World and movies where vacations go awry in an attempt to figure out the best spring break you should take while vacationing in a fictional universe.Tickets are $7 and available here:  https://goo.gl/Li0ocH Footnotes:Podcast: Cracked: Dumb Movie Tropes That Need to Die Already:  https://goo.gl/oMk0jv Video: Cracked: 6 Bizarrely Specific Scenes  Hollywood Won't Quit Using:  https://goo.gl/i1Bll2 Video: Cracked: 4 Movie Straw Men Characters That Keep Showing Up:  https://goo.gl/17JVkG Video: Cracked: 7 Bizarrely Specific Ways Movies Get Normal Jobs Wrong:  https://goo.gl/lvqPpo Article: Cracked: 4 Bizarrely Specific Rules That Exist in Movie Universes:  https://goo.gl/Hs9iGT Article: Cracked: 3 Bizarrely Specific Job Trends in Movies:  https://goo.gl/a4NL9 Article: Cracked 4 Products That Only Exist in Movies:  https://goo.gl/q4RAF Cracked Photoplasties About Movie Tropes:  https://goo.gl/2BsDGG ,  https://goo.gl/x4QfQ ,  https://goo.gl/qnQZQr ,  https://goo.gl/gYZfr Article: The New Yorker: What Did Jesus Do? (Actual Logic vs. Narrative Logic):  https://goo.gl/4c126Q Article: The Hathor Legacy: Why Film Schools Teach Screenwriters Not To Pass The Bechdel Test:  https://goo.gl/MMdcbt This episode is brought to you by Casper Mattresses (www.casper.com/cracked) and Squarespace (www.squarespace.com code: CRACKED).", "duration": "01:35:47", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/310920602-crackedpod-25-bizarrely-specific-ways-movies-get-reality-wrong.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1488182856, "title": "Lies You Believe About Jesus, Islam And Other Religions", "author": "", "summary": "What separates the baby religions from the big ones? Is there anything specific that makes Catholicism or Islam more important than the shrine to The Noid that I have in my closet? Some religions make you go to mass or travel to Mecca, mine makes me eat pizza in the nude at least twice a week. The point we're trying to make is that what seems fringe or crazy now may have a billion devoted followers a thousand years from now. Mormonism was about as fringe as you could get a hundred years ago, less than a million followers, but now the there are around 16 million members and counting. Is there any religion that's out there now that's in the same place Mormonism was 100 years ago?To get a better understanding of some of these lesser-known religions and if they'll stand the test of time, Jack O'Brien's guest this week is Reza Aslan, who has a PhD in the study of religion and whose new show 'Believer' on CNN throws him head-first into the beliefs and practices of obscure religions. Among Scientology and Santa Muerte, they talk about the implausible origins of biblical literalism, the rare disorder that has tourists in Jerusalem thinking they're the messiah and a few big things that'll change your notions of Christianity and Islam.Remember to buy tickets to our next live taping of The Cracked Podcast on Saturday, March 11th at 7pm at the UCB Sunset Theatre in Los Angeles. Jack and the gang are going to talk about Amity Island, Jurassic World and movies where vacations go awry in an attempt to figure out the best spring break you should take while vacationing in a fictional universe.Tickets are $7 and available here:  https://goo.gl/Li0ocH Footnotes:TV Show: Believer with Reza Aslan:  https://goo.gl/xvhvno Book: Reza Aslan: Zealot:  https://goo.gl/qIXXdu Video: Reza Aslan Viral Interview on Fox News:  https://goo.gl/SBTBT5 Article: Cracked: 5 Ridiculous Things You Probably Believe Islam:  https://goo.gl/aDLjO Article: Cracked: 5 Myths You Probably Believe About Major Religions:  https://goo.gl/qHreXh Article: The Telegraph: Jerusalem Syndrome: The Madness That Grips Foreigners on the Streets of the Holy City:  https://goo.gl/IW1YUI This episode is brought to you by Blue Apron and ZipRecruiter.", "duration": "01:14:17", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/309740448-crackedpod-lies-you-believe-about-jesus-islam-and-other-religions.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1487577979, "title": "Cracked's 2017 Fake Oscar Awards", "author": "", "summary": "Who can forget the classic Oscars showdown between 'The Artist' and, uh, 'Extremely Loud & Incredibly Close'? Most of us can and did, in fact. Great job, Academy of Motion Picture Arts and Sciences! Way to keep your fingers on the pulse of American filmmaking by giving gold out to the 1930s-style silent film. Trailblazing. The Oscars have proven year after year that they're not the best barometer for judging the best or even the most popular films from a given year. Often they're really only judging movies on the criteria of being appealing to a group of old, white men with film industry jobs. Look at three of the last five best picture winners and their subject matter: 'Birdman'– an aging actor known for playing superheroes strives for artistic legitimacy; 'Argo'– Hollywood producers save hostages in Iran; 'The Artist'– Remember silent films? And let's pencil 'La La Land' into that list– an struggling actress and a struggling musician fall in love, become successful. Hollywood obviously has a problem being objective about movies wherein the subject matter is itself.So this week we're being objective for Hollywood. Jack O'Brien welcomes Cracked's David Bell, Adam Ganser and Brett Rader to discuss 2016's Best Picture nominees and award movies in some made-up categories that we'd like to see incorporated into the Oscar broadcast. Later they took a look back at the 2012 Oscars in which 'The Artist' won best picture and redistribute the awards with the benefit of 20/20 hindsight. Footnotes:Cracked Podcast: Why We Should Wait 5 Years to Award the Oscars:  https://goo.gl/COc0zQ Article: Cracked: 5 Problems Haunting The Oscars (Besides Lack of Diversity):  https://goo.gl/mMgAQG Article: Cracked: 5 Reasons the Oscars Matter Even Less Than You Thought:  https://goo.gl/bql0 This episode is brought to you by Squarespace (www.squarespace.com code: CRACKED), Lincoln In the Bardo, and Away (www.awaytravel.com/cracked).", "duration": "01:46:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/308588624-crackedpod-crackeds-2017-fake-oscar-awards.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1487059699, "title": "Why Modern People Might Have The Worst Sex Lives Ever", "author": "", "summary": "When you think about ancient human history, you probably think about sex, right? Who doesn't? And when you do, you probably imagine in your head (because you love envisioning your eldest relatives gettin' down) a very bland, puritanical form of sex where they do it through a sheet once every other year and only to conceive, right? Well, sorry to make you throw up in your mouth a little bit, but your ideas of chastened ancestors living repressed lives are as wrong as the next images we're about to put in your mind: ancient humans were nasty little horndogs. In fact, the basically standard modern ideas of monogamy and fidelity are extremely recent developments in human history. They've only been around for about 10,000 years -- a blink of the evolutionary eye.So what was the ancient hunter-gatherer love like actually like? And what can we learn about our own sex lives from looking at how the cavemen got down? A lot, actually. So we asked an expert. By studying prehistoric human cultures and the sex lives of our two closest genetic relatives, chimps and bonobos, Dr. Christopher Ryan has some pretty eye-opening stuff to share about human sexuality. So Jack O'Brien welcomes Dr. Ryan on this bonus episode of The Cracked Podcast to talk with Teresa Lee and Michael Swaim about swinging tribes-people, primitive vibrators and ape balls in a conversation that is bound to make you rethink everything you know about love and sexuality.Footnotes:Book: Christopher Ryan & Cacilda Jetha: Sex At Dawn:  https://goo.gl/NkZVye Podcast: Christopher Ryan: Tangentially Speaking:  https://goo.gl/uWl7mK Scholarly Article: Michael Gurven & Hilliard Kaplan: Longevity Among Hunter-Gatherers:  https://goo.gl/9LXdBo Article: Jared Diamond: The Worst Mistake in the History of the Human Race:  https://goo.gl/4k9zM Article: Cracked: 5 Gender Stereotypes That Used To Be The Exact Opposite:  https://goo.gl/zgnNG Article: Cracked: 6 Horrifying Facts That Get Left Out Of History:  https://goo.gl/ItWwcK Article: Cracked: 7 X-Rated Traditions That Prove History Was Horny As F*$&:  https://goo.gl/9XxknD Article: Cracked: The 6 Most Cynical Exploitations of Romantic Love in History:  https://goo.gl/Hik16 Article: Cracked: 6 Factors That Secretly Influence Who You Have Sex With:  https://goo.gl/oIAFD Article: Cracked: 5 Insignificant Things That Determine Who You Have Sex With:  https://goo.gl/0i8cQ", "duration": "01:29:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/307615629-crackedpod-why-modern-people-might-have-the-worst-sex-lives-ever.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1486973332, "title": "Jafar Is Disney Moses: Secretly Heroic Villains", "author": "", "summary": "Did you ever notice how every movie villain is just really ugly beyond belief? Emperor Palpatine? WRINKLED UP UGGO. Jafar? POINTY FACE. Scar? LITERALLY NAMED AFTER HIS FACIAL DEFORMITY.It's fucking dark when you think about how many movies this applies to; how the villain is usually someone trying to live a normal or equal life, but their ugliness just gets in the way. 'The Incredibles' is a perfect example. The villain is an ugly-little redhead kid who just wants for everybody to be a superhero, but the Incredibles are like NNNNNNOPE and throw him into a jet engine because only they should get to be superheroes.Yeah, of course Syndrome kills like 30 other superheroes and sets a giant death robot loose on a major metropolis, but just go with us for this thought experiment. His heart was in the right place. On this week's podcast Jack O'Brien welcomes Cracked's own Katie Goldin and Michael Swaim to unpack this trope and how you can see ugly bad guys ostensibly trying to do the right thing in franchises from Disney to The Lord of the Rings.Footnotes:Video: Cracked: 4 Disney Movie Villains Who Were Right All Along:  https://goo.gl/ddcdE7 Article: Cracked: 9 Famous Movie Villains Who Were Right All Along:  https://goo.gl/YHj25 Article: Cracked: 5 Movie Villains Who Were Right The Whole Time:  https://goo.gl/2P99EY Article: Cracked: 6 Reasons The Jedi Would Be The Villain In Any Sane Movie:  https://goo.gl/rPHaAO Article: Cracked: You Really Have No Idea Who The Villain Of Frozen Is:  https://goo.gl/SsbdFm Book: Chuck Klosterman: I Wear the Black Hat:  https://goo.gl/oxij5c Video: Kanye West: All Day (Live at the 2015 BRIT Awards):  https://goo.gl/xeDgWu This episode is brought to you by ZipRecruiter (www.ziprecruiter.com/cracked) and Harry’s (www.harrys.com/cracked).", "duration": "01:57:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/307456756-crackedpod-jafar-is-disneys-moses.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1486368455, "title": "The Mind Melting World of Putin's Russia", "author": "", "summary": "If you've followed the news recently, you may have noticed the tiny little superpower Sarah Palin can see from her house has emerged from its slumber and re-injected itself into American politics. Not since the Cold War has Russophobia been as much of a part of our daily lives as it is now. Disinformation, strong man tactics and a corrupt and dictatorial turn have spilled into American life in a way that would've seemed like fiction only a few decades ago. What was once the well-trodden territory of black and white \"duck and cover\" videos and 80s action flicks is now a staple of Twitter feeds and nightly news broadcasts.So how did we get here, and what the hell does Russia even want from us this time around? That's what Cracked's Robert Evans and Michael Swaim are here to find out on this week's podcast. They join Jack O'Brien for an all-encompassing conversation about the KGB's history of deceit, Russia's methodology for spreading lies and Vlad Putin's psych evaluation. Later in the show, Jack interviews Cracked engineer Tatiana Nam about her experiences growing up in Russia.Our next live podcast is on Saturday, February 11th at 7pm at the UCB Sunset Theatre in Los Angeles. Just in time for Valentine's Day, join Jack O'Brien, Michael Swaim and Teresa Lee as they welcome Dr. Christopher Ryan, author of Sex at Dawn for a discussion about love, relationships and why our sex lives now bear no resemblance to the way our ancestors got down. Tickets are $7 and available here:  https://goo.gl/aXqXex Footnotes:Video: Cracked:  Why the #1 Fact of Military History is a Lie:  https://goo.gl/12apTz Article: Cracked: 5 Conspiracy Theories That Are Real (But Not How You Think) [#5 CIA created AIDS]:  https://goo.gl/wrt8Kk Article: Cracked: 6 Insane Conspiracy Theories That Actually Happened [#2 KGB Was Involved in JFK Assassination]:  https://goo.gl/w4gBl Article: NPR: Putin 'Probably' Approved Plan to Kill Spy:  https://goo.gl/cTC3h0 Podcast: NPR: Russia's Interference is an Assault on the Western Liberal Order:  https://goo.gl/8FPDyv Video: Press Conference with Bill Clinton and Drunk Boris Yeltsin:  https://goo.gl/aEcvkT Podcast: NPR: Trump Seems Willfully Blind to Putin's Real Goals:  https://goo.gl/tIixW3 Book: Peter Pomerantsev: Nothing is True and Everything is Possible:  https://goo.gl/UI1nNx This episode is brought to you by Squarespace (www.squarespace.com code: CRACKED) and ZipRecruiter (www.ziprecruiter.com/cracked).", "duration": "02:00:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/306327219-crackedpod-the-mind-melting-world-of-putins-russia.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1485763756, "title": "The Enormous Lie About Modern Life (You Likely Believe)", "author": "", "summary": "Once you hit your mid-twenties, everything starts beginning to suck. Your favorite band? Not as good as when they first came out. Favorite hangouts? All gone to shit since all the young people started showing up and ruining everything. The world? Basically a day away from total anarchy.Even the idea of time begins to suck. The present is somehow always the worst and no matter how bad your life was 5, 10 years ago– it all seems tinted with rose-colored glasses. Sure you were bored all the time, had no way of communicating with people who weren't your neighbors and loved Hootie and the Blowfish, but man the 90s were the absolute peak of human existence, right? Not really.Somehow humans have this bias that makes them think the world is always at the brink of complete collapse and that things were better before...before AIDS and Ebola started killing everybody; before all the bees disappeared; before crime took over the streets, when you could leave your front door open all day and the criminals would tip their hats and say, \"good morning!\"We're here to say this way of thinking is wrong and completely ignores all of the amazing advancements humanity is continuing to make every day. It's just you don't hear about them because the headline \"Cancer Deaths Slowly and Steadily Dropping\" isn't as flashy as \"IT'S ALL BURNING DOWN MAN, DON'T EVEN BOTHER!\"On the podcast this week, Jack O'Brien is joined by Jason Pargin (aka David Wong) to talk about how we're neither going to hell nor are we in a hand basket. Poverty, war and disease are at all time lows, all you have to do is look away from the news to see it.Our next live podcast is on Saturday, February 11th at 7pm at the UCB Sunset Theatre in Los Angeles. Just in time for Valentine's Day, join Jack O'Brien, Michael Swaim and Teresa Lee as they welcome Dr. Christopher Ryan, author of Sex at Dawn for a discussion about love, relationships and why our sex lives now bear no resemblance to the way our ancestors got down. Tickets are $7 and available here:  https://goo.gl/aXqXex Footnotes:Articles: Cracked: Pieces of Good News Nobody is Reporting:  https://goo.gl/ysKK7  https://goo.gl/8z04xT   https://goo.gl/Kr75IK Article: Biography.com: H.H. Holmes:  https://goo.gl/U1Bo6V Website: OurWorldInData.com:  https://goo.gl/afqC0a Graph: Innovation.org: Actual vs. Projected Death Rates for HIV/AIDS in the US:  https://goo.gl/ZI6zHY Article: Cracked: 5 Horrifying Apocalyptic Scenarios That Already Happened (#1 The Toba Event):  https://goo.gl/5COk09 Scholarly Article: British Journal of Preventative and Social Medicine: The Coal Gas Story:  https://goo.gl/EbJkvD Article: Bloomberg: Bias, Blindness and How We Truly Think:  https://goo.gl/98f6Uv Article: The New Yorker: Doomsday Prep for the Super Rich:  https://goo.gl/GBcpKk This episode is brought to you by Shari’s Berries (www.berries.com code: CRACKED) and Blue Apron (www.blueapron.com/cracked).", "duration": "02:04:31", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/305174142-crackedpod-the-enormous-lie-about-modern-life-you-likely-believe.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1485158835, "title": "9 Creepy Real Murders (With My Favorite Murder)", "author": "", "summary": "Remember when you made fun of that kid in grade school for wetting the bed? You probably shouldn't have done that. I would apologize, change your name or leave the country. The reason is, psychologists suggest something called the Macdonald triangle, that there are three main characteristics of people who grow up to become killers: arson, cruelty to animals and bed-wetting. If you've got two or more, (in Jeff Foxworthy's voice) chances are you might be a serial killer.So, for another round of creepy solved and unsolved murders, we've invited back to the podcast America's foremost experts on the subject, Karen Kilgariff and Georgia Hardstark from 'My Favorite Murder'. They join Jack O'Brien and Daniel O'Brien to talk about Daniel's two hometown serial killers with a strange connection, two district attorneys who suffered mysterious ends, the unsolved murder of three girl scouts, and the murderer who buried his \"kill kits\" in the woods.Footnotes : My Favorite Murder:  https://goo.gl/gpaZN8 Article: Cracked: The 5 Most Terrifying Serial Killers You've Never Heard Of:  https://goo.gl/wh6B2U Murderpedia: Richard Biegenwald, \"The Thrill Killer \":  https://goo.gl/2yq6l2 Murderpedia: Robert Zarinsky:  https://goo.gl/sM521t Documentary: Netflix: \" Amanda Knox \" :  https://goo.gl/y4LTOa Article: New York Times: For Letterman Stalker, Mental Illness Was Family Curse and Scarring Legacy:  https://goo.gl/tw4GQ6 Article: Washington Post: A Decade Later, Prosecutor Luna's Death Still a Mystery:  https://goo.gl/ydFmNI  Article: CNN: What Happened to Ray Gricar?:  https://goo.gl/Jd3Qqy Book: Gloyd McCoy: Tent Number Eight:  https://goo.gl/wKUgTZ  Murderpedia: Israel Keyes:  https://goo.gl/3t6NPG Documentary: HBO: There's Something Wrong With Aunt Diane:  https://goo.gl/2rjXqJ Article: ABC News: Murder of Jasmine Fiore by Ryan Jenkins:  https://goo.gl/rc0YyT  Article: Today Costa Rica: Costa Rica Re-Opens Serial Killer Case):  https://goo.gl/iD2b0U", "duration": "01:07:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/304045788-crackedpod-9-creepy-real-murders-with-my-favorite-murder.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1484554130, "title": "Accidents That Created The Best Art Of The 20th Century", "author": "", "summary": "It's easy to think every piece of great art or unforgettable pop-culture is the result of effortless genius and precise intentionality. It separates the gods who create from us lay-people who like to eat cheese and can barely decide what to watch on Netflix. Take Spock's \"Live Long and Prosper\" hand signal. Yeah, it seems a little trivial, it's not 'Starry Night' or 'Hey Jude' or anything, but it's an icon that's lasted in the popular culture for 50 years and stands only second to \"May the Force be with you\" as the most recognizable totem of the sci-fi genre. Only a genius could've come up with that, right? Not really. Gene Roddenberry and company wanted the Vulcan salute to be the peace sign until Lenoard Nimoy took a stand for what was right and was like, \"hey, this is dumb. I know this is coming from the dude wearing pointy ears right now, but can I just try this other thing so I don't look like the stupidest person on television?\"And thank god Nimoy did that, because otherwise everyone would've thought 'Star Trek' was cheesy crap, or at least cheesier than it already was considered. So sometimes genius isn't in the intention as much as it is being able to realize a mistake, correct it and pray to god your new solution isn't as dull as the idea that preceded it. And pop culture is so littered with examples like these, there's a lone Native American man shedding a single tear over it. That much litter.So Jack O'Brien is joined on the podcast this week by Cracked's Teresa Lee and Alex Schmidt to talk about the behind the scenes mistakes and last-minute casting changes that made some movies and video games better. They also talk about some ghastly original versions of famous scripts that thankfully never saw the light of day. You don't want to know what the original description of Han Solo was (hint: it included the words \"green\" and \"gills\"). Footnotes:Article: Cracked: 5 Famous Roles Obviously Written For a Different Actor:  https://goo.gl/PZD4Se Video: Cracked: 8 Times Your Favorite Actors Almost Died on Film:  https://goo.gl/FTpSWN Article: Cracked: 5 Iconic Pop Culture Moments Improvised at the Last Second:  https://goo.gl/5V8Tl Article: Cracked: 6 Glitches That Accidentally Invented Modern Gaming:  https://goo.gl/WbOZ5 Article: Cracked: 6 Iconic Video Games That Were Created By Technical Problems:  https://goo.gl/e2DBHN Article: Cracked: 7 Characters Clearly Designed for Different Famous Actors:  https://goo.gl/nNrcJD Article: Cracked: 6 Iconic Movie Scenes That Happened By Accident:  https://goo.gl/Q49cx Article: Cracked: 5 Amazing Performances From Actors Who Weren't Acting (Part I):  https://goo.gl/W6KRf  Article: Cracked: 6 Amazing Performances by Actors Who Weren't Acting (Part II):  https://goo.gl/W6KRf Article: Cracked: 5 Amazing Performances by Actors Who Weren't Acting (Part III):  https://goo.gl/R7Kebk Article: Cracked: 5 Amazing Performances by Actors Who Weren't Acting (Part IV):  https://goo.gl/jNMCHl Article: Cracked: 5 Great Performances By Actors Who Weren't Acting (Part V):  https://goo.gl/bLft7q Article: Cracked: 5 Actors Who Weren't Acting In Their Most Iconic Roles:  https://goo.gl/kk5lV4 Article: Cracked: 6 Actors Who Thought They Had Made A Totally Different Movie:  https://goo.gl/Wi6QWh Kyle Ayers' #RoofBreakup:  https://goo.gl/KH3j3P Zach Broussard's Top 1000 Comedians:  https://goo.gl/nKVn0r SoCal Comedy Fest:  https://goo.gl/voRTUN This episode is brought to you by Squarespace and Real Time with Bill Maher on HBO.", "duration": "01:25:02", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/302894624-crackedpod-accidents-that-created-the-best-art-of-the-20th-century.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1483949257, "title": "160 Romantic Comedies: The Creepiest Movie Genre", "author": "", "summary": "Think of every RomCom trope and the one thing that separates it from being in a horror movie instead: the music. It's all the same mad libs game, and the outcome is always the same.Colin Firth/Hugh Grant/Matthew McConaughey runs to the airport/apartment building/twee bakery to declare his undying love for the maid/undercover journalist/baker he just met last week. The music swells, they kiss, the girl's less attractive best friend sighs, \"oh I wish architect/surgeon/astronaut Chet Wellington could fall in love with me,\" and the credits roll. But what if, instead of the swelling music, it was a single piano note being played backwards, or an old-timey phonograph blowing out a single child singing, \"Ring Around the Rosie?\" 'Love Actually' would turn into an actual horror movie. The little boy chasing the little girl through the airport would take on a new interpretation. 'Shining 2: This Time It's British Christmas.\"RomComs are weird like that. They take a thing most people experience (falling in love) and turn it into a warped version of reality that only abides by backwards rules: where chasing someone down is considered romantic and getting the person to like you is the hardest part, not that whole spending the next 5 decades together thing. No, that part is easy (cries self to sleep).So this week on the podcast, Jack O'Brien is joined by Cracked editor Soren Bowie and comedian and writer Jamie Loftus from 'The Bechdel Cast' to talk about how RomComs get almost everything wrong and when you change just one detail, they become creepy stalker thrillers.Our next live podcast is on Saturday, January 14th at 7pm at the UCB Sunset Theatre in Los Angeles. Karen Kilgariff and Georgia Hardstark from 'My Favorite Murder' are back for another hour of creepy unsolved murders and even creepier solved ones. Tickets are currently SOLD OUT but more will be released throughout the week  here:  https://goo.gl/5eew6F  . If the show remains sold out, we will have a standby list at the door, so make sure to come early!Footnotes:Jamie Loftus on Twitter:  https://goo.gl/5Jqr9m The Bechdel Cast on iTunes:  https://goo.gl/9FkEzU Video: Cracked: The Only Film Genre That Gets You To Root For The Bad Guy:  https://goo.gl/M3N8aW Video: Cracked: The 9 Creepiest Things Movies Portray As Romantic:  https://goo.gl/Vwt9hy Video: Cracked: Why Romantic Comedies Are Secretly Bad For You:  https://goo.gl/CeXsli Video: 'Love Actually' Cue Card Scene:  https://goo.gl/WVkGGy Video: 'Trainwreck' Dance Scene:  https://goo.gl/UtKVtQ Article: The Oxford Philosopher: The Birth of Tragedy:  https://goo.gl/wZbVmF This episode is brought to you by Casper Mattresses ( www.casper.com/cracked ) and Blue Apron ( www.blueapron.com/cracked ).", "duration": "01:22:04", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/301598444-crackedpod-romantic-comedies-the-creepiest-movie-genre.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1483344427, "title": "The 80s: Our Most Bizarre Decade (Is Happening Again)", "author": "", "summary": "Name the year: a new Star War is killing it at the box office, Russia and the US are having a staring contest and a madman driven by the power of celebrity is elected President. Yes, it's looking very much like we're living in the year 1980 right now and we want it to stop. I mean, if this is 1980, that means we're only three years away from more Ewoks. Although what is a Minion but yellow Ewok?But in all seriousness, the world has taken a turn for the conservative as it did in the early 80s. Free love and long hair were gone and replaced by shoulder pads, cocaine and rich white kids who thought the stock market was dope. So is there anything redeemable about this situation other than the prospect of getting some cool movies and punk music?Jack O'Brien and Daniel O'Brien are joined by comedian, podcast host and 'Saved by the Bell' historian April Richardson for a conversation about how 80s pop-culture perfectly represented those regressive times and how some of the patterns we saw then are starting to appear now in our modern pop-culture. They also talk about 'Saved by the Bell' a lot. Like, a whole bunch.Our next live podcast is on Saturday, January 14th at 7pm at the UCB Sunset Theatre in Los Angeles. Karen Kilgariff and Georgia Hardstark from 'My Favorite Murder' are back for another hour of creepy unsolved murders and even creepier solved ones. Tickets are $7 and on sale  here: https:// goo.gl/5eew6F Footnotes:April Richardson:  https://goo.gl/uPOCwn Go Bayside! Podcast:  https://goo.gl/FuWvyL Article: Cracked: Why 'Saved by the Bell' is All a Dream:  https://goo.gl/J9ujG Article: Cracked: 6 Ways You Didn't Realize Ronald Reagan Ruined the Country:  https://goo.gl/55AJy2 Article: Cracked: 5 Baffling 80s Trends Explained by Rare Mental Disorders :  https://goo.gl/XW6Y6  This episode is brought to you by Lifeafter podcast, Squarespace (www.squarespace.com code: CRACKED), and Harry’s.", "duration": "01:21:13", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/300112033-crackedpod-the-80s-our-most-bizarre-decade-is-happening-again.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1482739606, "title": "The 25 Coolest Things We Discovered in 2016", "author": "", "summary": "It's not just us right? There are too many damn movies and TV shows to keep up with. When we're not in the middle of a season of Game of Thrones, Westworld, Silicon Valley, Stranger Things, or House of Cards, there are always 40 other shows just waiting to get started. If only you were ready to make the commitment. Your girlfriend wants you to propose but you can't even commit to Six Feet Under, let alone the next 60 years of your life.This glut of TV shows we're experiencing completely fails to lack the steady stream of quality movies coming out not only in the US but all around the world. And the surplus of movies doesn't even address how behind you are on music. Open up Spotify or look at the next festival lineup and you can barely recognize a third of the bands there. And we're not being old fogies complaining about music these days-- most of these bands are good-- we just can't keep up with them. 21 Pilots, 21 Savage, 21 Scarecrows. Only one of those band names is completely made up.So to give a little order to this exponentially insane world, Jack O'Brien is joined by Cracked editors Soren Bowie and Jason Pargin (aka David Wong) to talk about some of their favorite they discovered in 2016. They commiserate about the superabundance of content and Soren gives some completely unsolicited home improvement advice.Our next live podcast is on Saturday, January 14th at 7pm at the UCB Sunset Theatre in Los Angeles. Karen Kilgariff and Georgia Hardstark from 'My Favorite Murder' are back for another hour of creepy unsolved murders and even creepier solved ones. Tickets are $5 and on sale soon at  sunset.ucbtheatre.com  ( https://goo.gl/UNy5YF )Footnotes:Website: Pandora -- Search Standup:  https://goo.gl/tXZB Video: Youtube FanFest:  https://goo.gl/RhW2jK Netflix: John Mulaney: The Comeback Kid:  https://goo.gl/EPZMWF HBO: Pete Holmes: Faces and Sounds:  https://goo.gl/zIxXV4 Album: Kyle Kinane: Loose in Chicago:  https://goo.gl/UYTPsS Netflix: Michael Che Matters:  https://goo.gl/TiM4Jm Video: Dave Chappele SNL Monologue:  https://goo.gl/5D6dB0 Website: Nextdoor:  https://goo.gl/R1XSI Video: Red Letter Media: Wheel of the Worst #11:  https://goo.gl/zYUXeo YouTube: Jim Sterling:  https://goo.gl/r4SguC Wikipedia: Square Screws:  https://goo.gl/uGtgQY Amazon: Wet Vacuums:  https://goo.gl/auLfij The Elf on the Shelf:  https://goo.gl/I9CJ0P Screenplay: Monsters, Inc:  https://goo.gl/71xVcx Video: Train to Busan (Trailer):  https://goo.gl/4Zbxfo Video: I Saw The Devil (Trailer):  https://goo.gl/6ojCqo Netflix: Amanda Knox:  https://goo.gl/y4LTOa Netflix: David Blaine: Real or Magic?:  https://goo.gl/olbb48 Netflix: Planet Earth:  https://goo.gl/vrZwiE Video: Bill Burr Makes a Pie Crust:  https://goo.gl/rJ5CV8 Netflix: F is for Family:  https://goo.gl/Cnokr6 Website: Stitcher:  https://goo.gl/R5h4rX Podcast: Science Vs:  https://goo.gl/Fa4g7D Podcast: Doughboys:  https://goo.gl/idq8zm Podcast: The Bill Simmons Podcast with Andy Cohen:  https://goo.gl/ok3LTs Video Game: The Last Guardian:  https://goo.gl/PTRsMj Video: Robyn \"Call Your Girlfriend\" on SNL:  https://goo.gl/CC2ozz Video: Chance the Rapper \"Same Drugs\" on SNL:  https://goo.gl/1TOJ3R This episode is brought to you by Squarespace (www.squarespace.com code: CRACKED) and I.T. is Greater Than Sci-Fi podcast (www.vmware.com/radius/scifi)", "duration": "02:00:34", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/299223853-crackedpod-the-25-coolest-things-we-discovered-in-2016.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1482134834, "title": "2016 Year In Review in Review", "author": "", "summary": "2016 is almost over. Yes the endless, rotten sh*t hurricane of a year that took awayBowie, Prince and Florence Henderson and gave us Trump, Harambe and the Zika virus is finally drawing to a close. So, to give this b*tch a proper viking funeral, Jack O'Brien is joined by Cracked's Cody Johnston, Daniel O'Brien and Alex Schmidt and comedian Caitlin Gill to review our culture's year-in-review process. They'll also shine a much needed light on some of the more overlooked stories from the year. For example, two-headed sharks keep appearing in our oceans and no one knows why. Even all the world's Bond villains are like, \"don't look at us, we thought that was you.\" And Kim Kardashian! It feels like she's been on every magazine cover for the last 35 years and this year she got kidnapped at gunpoint and it barely raised an eyebrow. What is going on!?To wrap up the conversation, Jack and company share some of their favorite cultural things from the year and report from the future with a preview of our 2017 year in review.Footnotes:Article: Yahoo's Top Search Terms in 2016:  https://goo.gl/iD9lvm Video: Kanye Cancels Show And Slowly Floats Away:  https://goo.gl/P0rOQq Article: The Guardian: Google, Democracy and the Truth About Internet Search:  https://goo.gl/GtOx4J Video: Senator James Inhofe Brings a Snowball to Senate:  https://goo.gl/f3gSeP Article: The Telegraph: Russian Scientists Besieged By Pack of Polar Bears:  https://goo.gl/SWGXaY Article: National Geographic: Two-Headed Sharks Keep Popping Up and No One Knows Why:  https://goo.gl/DF725J Article: Slate: Texas GOP Rep Louie Gohmert Will Save Us From Gay Space Colonies:  https://goo.gl/vax51L Instagram: @major_hoolihan:  https://goo.gl/OMdJQh Video: Samantha Bee: Eddie Eagle:  https://goo.gl/LfLgtI Video: Samantha Bee: Trump Can't Read:  https://goo.gl/pl1Hi9 This episode is brought to you by LifeAfter podcast, Harry’s ( www.harrys.com  code: CRACKED), I.T. is Greater Than Sci-Fi podcast, and Loot Crate ( www.lootcrate.com  code: GIFTING15).", "duration": "01:27:41", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/298556070-crackedpod-2016-year-in-review-in-review.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1481529982, "title": "Movies That Teach Men Horrible Lessons About Sex", "author": "", "summary": "You know how when you watch and old movie and there's a Y2K joke or a WAZZZZUUUP and you think, \"man, this hasn't aged well.\" There's now a whole category of those movies that are just classically heroic dudes being absolute dicks to women. There's even a whole supercut ( https://goo.gl/ejmmDH)   of all the times James Bond hits women. Just Sean Connery slapping women left and right like he's Moe and every Bond girl is Larry and Curly.Now, hear us out on this, but there's a chance that images like this might have been hurting women instead of helping them. Crazy. Maybe normalizing violence against women or showing Harrison Ford literally whipping ( https://goo.gl/QRB2Gw)   Kate Capshaw into kissing him have given men unrealistic ideas about how things like consent work.This week Jack O'Brien brings on Carmen Angelica, Jason Pargin (aka David Wong) and Katy Stoll to talk about the modern-day minefield of consent, what movies have been getting wrong about it, why it's so easy for guys to get defensive about it and a female perspective on why it's so damn important.Footnotes:Carmen Angelica Twitter:  https://goo.gl/ATcFbz Katy Stoll Twitter:  https://goo.gl/FzYPCG Jason Pargin Twitter:  https://goo.gl/pNcIwx  Article: Cracked: 7 Reasons So Many Guys Don't Understand Sexual Consent:  https://goo.gl/cNurtf Video: Cracked: How To Know If A Girl is DTF:  https://goo.gl/bkx5dS Video: Han and Leia's First Kiss:  https://goo.gl/HbzMm0 Article: Cracked: 5 Things Women Want Most:  https://goo.gl/WsEPiR Article: Cracked: Everything A Woman Should Know Before She's Groped:  https://goo.gl/pcyEbj Article: Cracked: 5 Ways Modern Men Are Trained To Hate Women:  https://goo.gl/UJtzh Article: New York Times: Nurse in V-J Day Photo Dies:  https://goo.gl/KFxJci Article: Vice: I Want a Feminism Class for Boys:  https://goo.gl/7YUFf1 This episode is brought to you by I.T. is Greater Than Sci-Fir ( www.VMware.com/radius/scifi ), Foot Cardigan ( www.footcardigan.com  code: HOLIDAY16), The Bouqs ( www.bouqs.com  code: CRACKED), and Indochino ( www.indochino.com  code: CRACKED).", "duration": "01:40:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/297466692-crackedpod-movies-that-teach-men-horrible-lessons-about-sex.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1480925252, "title": "Lives Trump Has Promised To Ruin In His First 100 Days", "author": "", "summary": "In the past few weeks, we've written about not panicking, why you should absolutely panic, and just about everything in between when it comes to the Trump presidency. One thing we haven't quite touched on yet is how real life actual people will be affected by the changes he promised to make during his campaign. One thing Trump already promised to do is repeal an Obama executive order called Deferred Action for Childhood Arrivals, or DACA.  DACA allows children who were brought here illegally (keyword: children) to gain somewhat-legal status; protection from deportation, a social security card, in exchange for staying out of trouble and being an active part of the workforce. These are law-abiding, tax-paying young adults whose home country for all intents and purposes is America. A lot of them don't even know the know the language spoken in their country of origin. The shittiest thing is these people might be the first to be deported because they had the unmitigated gall to actively try to live in the United States legally.Robert Evans and Tom Reimann grab the reigns of the podcast this week and have conversations with a potential victim of the removal of DACA, a transgender woman whose medications may no longer be covered, and an army vet whose parents are immigrants to talk about the scary world they've been suddenly thrust into. Later a British journalist joins to talk about the parallels to Brexit and why we might soon see fascist vs. anti-fascist fighting in the streets, and how it could look.If your life has been concretely or irrevocably changed by the new administration, we want to hear your story. Email us at  tips@cracked.com .Footnotes:NYT: Former Head of Homeland Security on DACA:  https://goo.gl/kUt7GP Complex: Trans People Rushing to get Gender-Affirming Surgery Before Trump:  https://goo.gl/4Ie3M6 The Guardian: Fascist/Anti-Fascist Fight in Dover:  https://goo.gl/HWOd8b VICE: More Fascist/Anti-Fascist Fighting:  https://goo.gl/uNWTZO Southern Poverty Law Center: Hate & Extremism Statistics:  https://goo.gl/5OPBdj Also make sure to buy tickets to our next LIVE podcast taping on Saturday, December 10th at the UCB Sunset Theatre in Los Angeles, California. Jack and the crew will be giving a much needed, \"good riddance\" to the year 2016 with our annual Year In Review In Review. The Cracked staff and some special guests will fill in the gaps where most of of the other 'Years In Review' leave out half of the story. Tickets are only $5 and available here:  https://goo.gl/zMwKua This episode is brought to you by Squarespace ( www.squarespace.com  code: CRACKED), Foot Cardigan ( www.footcardigan.com  code: HOLIDAY16), Casper Mattresses ( www.casper.com/cracked  code: cracked), and Loot Crate ( www.lootcrate.com/cracked  code: CRACKED).", "duration": "01:25:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/296229406-crackedpod-lives-trump-has-promised-to-ruin-in-his-first-100-days.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1480320460, "title": "14 Psych Myths We Learned From Movies That Are Totally False", "author": "", "summary": "It's pretty safe to say that after years of Sherlock Holmes adaptations and countless CBS crime procedurals (he was the supreme leader of a cult, but now he's leading the Supreme Court!) most people with a pretty steady diet of TV and movies think they're pretty good armchair psychologists.If you learn of a prison riot on the news, you'll cite the Stanford prison experiment and claim that we're all just a baton and a uniform away from turning into monsters. If the news later reports of a man who stabbed his mother, you'll find a Freudian explanation for the crime that speaks of Oedipal repressed sexuality and the phallic nature of stabbings. Bad news: turns out everything you learned about psychology from the shiny little box in the center of your living room isn't totally accurate. Not only do movies and TV shows take giant liberties with how psychology works, the psych field itself has a hard time getting out of its own way: studies can be biased for multiple reasons, the replication crisis impedes the verification of discoveries and news outlets only report on the grabbiest psych headlines and and skew the truth.So on this week's podcast, we're putting a bunch of psych myths in a straight jacket, tossing them in a padded room and throwing away the key. Cracked's Jack O'Brien, Daniel O'Brien and Michael Swaim are joined by Peter McGraw, an expert in behavioral science and a marketing and psychology professor at the University of Colorado Boulder. They dispel pop-psych stories like the Milgram experiment, power posing and the Mozart effect.Also make sure to buy tickets to our next LIVE podcast taping on Saturday, December 10th at the UCB Sunset Theatre in Los Angeles, California. Jack and the crew will be giving a much needed, \"good riddance\" to the year 2016 with our annual Year In Review In Review. The Cracked staff and some special guests will fill in the gaps where most of of the other 'Years In Review' leave out half of the story. Tickets are only $5 and available here:  https://goo.gl/zMwKua Footnotes:Peter McGraw:  https://goo.gl/IFYreS Video: Peter McGraw TED Talk:  https://goo.gl/JzSR6T Article: Scientific American: Five Fallacies of Grief:  https://goo.gl/dMLN8F Video: Elizabeth Loftus: How Reliable Is Your Memory:  https://goo.gl/3PGGyq Video: Derren Brown Conversational  Hypnosis: https:// goo.gl/AwvHw5 Article: The Atlantic: Questioning The Milgram Experiment:  https://goo.gl/X1nZVc Article: New York Magazine: Is There an Antidote for Emotional Contagion:  https://goo.gl/5rjrTK  Article: New York Magazine: How the False Story of Kitty Genovese's Murder Went Viral:  https://goo.gl/26EdLM Article: Cracked: 5 Ridiculous Lies You Probably Believe About Psychology (#3 Stanford Prison Experiment):  https://goo.gl/HtM7wr Video: Your Body Language Shapes Who You Are (Power Posing TED Talk):  https://goo.gl/7Y5nKC Article: Slate: The Power of the Power Pose:  https://goo.gl/pd09xM Article: The Verge: The Mozart Effect Myth:  https://goo.gl/CXBhrN Article: Wired: Scanning Dead Salmon in fMRI Highlights Risk of Red Herrings:  https://goo.gl/zcZxUq Article: Cracked: 6 Mental Illness Myths Hollywood Wants You To Believe (#4 ECT Therapy is Torture):  https://goo.gl/q3z4y This episode is brought to you by VMware, HUAWEI, The Bouqs, and MVMT Watches.", "duration": "01:26:52", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/294464769-crackedpod-14-psych-myths-we-learned-from-movies-that-are-totally-false.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1479715673, "title": "Dispelling Every Space Myth You Learned In 7th Grade Science", "author": "", "summary": "Believe it or not, Matthew McConaughey's thesis (from behind a bookshelf inside a black hole) that love is the most powerful force in the universe isn't the most scientifically accurate thing Hollywood has offered us lately. It should come as no surprise that movies take a lot of liberties with astrophysics and what is possible or impossible in the realm of outer space. Like, sending up a crew of men less qualified than Donald Trump (too soon?) to blow up an asteroid? That's probably not in NASA's Plans A through \"we ran out of letters\" of how to stop a meteor on a collision course with Earth. Even in more fantastical movies like the Star Wars or Star Trek films, you just get very inadequate image in your head of how space works. Take asteroid belts, for example. It's a belt! Made of asteroids! Asteroids as far as the eye can see! You can't safely pilot your ship through them because there are just so many damn asteroids! I've had it with these motherf**king asteroids on this motherf**king belt! We're sorry to say that's now how the asteroid belt works at all. The average distance between bodies in the asteroid belt is 600,000 miles, which is more than double the distance between the Earth and the Moon. So traveling through the asteroid belt is less dodging asteroids like Han Solo and more, \"we passed through the asteroid belt?\" To dispel some more myths about how space works, Jack O'Brien and Alex Schmidt are joined by Dr. Farah Alibay, a real life scientist at JPL who gets to play with styrofoam models of planets all day and is currently working on a mission that's trying to scoop a 2o-ton boulder off an asteroid, which is as cool as it sounds. Footnotes: Farah Alibay Bio :  https://goo.gl/iM4NI7  Podcast: How NASA Was Born Out of Magic Loving, Orgy Having Nerds :  https://goo.gl/sbSjcR   Video: To Scale - The Solar System :  https://goo.gl/yxUggj GIF: Jupiter's Surface in Motion :  https://goo.gl/BEUaJz  Video: Pigeons in Space :  https://goo.gl/H3Anrr  Video: Spiders in Space :  https://goo.gl/VrQQkJ   Video: Russian Meteor Reaction :  https://goo.gl/R6WKTA  Image Gallery: Cupola Module on the ISS :  https://goo.gl/IJUO5U  Article: The Drake Equation :  https://goo.gl/rYZVzF  Article: Myths Everyone Believes About Space (Thanks To Movies) :  https://goo.gl/H0WiLF  Article: Things About Space You're Picturing Almost Exactly Wrong :  https://goo.gl/qDDpgn  Article: Reasons Space Travel Will Always Suck :  https://goo.gl/VfNZ  Article: Reasons Life in Space Sucks (That Sci-Fi Doesn't Show You) :  https://goo.gl/jNuONd  Article: The Most Mind-Blowing Things Ever Discovered in Space :  https://goo.gl/XztW9  Article: Real Planets Way Weirder Than Anything in Science Fiction :  https://goo.gl/Rb6Yy6  Article: Mind-Blowing Things Found in Our Own Solar System :  https://goo.gl/Azquk  This episode is brought to you by Squarespace and MVMT Watches.", "duration": "01:17:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/294022978-crackedpod-dispelling-every-space-myth-you-learned-in-7th-grade-science.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1479110703, "title": "7 Things To Do In A Time Machine (Other Than Killing Hitler)", "author": "", "summary": "Scenario: you've got a time machine and you only like two things in this life: eatin' breakfast and killin' Nazis, and you've already eaten breakfast. Your obvious next step is to travel to April 20th,1889 and throw baby hitler down a well and then blow up the well,  right? Or is there something better you could do with your time?The whole 'would you kill baby Hitler' thought experiment has been a surprisingly prevalent pop-culture moral question at dinner parties and bad games of Cards Against Humanity. Even Jeb Bush weighed in with his thoughts back in a simpler time when he thought he could be president. His answer, by the way, was, \"hell yeah!\" ( https://goo.gl/IzBaxA ).This got us thinking, what would be some other moments in history to travel back to and change one thing? One answer might be incredibly simple: November 8th, 2016. Who wouldn't go back in time to stop the events of last Tuesday? Only time will tell if that day becomes one of the giant crossroads in the slow forward march of history.So today Jack O'Brien and Alex Schmidt are posing that question to our five comedian guests: Steven Wilbur, Riley Silverman, Caitlin Gill, Blake Wexler and Eric Lampaert. When would you go in history to change one thing, what would it be and why?Footnotes:Alex Schmidt on Twitter:  https://goo.gl/oF6OFj Steven Wilbur on Twitter:  https://goo.gl/CSBfaF Riley Silverman on Twitter:  https://goo.gl/ipJ8TX Caitlin Gill on Twitter:  https://goo.gl/HblhwS Blake Wexler on Twitter:  https://goo.gl/hBY7tL Eric Lampaert on Twitter:  https://goo.gl/b70FTt Biography.com: About Assassination of Franz Ferdinand:  https://goo.gl/1rRB5D Smithsonian: How One Man Accidentally Killed The Oldest Tree Ever:  https://goo.gl/vuVg8r \" William Tecumseh Sherman: In The Service Of My Country\":  https://goo.gl/OobZ9h Radiolab: Be Careful What You Plan For:  https://goo.gl/UwvO4w This episode is brought to you by Indochino, Loot Crate, and Wondery.", "duration": "01:23:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/292900519-crackedpod-7-things-to-do-in-a-time-machine-other-than-killing-hitler.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1478738287, "title": "What The F**K Just Happened? Election Autopsy", "author": "", "summary": "Donald Trump will be the 45th President of the United States of America. It's going to be okay. Sit down, have a cookie, breathe into this bag and put on your mandatory 'Make America Great Again' baseball cap. We'll survive this, right?Despite the sun coming up in the morning and life seemingly going on like normal, the world might've been forever changed last night. So we needed to break the little glass box, pull the lever and record an emergency podcast. Jack O'Brien is joined by Jason Pargin (aka David Wong) to make sense of what happened at the polls last night, why we should've seen it coming from a mile away and what we can actively do to prevent this from happening again. As Jason says on the site today, \"Do the opposite of Panic. Work through the problem.\" It'll all be okay.And if we're still alive this weekend , make sure to catch the next LIVE taping of The Cracked Podcast, this Saturday, November 12th at 7pm at the UCB Sunset Theatre in Los Angeles, CA. Jack O'Brien, Daniel O'Brien and Michael Swaim will be joined by an expert in psychology to talk about some of the psychological myths everyone seems to believe: like Rorschach tests (sorry, they don't work), middle child syndrome (not real); and depression (totally real, but antidepressants might not actually work very well). Tickets are only $5 and they're available here:  https://goo.gl/nSI343 Footnotes:David Wong: Don't Panic:  https://goo.gl/V02EGl David Wong: How Half of America Lost Its F**king Mind:  https://goo.gl/KBJs5W Interactive 2016 County-by-County Election Map:  https://goo.gl/6zWHIw Allan Lichtman: Keys to the White House:  https://goo.gl/IgMovr Stephen Colbert's Election Night Sign-Off:  https://goo.gl/4cxBrF", "duration": "01:12:44", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/292311887-crackedpod-what-the-fk-just-happened-election-autopsy.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1478506041, "title": "Why A Second Civil War Is Frighteningly Possible", "author": "", "summary": "\"Our way of life here is about nine meals away from anarchy.\" That's a quote from retired Marine Colonel David Couvillon, who governed the Wasit province of Iraq during the US occupation and clearly a man who has never seen the Cracked office when our daily lunch of filet mignon and caviar is fifteen minutes late. His experiences in Iraq mean he knows a thing or two about modern political unrest and civil war, which makes that quote even more terrifying.As you might've heard, there's an election tomorrow (if you're reading this day it's coming out), and no matter what the outcome, a portion of the country is going to feel like they've had it stolen from them. Matt Bevins, the Governor of Kentucky, has already promised that, \"blood will be shed\" if Hillary wins and there's no doubt real people are taking promises like these to heart.So how likely is it that America falls into a second civil war? What would that look like? That's what we're asking Cracked's Robert Evans and Teresa Lee on this episode of The Cracked Podcast. They'll explain to us that violent unrest on American soil is a lot more possible than you think and that it wouldn't be North vs. South or Red vs. Blue, but a war fought on thousands of different sides.Also, make sure to catch the next LIVE taping of The Cracked Podcast, this Saturday, November 12th at 7pm at the UCB Sunset Theatre in Los Angeles, CA. Jack O'Brien, Daniel O'Brien and Michael Swaim will be joined by an expert in psychology to talk about some of the psychological myths everyone seems to believe: like Rorschach tests (sorry, they don't work), middle child syndrome (not real); and depression (totally real, but antidepressants might not actually work very well). Tickets are only $5 and they're available here:  https://goo.gl/nSI343 Footnotes:Cracked: 6 Reasons Why a New Civl War is Possible and Terrifying:  https://goo.gl/admmtA Cracked: Going Deep Undercover in a Right Wing Militia Ruined My Life:  https://goo.gl/VkHZp8 USA Today: Record Number of Anti-Government Militias in USA:  https://goo.gl/gnmJaL Abu Bakr Naji: The Management of Savagery:  https://goo.gl/AsDWkE Cracked Podcast: The 11 Nations of America:  https://goo.gl/dTJnm4 11 Nations of America Map:  https://goo.gl/kNXBZ0 How to Build a Thermal Evasion Suit:  https://goo.gl/itpJlJ This episode is brought to you by Squarespace and Blue Apron.", "duration": "01:14:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/291847608-crackedpod-why-a-second-civil-war-is-frighteningly-possible.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1477897574, "title": "Cracked Book Club: Kurt Vonnegut's Little-Known Novel", "author": "", "summary": "You're probably familiar with Kurt Vonnegut's required reading, or rather the Kurt Vonnegut books your high school English teacher required you to read. 'Slaughterhouse-Five,' 'Cat's Cradle,' and maybe 'Breakfast of Champions' were rays of satirical sunlight in your curriculum between long stretches of Jane Austen and Herman Melville (both great authors, but booooooring). But what about his other 12 novels and the dozens of short stories and other works you're not familiar with?The Cracked Podcast is going to mix it up this week with an introduction to our new Vonnegut book club, a brand new podcast with Alex Schmidt and Michael Swaim, the Kurt Vonneguys. Once a month, Alex and Michael will work through the Vonnegut library, dissecting the recurring themes and characters, highlighting some amazing Kurt-isms and providing a general overview of Kurt's work as the connective tissue to modern sci-fi.In this week's episode, Alex and Michael cover Vonnegut's overlooked first novel, 'Player Piano,' a satirical '1984'-esque warning about the horrors of automation. When you're through, you can check out episode two of Kurt Vonneguys here ( https://goo.gl/dtD9Qz ), where they look at Vonnegut's masterwork, 'The Sirens of Titan.' And if you're interested in following future episodes of Kurt Vonneguys, be sure to subscribe here ( https://goo.gl/yjfNTM ).Recommended Reading:\"The Silver Corridor\" and \"'Repent, Harlequin!' Said The Ticktockman\" -- Harlan Ellison :  https://goo.gl/7NK9Pu  \"Knox\" -- Harlan Ellison :  https://goo.gl/NlwI03  \"The Veldt\" -- Ray Bradbury:  https://goo.gl/ihH8r9 \" The Caves Of Steel \"  -- Isaac Asimov :  https://goo.gl/8uA6TQ This episode is brought to you by Indochino and MVMT Watches.", "duration": "01:31:34", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/290735426-crackedpod-cracked-book-club-kurt-vonneguts-little-known-first-novel.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1477292710, "title": "Trump Country: What the Media Doesn't Want You To Know", "author": "", "summary": "You thought it would disappear before the Iowa primary. You thought it would surely never happen when its tax returns were released. You definitely thought it was going away as it drove past you on an 'Access Hollywood' tour bus. But it's finally here. We're doing a Trump podcast! Please hide your women and children.We've actually kind of skirted around Trump a lot in the last year. We talked about the class divide in America, how it's not necessarily driven by money and how the Donald personifies the hopes and desires of the \"lower class\". We even talked about narcissism as America's mental disorder, symbolized again by king narcissist himself, Donald J. Trump.So this week, Crooked Jack O'Brien is joined by Lyin' Jason Pargin (aka David Wong) in hopefully our final Trumpcast. They take one last look at Mr. Tinyfingers by looking at the 40% or so of people who are voting for him in a couple weeks no matter what. It's easy to pass them off as toothless rednecks, racist uncles and cartoonish extras from Daily Show segments, but they are real people who didn't come to support Trump out of nowhere. This cultural shift has been hiding in plain sight and the only problem was the left hadn't even bothered to look. By really dissecting the reasons for this social chasm, we'll prove that even the craziest of Trump supporters should actually be listened to, no matter how orange and absurd their political mouthpiece is.Footnotes:Cracked: How Half of America Lost Its F**king Mind:  https://goo.gl/KBJs5W Cracked Podcast: The 11 Nations of America:  https://goo.gl/dTJnm4 Cracked Podcast: Why Class in America Isn't Just About Income:  https://goo.gl/4juPht 2012 County-by-County Election Map:  https://goo.gl/EKH1xb Map of County-by-County Economic Growth:  https://goo.gl/u3vqyo This episode is brought to you by Harry’s and Adam and Eve.", "duration": "01:49:10", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/289670538-crackedpod-trump-country.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1476865969, "title": "Dark Secrets from the Teacher's Lounge", "author": "", "summary": "Did you ever have the sneaking suspicion that when your history teacher rolled out the old A/V cart for movie time that he was completely hungover? Or that that one teacher who seemed to hate you on a molecular level was giving you bad grades on purpose? Chances are you were right and we have the evidence to prove it: full admissions of guilt from actual teachers. Suck it, Mr. McKinley!Yes, we got real (and anonymous) teachers to come on the podcast and dish the dirt about the real behind-the-scenes of this supposedly squeaky-clean profession. Spoiler alert: teachers are all hot messes.Interviewing our panel of masked and maybe inebriated educators, Jack O'Brien is joined by Cracked's Soren Bowie and Daniel O'Brien as well as Andrew Orvedahl and Maria Thayer from truTV's hilarious show 'Those Who Can't'. They share some all-too-common stories about teachers sleeping with their students, some tips for spotting the teacher who's secretly living at the school and why the teachers who instruct the youngest grades are the most likely to be drunk. Catch 'Those Who Can't' Thursdays on truTV.", "duration": "00:58:30", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/288876685-crackedpod-dark-secrets-from-the-teachers-lounge.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1476687913, "title": "The 2nd Annual Cracked Podcast Halloween Spooktacular", "author": "", "summary": "Last Halloween ( https://goo.gl/Eu1CJU ) we spooked you with  a melange of real-life horror stories that had little explanation. There was the dead girl who was found in a water tower above the hotel where she went missing. Security tapes were inconclusive, except for one minor detail: it appeared as if she was hiding and running away from...absolutely nothing. Was it a ghost? An inter-dimensional monster? A coked-up Harry Potter in his invisibility cloak? We have no idea. Scary.There was also the story of Major Henry Rathbone, the unfortunate fellow who took the invitation of Abraham Lincoln to see a play at Ford's Theater. Rathbone was so wracked by guilt over Lincoln's death that he straight-up turned into Jack Nicholson in 'The Shining' and slaughtered his whole family. Horrifying.So in anticipation of All Hallow's Eve, Jack O'Brien is joined by first time co-host Nick Mundy as well as Cracked's Carmen Angelica and Josh Sargent and comedians Eric Lampaert, Ryan Singer and Anna Seregina to share more macabre and strange stories that actually happened. They'll discuss the thousands of missing people in our national parks and why the government may be covering it up, the French impostor who killed his entire family, the scary clowns that are tormenting America right now, the French Jack the Ripper and the famous serial killer H.H. Holmes, who may be the actual Jack the Ripper.Also, you can see us on Saturday, October 29th at the Now Hear This podcast festival in Anaheim, California. We're on an amazing lineup with other podcasts like WTF with Marc Maron, Doug Loves Movies, I Was There Too and Superego. Use promo code CRACKED to get 25% off 3-day GA passes. Tickets and information available here:  https://goo.gl/R8gzMX Footnotes :Ryan Singer on Twitter:  https://goo.gl/MQFwia Josh Sargent on Twitter:  https://goo.gl/0Ypaz3 Carmen Angelica on Twitter:  https://goo.gl/B7W9JR Eric Lampaert on Twitter:  https://goo.gl/b70FTt Anna Seregina on Twitter:   https://goo.gl/rKkyAS HuffPo: Missing Person Cases at National Parks:  https://goo.gl/JuD3mq ' The Adversary' on Google Books:  https://goo.gl/uB361S NBC News: Creepy Clown Sightings Across the US:  https://goo.gl/lYFQtA Headstuff: Joseph Vacher, the French Ripper:  https://goo.gl/fCU0Ga Biography.com: HH Holmes:  https://goo.gl/BD57Bb Cracked: Real People Who Turned Their Homes Into Death Traps:  https://goo.gl/zoTqj5 Cracked: The True, Drunken Story Behind ‘The Amityville Horror’ (See Entry #1):  https://goo.gl/tivgA This episode is brought to you by Blue Apron and Adam and Eve.", "duration": "01:25:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/288471041-crackedpod-the-2nd-annual-cracked-podcast-halloween-spooktacular.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1476083268, "title": "Why Science Has Really Basic Stuff Wrong About Humans", "author": "", "summary": "How many times a week do you see someone posting a headline to Facebook with a ridiculous scientific claim about your health? '9 out of 10 Doctors Say You Should Stop Exercising,' 'New Report Shows Milk Prevents Cancer,' 'New Study Shows Milk Is Pure Poison, Stop Drinking Milk Or Else Everyone You Know Will Die!' If you're like us, you probably don't even pay attention to them anymore because the results are so fluid and often contradictory. Tell us now– are eggs good for you? You have no idea. Yes, but not the yolks? Who the hell knows anymore?There's a reason why so many studies about human health and behavior are so unpredictable, and you may not be happy with the answer. It's because studying humans is freaking impossible, and that's never going to change. When you're studying people, there's an endless amount of incalculable variables that make reaching a conclusion a futile undertaking. And even if you control for as many factors as you can think of, you still might not be able to account for your subjects' genetics or the very likely chance that they're just lying to you. \"Oh, my diet? Yeah, I eat 2 salads a day, no dressing, and a plain cut of grilled chicken for dinner. I definitely didn't drive through McDonalds on the way here and order a #3 with a Dr. Pepper, no pickles.\"In conclusion, don't trust anything you read or hear ever, or do, because science doesn't really know what it's doing. On this week's episode Cracked editor-in-chief Jack O'Brien is joined by executive editor Jason Pargin (aka David Wong) to talk about how and why science fails us in this regard and why you should probably still be flossing.Also, you can see us on Saturday, October 29th at the Now Hear This podcast festival in Anaheim, California. We're on an amazing lineup with other podcasts like WTF with Marc Maron, Doug Loves Movies, I Was There Too and Superego. Use promo code CRACKED to get 25% off 3-day GA passes. Tickets and information available here:  https://goo.gl/R8gzMX Footnotes:Cracked: Why Science Is Still Mystified About How Humans Work:  https://goo.gl/P4s6mb Smithsonian: Scientists Replicated 100 Studies, Fewer Than Half Got The Same Results:  https://goo.gl/VsQXP3 CBC: No Strong Proof That Flossing Your Teeth Has Medical Benefit:  https://goo.gl/HFiymZ NPR: Does Flossing Help Or Not?:  https://goo.gl/pS6DGW LiveScience: Eggs Don't Deserve Their Bad Reputation:  https://goo.gl/g0l3ys Time: Why Full-Fat Dairy May Be Healthier Than Low-Fat:  https://goo.gl/ZFcGDE Time: Diet Soda Contributes to Weight Gain, Not Weight Loss:  https://goo.gl/bYzpc2 New York Times: Why Nutrition Is So Confusing:  https://goo.gl/z8aBTs Pacific Standard: Alcoholics Anonymous Has A Problem:  https://goo.gl/ZJb5NO WebMD: Effectiveness of Antidepressants:  https://goo.gl/he3Kbo Slate Star Codex: Stop Confounding Yourself:  https://goo.gl/KQHiiJ Cracked: 5 Ways We Misunderstand Pedophilia:  https://goo.gl/O1oIoE Cracked: 24 Everyday Things That Are Still A Mystery To Science:  https://goo.gl/icSrfE Cracked: 6 Reasons You Can't Trust Science Anymore:  https://goo.gl/QP8eWh Cracked: 6 Shocking Studies That Prove Science Is Totally Broken:  https://goo.gl/fuQCak This episode is brought to you by Squarespace and Adam and Eve.", "duration": "02:01:07", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/286924171-crackedpod-why-science-has-really-basic-stuff-wrong-about-humans.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1475483098, "title": "Why The Best Treatment for PTSD May Be An Illegal Drug", "author": "", "summary": "Psychedelics, maaaaan! Gateway to the inside of your miiiiiiiind! Enemy of the maaaaan, maaaaan! Also, a thing that's been around for so long in human history, we don't even have an accurate date for when our ancestors started doing them. They've just been, for all we know, a common way to explore, escape and seek spiritual oneness for hundreds of thousands of years.Some great stuff has been conceived of while on psychedelics: while on LSD, Francis Crick conceived of the double-helix shape of DNA, Steve Jobs cites LSD as one of the major influences of his life's work, and some biblical scholars think the Bible may have been written with the aid of some magic mushrooms. So why does the government hate the stuff? Especially as more research is coming out that says that psilocybin (the active ingredient in mushrooms) does wonders for the terminally ill and MDMA may be the key to curing PTSD.On this week's podcast Jack O'Brien enlists the help of comic Shane Mauss and Cracked editor Robert Evans to find out. First Jack and Shane examine some of the medicinal effects of psychedelics, from mushrooms to DMT to MDMA, and talk about how America's war on drugs is prohibiting important research into these areas. Later, Robert Evans calls in to discuss how some ancient cultures got high and how an individual's reaction to drugs may not be chemical, but cultural.Also, make sure to come see our THREE live shows this October!First, at 9pm on Thursday, October 6th at the UCB Sunset Inner Sanctum, Jack O'Brien and Daniel O'Brien take a behind-the-scenes look at America's most under-appreciated profession: teachers. Along with the cast of TruTV's 'Those Who Can't' and some real-life teachers who would like to remain anonymous, they'll take a look at the secret and alcohol-fueled lives of the people who we entrust to mold the minds of our nation's youth. Tickets are FREE, but it's first come, first serve, so make sure to arrive early. More info is available here:  https://goo.gl/XcGndb Next, at 7pm on Saturday, October 8th at the UCB Sunset Theatre, Jack O'Brien and Nick Mundy co-host a sequel to last year's Halloween episode. Cracked's Tom Reimann and comedians Eric Lampaert, Anna Seregina and Ryan Singer guest to share more real-life stories of death, disappearance and potentially the great beyond. Tickets are $5 and available here:  https://goo.gl/wTyocv Finally, you can see us on Saturday, October 29th at the Now Hear This podcast festival in Anaheim, California. We're on an amazing lineup with other podcasts like WTF with Marc Maron, Doug Loves Movies, I Was There Too and Superego. Use promo code CRACKED to get 25% off 3-day GA passes. Tickets and information available here:  https://goo.gl/R8gzMX Footnotes:Shane's Website:  https://goo.gl/QvIFeB Shane's Podcast, 'Here We Are':  https://goo.gl/S4FgA5 Robert's Book, 'A Brief History of Vice':  https://goo.gl/LcVmEv Business Insider: Yes, Bayer Promoted Heroin for Children:  https://goo.gl/z4LC0K Scholarly Article: The Five-Factor Theory of Personality:  https://goo.gl/MiUTBo The Big Five Personality Test:  https://goo.gl/13RfI0 Multidisciplinary Association for Psychedelic Studies (MAPS): MDMA-Assisted Psychotherapy:  https://goo.gl/T71TtO MAPS: Ego Death & Psychedelics:  https://goo.gl/QlJb8L Kids Take the Marshmallow Test:  https://goo.gl/HR1uK1 Natural History: Epigenetics and the Dutch Hunger Winter:  https://goo.gl/ywxsto The New Yorker: The Trip Treatment:  https://goo.gl/aLu7bR Sebastian Junger, 'Tribe':  https://goo.gl/W8bVWY Cracked: 4 Awful Ways Our Ancestors Got High:  https://goo.gl/2anEd8 This episode is brought to you by Squarespace and Casper Mattresses.", "duration": "01:56:21", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/285790103-crackedpod-why-the-best-treatment-for-ptsd-may-be-an-illegal-drug.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1474873564, "title": "Stupid Lies From Pop Culture That Everybody Believes", "author": "", "summary": "We all know Rome wasn't built in a day. But in the fake Hollywood adaptation, \"Rome Wasn't Built in a Day,\" it's probably built over the course of a short montage set to peppy music, where it feels like it's built in 20 minutes.That's one of the subtle lies movies and TV imprint on our minds- that monumental things can be achieved in relatively short periods of time or with relatively little effort. Doc Brown hits his head and comes up with the idea for a time machine, and the hardest part is sourcing plutonium from a crew of gullible Libyan terrorists. This myth of invention affects how we look at history too. In our minds, Thomas Edison is a guy who just pulled the idea for the light bulb out of thin air (or from about 3 inches above his head, right after he thought of it), but he's just the guy who happened to invent the best one.These recurring myths are what we're talking about today. Jack O'Brien is joined by Cracked's Jason Pargin (aka David Wong) and Alex Schmidt to talk about this invention myth, why we mistakenly think the President controls the economy, how we assume that there are real-life criminals like movie criminals and why a bomb with a timer on it is the stupidest idea in the world.Also, make sure to come see our THREE live shows this October!First, at 9pm on Thursday, October 6th at the UCB Sunset Inner Sanctum, Jack O'Brien and Daniel O'Brien take a behind-the-scenes look at America's most underappreciated profession: teachers. Along with the cast of TruTV's 'Those Who Can't' and some real-life teachers who would like to remain anonymous, they'll take a look at the secret and alcohol-fueled lives of the people who we entrust to mold the minds of our nation's youth. Tickets are FREE, but it's first come, first serve, so make sure to arrive early. More info is available here:  https://goo.gl/XcGndb Next, at 7pm on Saturday, October 8th at the UCB Sunset Theatre, Jack O'Brien and Nick Mundy co-host a sequel to last year's Halloween episode. Cracked's Tom Reimann and comedians Eric Lampaert, Anna Seregina and Ryan Singer guest to share more real-life stories of death, disappearance and potentially the great beyond. Tickets are $5 and available here:  https://goo.gl/wTyocv Finally, you can see us on Saturday, October 29th at the Now Hear This podcast festival in Anaheim, California. The time is still TBA, but we're on an amazing lineup with other podcasts like WTF with Marc Maron, Doug Loves Movies, I Was There Too and Superego. Tickets and information available here:  https://goo.gl/R8gzMX Footnotes:Cracked: 4 Recurring Myths We Apparently Really Want to Believe:  https://goo.gl/arDKS The Atlantic: The President of the United States Does Not Control the Economy:  https://goo.gl/iVdi4l FiveThirtyEight: A President's Economic Decisions Matter...Eventually:  https://goo.gl/6xtZB7 Slate: Do Freelance Assassins Really Exist?:  https://goo.gl/tT50OV NYT: Profile of notorious art thief Stephane Breitwiesser:  https://goo.gl/IK9t4Y This episode is brought to you by Squarespace and Audible.", "duration": "01:50:40", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/284646614-crackedpod-stupid-lies-from-pop-culture-that-everybody-believes.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1474268815, "title": "Screw Sully: 7 True Stories That Would Make Better Movies", "author": "", "summary": "Ahh September, the leaves are changing into autumnal shades of yellow, red and orange, the air has a chilly bite, and movie theaters are being inundated with 'Based on a True Story' Oscar-bait. This month alone we've got 3 true story movies that shouldn't have much suspense to them: 'Sully' (the plane lands); 'Deepwater Horizon' (oil gets everywhere); and 'Snowden' (dude's in Russia).We've got a little hint for you, Hollywood: how about releasing a movie that isn't about something that happened, like, six seconds ago? History is full of amazing true stories and you're giving us a movie about the most unceremonious, bloodless and explosion-less crash in the history of aviation? Pshhh.This week we've got seven true stories for you that we promise would make better movies than 'Snowden': from the mad warring paleontologists who would rather burn down a museum than see each other gain a modicum of success, to the 10th century Slavic saint who murdered just everybody. Jack O'Brien and Michael Swaim co-host live from the UCB Sunset Theatre in Los Angeles with Cracked guests Carmen Angelica, Tom Reimann and Alex Schmidt, and guest comedians Lindsay Adams, Sunah Bilsted, Eli Olsberg and Steven Wilber.Jack is also joined by Cracked writer and researcher Evan Caris to talk about a major world event that is always underserved in film: World War I.Footnotes:Salon Interview with Atilla Ambrus, The Whiskey Robber: http://goo.gl/FLsxwZBallad of the Whiskey Robber: https://goo.gl/vxlFswCracked: 6 People With WTF Secret Lives Absolutely Nobody Saw Coming: https://goo.gl/XBXQ7cBiography of Julie d'Aubigny: http://goo.gl/c6fyrw'60 Minutes' Clip with Jack Barsky: https://goo.gl/mZxy4LBiography of 'The Bone Wars': https://goo.gl/8mpfQUBiography of Olga of Kiev: https://goo.gl/XxM08MBiography of Sarah Jacob, The Fasting Girl: https://goo.gl/wlG4rqTom Reimann on Twitter: https://goo.gl/wgHhK2Carmen Angelica on Twitter: https://goo.gl/B7W9JRSteven Wilber on Twitter: https://goo.gl/4UNvFfLindsay Adams on Twitter: https://goo.gl/1L02UEAlex Schmidt on Twitter: https://goo.gl/y5P6YoEli Olsberg on Twitter: https://goo.gl/3eVRelSunah Bilsted on Twitter: https://goo.gl/3VgjE6This episode is sponsored by Casper Mattresses and Blue Apron.", "duration": "01:46:29", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/283549981-crackedpod-screw-sully-7-true-stories-that-would-make-better-movies.mp3", "type": "episode", "tags": []}, {"seriesId": 689900475, "seriesTitle": "The Cracked Podcast", "pubDate": 1473664002, "title": "Weird Hearing Super Powers You Didn't Know Your Mind Has", "author": "", "summary": "It's underestimated how important your sense of hearing is, how much it affects your daily life in ways you don't fully appreciate. Take the inconceivable geometry you do in your head all the time, thanks to your ears. Say you're standing with your back facing a street and you hear a car approaching from the right--how do you know that? Your brain is instantly calculating the miniscule differences in volume and the slight difference in time it takes for the sound of the car to reach both ears. Yes, thank you Captain Obvious, but it's still an amazing feat that you're performing all the time, every day, with everything you hear.You probably don't even know how much you hear every day, how unaccustomed to silence you actually are. Silence actually sounds weird, your brain knows something is wrong when it's absolutely quiet. Conversely, really loud places like cities take up so much of your subconscious mental capacities that they also create a sense of unnerving. That's why the sound of nature is so relaxing to us.On this week's podcast Cracked editor-in-chief Jack O'Brien is joined by actor/comedian Johnny Pemberton, whose podcast 'Twisting the Wind' is an incredible aural experiment, a constantly surprising manipulation of sound that pushes the boundaries of what's expected in a podcast. They talk about the power of noise pollution, incredible Tuvan throat singing rap music, how John Williams stole everything from Russian composers and sonic devices that mess with our heads like speech jammers and The Mosquito.Footnotes:Johnny Pemberton's Website:  http://goo.gl/bZ9Tv9 Twisting the Wind with Johnny Pemberton:  http://goo.gl/SzgA4H TED Talk on Noise Pollution:  https://goo.gl/YFtlrX Tuvan Throat Singing:  https://goo.gl/o7yX7h Tuvan Throat Singing Rap:  https://goo.gl/fV8RuQ The Best of Shostakovich:  https://goo.gl/kZp2aA Timmy Thomas - Why Can't We Live Together:  https://goo.gl/QlPFzP Pantera - Mouth for War:  https://goo.gl/MBE8pQ Trailer for Glenn Gould Documentary \"Genius Within\":  https://goo.gl/5OoTlN The Daily Beast: Slow TV:  http://goo.gl/0p8o6x In-Browser Speech Jammer:  https://goo.gl/Te4jr2 Reading Dr. Seuss with Speech Jammer:  https://goo.gl/TmFR68 Infrasound:  https://goo.gl/ZWe5ao The Mosquito:  https://goo.gl/YnYV8h Come see us at the Now Hear This podcast festival:  nowhearthisfest.com This episode is sponsored by Squarespace and Wealthfront Veritone.", "duration": "01:13:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music62/v4/bf/e2/29/bfe229a7-6143-57f3-e75f-9dc5ad825431/source/60x60bb.jpg", "audioUrl": "http://feeds.soundcloud.com/stream/282491813-crackedpod-weird-hearing-super-powers.mp3", "type": "episode", "tags": []}]}