{"series": {"feedUrl": "http://podcasts.grantcardone.com/xml/younghustlers.xml", "genres": ["Business News", "Podcasts", "Business", "Management & Marketing", "Education", "Training"], "title": "Young Hustlers", "country": "USA", "author": "GrantCardoneTV", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "type": "series", "id": 860180416}, "episodes": [{"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1488553060, "title": "165: Problems vs Opportunities", "author": "", "summary": "What are your problems? Problems are money. Every problem ever solved on this planet is an opportunity. The bigger the problem solved, the richer you become. You need to pick your problems rather than get stuck with them. Be the creator of your problems, not the receiver. I always tell people to look at their problems as opportunities because one of the most basic truths in life is that problem-solving is success. If I have problem customers (people who give me a hard time during the buying process), or dissatisfied customers (people I have sold but are unhappy about what they received), then I know this is where I can create the most ardent admirers. If I show that I am willing to go above and beyond where my competitors decide to stop at, my customers will be the people who are more likely to be sold and more likely to buy from me because I have exceeded any and all of their expectations. Obviously, I don’t want every one of my customers to be problematic, but what it comes down to is this: if there’s a problem, my success is reliant on my ability to provide solutions for them. Problems are your opportunities!", "duration": "42:13", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/younghustlers/YH_165_Problems_vs_Opportunities_2017.03.02.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1487869200, "title": "164: The Best Advice I Ever Got", "author": "", "summary": "<p>The Best Advice I Ever Got – Young Hustlers: What is the best advice you’ve ever received? You get a lot of advice from others going through life—much of it bad. Every now and then you get a great piece of advice that can change your life. Here are some of the best pieces of advice Grant has received:</p>\n\n<p>You need to think bigger—Don’t listen to people who say bigger is not always better. Tell that to Google or Facebook.</p>\n\n<p>Best investment you make is in yourself—Nobody does wrong when they spend money to get new knowledge, new skills, and new ways to develop themselves.</p>\n\n<p>Only buy things that produce money.  Don’t waste money on things like houses or cars that don’t produce income for you.</p>\n\n<p>Write in comments the best advice you’ve ever received, and remember, the only people who tell you not to hustle are those that have given up on the hustle themselves!</p>", "duration": "32:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_164_The_Best_Advice_2017.02.23.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1487264400, "title": "163: How to Build Confidence", "author": "", "summary": "<p>How much confidence have you got? Confidence is complete, full trust. No one thing can blow a deal. You need to have complete trust in that. It’s a series of things that happen if you blow a deal. If you want confidence in life, get confidence in yourself. Most of the bags you pick up in life are losses, not victories.  Full trust in self is more valuable than any amount of money. You need to invest in things that increase your confidence. Why is it so important to have confidence?</p>\n\n<p>Here is how to build it and why:\n<br />1. Be professional in your dress and language. How you carry yourself counts!\n<br />2. Be the first one there\n<br />3. Have a great attitude\n<br />4. Gain knowledge\n<br />5. Work extra and go in on off days.\n<br />6. Be consistent.\n<br />7. Bring In Revenue</p>", "duration": "45:03", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_163_Be_More_Confident_2017.02.16.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1486659600, "title": "162: Finding the Right Problem", "author": "", "summary": "<p>Do you have the right problem? Too many people have the wrong problem because of how they think. If you want to go big, if you want to get big, if you want to play big, you’ve got to quit all the small talk. Quit demeaning yourself when it comes to the price of something. Quit giving yourself reasons you can’t do something. Your think determines what happens in your world, where you live, the view you have, the job you get, the money you make, and the happiness you experience.</p>\n\n<p>Your problem isn’t that you don’t have $100,000—it’s that you don’t have $100 million. Debt is not your problem. Income is, you need to make more. The customer isn’t your problem, you are. Insecurity is not your problem. Not taking risks is. If your problem is that you don’t have enough money, the real problem is you aren’t great yet at what you do. Too many people are on the wrong problem. Find the right problem and you’ll be able to fix your problem.</p>", "duration": "40:19", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_162_Pick_the_Right_Problem_2017.02.09.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1486054800, "title": "161: The 5 Biggest Mistakes Millennials Make with Their Money", "author": "", "summary": "<p>Millennials make a lot of mistakes—every generation does. This is because people are ignorized by the media. Planet earth manufactures so much ignorance it’s incredible. Today I wanted to highlight the 5 largest blunders that millennials must fix if they want to get their money right. Make this the year you get your financial house in order!</p>\n\n<p>1) Not making enough money—The holy grail of money that almost no one talks about is to make money. You can get rich or solve money problems without making money. Making more money is more important than saving or paying off debt. Spend more time making money and less time talking about your age, social media, and politics. There will be many presidents in your lifetime most of which you will disagree with.</p>\n\n<p>2) Paying off student debt prematurely—Student debt would be the last thing I would pay back and I wouldn’t suggest you do so until after you have some real money put away. And by the way, before you pay off your loan you should renegotiate a payout. Get your financial life in order and then start paying off your part of the student debt bubble of 1.3 trillion dollars.</p>\n\n<p>3) Using Credit for stuff that can’t create income—I have a rule, ONLY USE DEBT IF IT MAKES ME MONEY OR MAKES ME BETTER. Never use debt that can’t produce income. Buying a home with a mortgage that can never make you money just doesn’t make sense. Buying a motorcycle on debt can’t make me money but I would lease a car so I could make sales calls. Just look at your parents.</p>\n\n<p>4) Investing prematurely—Wall Street loves to see you invest money at the age of 12 and spin all these stories about if you do so you will be rich when you retire. It’s insane. If you don’t know what you are investing in then its not investing, its gambling. There is no way you will possibly know what you are doing at that young of an age. Information is everywhere and knowledge is almost nowhere.</p>\n\n<p>5) Spending too much time at college. If you believe you have to go to college then get in and get out. You could cut your college bill in 1/2 by getting it done in half the time. This would save the average college student $46,000 and have you earning money twice as fast as most of the chumps you go to class with.</p>\n\n<p>All millennials should be coming to 10X GrowthCon this March. It’s the biggest entrepreneurial business conference of all-time. Learn strategies and get ideas that are priceless from men and women responsible for over $10 billion in sales.</p>", "duration": "33:29", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_161_5_Biggest_Mistakes_Millennials_Make_2017.02.02.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1484845200, "title": "159: What To Do When You Are Not Feeling It", "author": "", "summary": "<p>What do you do when you're not feeling it? You have no energy, you're flat...everyone has those kind of days. How can you break through this? First, be aware of which areas this happens in. For example, is it in the gym, at work, with a relationship? You can be obsessed in one thing and flat in another area all in the same day. First identify the areas where you aren't feeling it. Decide to move to success and not average, you have to take action.</p>\n\n<p>1) Make goals in that area</p>\n\n<p>2) Exercise</p>\n\n<p>3) Have Coffee</p>\n\n<p>4) Phone a Friend</p>\n\n<p>5) Learn Something New</p>\n\n<p>6) Go to an Event</p>", "duration": "31:29", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_159_What_To_Do_When_You_Are_Not_Feeling_It_2017.01.19.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1484338560, "title": "158: Top 10X Principles", "author": "", "summary": "<p>The 10X Rule has been a best seller for over 5 years now because it’s changed lives. Today Jarrod Glandt reveals the top 5 principles from the 10X Rule you need to apply to your life. The 10X Rule is a movement, are you ready to become a part of it?</p>\n\n<p>1.No Shortage of Success—There is so much money on this planet it’s crazy. The stock market could lose a trillion dollars and there would still be an abundance of wealth on this planet.</p>\n\n<p>2.Assume Responsibility for all Results—Taking responsibility for everything in your life is the only way to take control of your life.</p>\n\n<p>3.Take Only Massive Action—When you take massive actions your mind-set will shift and so will your results. You will end up instigating opportunities that you will have to address earlier, later, and in a different way than you would on a “normal” day, so a routine day will become a thing of the past.</p>\n\n<p>4.Fear is an Indicator to Take Action— Getting a handle on fear is not easy, but it is critical to success. Maybe fear held you back you from calling on a client, investing money in your company, or maybe moving to a new city for a great opportunity or taking a great relationship to a more serious level.</p>\n\n<p>5.Criticism is a Sign of Success— Although getting criticized is certainly not the best feeling in the world, I have great news: Receiving criticism is a surefire sign that you are well on your way. Criticism is not something that you want to avoid; rather, it’s what you must expect to come your way once you start hitting it big.</p>", "duration": "31:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_158_Top_10X_Principles_2016.01.12.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1483635600, "title": "157: How to Find a Coach", "author": "", "summary": "<p>Young Hustlers How to Find a Coach: The Karate Kid was waxing on and off, but he didn’t know why Mr. Miyagi was having him do it. He didn’t understand what his coach knew. When you find a coach, you have to listen to them even if it’s not clear why you are doing what you’re doing. Here are 5 steps to finding your coach:</p>\n\n<p>1. Find an expert in the area you’re looking to improve\n<br />2. Validate their track record. How long have they been in business? What is behind the curtain?\n<br />3. Be sure they are a fit with you so you can be excited and really be attached.\n<br />4. Follow them until you outgrow them.\n<br />5. Repeat that in different areas you want to improve.</p>\n\n<p>Never ask a question from a coach that you can find from them elsewhere. For today only, Grant is offering an incredible deal for anyone who wants to be coached by Grant himself. Learn more at www.cardoneu.com</p>", "duration": "29:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_157_How_to_Find_a_Coach_2017.01.05.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1483051928, "title": "156: How to Hit Your 2017 Goals", "author": "", "summary": "<p>2017 is coming, do you have your goals in order? With any target you make, you must have the right why. Reverse engineer the goal. If you want to be financially free at 50, you need to start doing the math and figuring out what you need and how you can get there. Get rooted and connected to your goals. Get real clear on the purpose of your goals and don’t have someone else’s goals. Lay out your goals and make them a part of the way you live. Commitments take money and time, and sooner or later you will realize you need to confront your skills. Skills pay the bills. Here are 3 things you must do to make sure you hit your goals in 2017.</p>\n\n<p>1.Stay away from things that don’t make you feel good, things that lower your self-esteem.\n<br />2.Be healthy and eat right. Start your day with exercise.\n<br />3.Feed your mind and educate yourself. Get good info and data from people that will push you to get what you want.</p>\n\n<p>Have a great start to the new year!</p>", "duration": "29:19", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_156_Hit_Your_Goals_2017_2016.12.29.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1482426000, "title": "155: How to Land Monster Deals", "author": "", "summary": "<p>Can you land a massive, monster deal? Would you rather do two or three small deals or one gigantic deal? Small deals are good—they will feed you—but whale deals are where the big money is. You need both kind of deals. Sometimes a $30 book will turn into a $300,000 contract.</p>\n\n<p>7-figure deals take time. That doesn’t mean you can’t inject urgency into the deal, but it might take 200-300 swings at the tree to cut it down—not one swing.</p>\n\n<p>Whale hunting is more than just revenue, it means a better reputation and higher prestige. Here are 3 tips to get giant deals:</p>\n\n<p>1.You have to be looking for big deals—Hunt for them. Have your eyes open and be aware of every contact you make. You never know what will lead to the big deal.</p>\n\n<p>2.You have to have a lot of lines in the water—Take massive action in all directions. Use all mechanisms possible whether it be texts, phone messages, social media etc.</p>\n\n<p>3.Jump in prepared to go the distance—You need perseverance because big deals take awhile.</p>\n\n<p>You need creativity over time. You need preparation.</p>", "duration": "36:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_155_Monster_Deals_2016.12.22.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1481842080, "title": "154: Finding the Right Problem", "author": "", "summary": "<p>Do you have the right problem? Too many people have the wrong problem because of how they think. If you want to go big, if you want to get big, if you want to play big, you’ve got to quit all the small talk. Quit demeaning yourself when it comes to the price of something. Quit giving yourself reasons you can’t do something. Your think determines what happens in your world, where you live, the view you have, the job you get, the money you make, and the happiness you experience.</p>\n\n<p>Your problem isn’t that you don’t have $100,000—it’s that you don’t have $100 million. Debt is not your problem. Income is, you need to make more. The customer isn’t your problem, you are. Insecurity is not your problem. Not taking risks is. If your problem is that you don’t have enough money, the real problem is you aren’t great yet at what you do. Too many people are on the wrong problem. Find the right problem and you’ll be able to fix your problem.</p>", "duration": "40:19", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_154_Pick_the_Right_Problem_2016.12.15.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1481216400, "title": "153: Keep Your Mind On Your Money", "author": "", "summary": "<p>How can you stay more focused the next 3 weeks to end the year strong? If you’re thinking more about Christmas than you are about your money, you need more money. People have bad Januarys because they have bad Decembers. The way to harvest in January is to plant the seeds in December. The 5 things you do today will determine what you are tomorrow. Why do people get so focused on calendars? The time is NOW. Skills pay the bills. Here are 6 ways to get your money right now:</p>\n\n\n<p>1. Pay more attention to your goals than your Christmas list—Write them every day. \n<br />2. Have Urgency—While others are in holiday mode, you need to have lots of activity. \n<br />3. 2017 is here—It’s already here, because what you do in December will influence your January.\n<br />4. Don’t be satisfied—If you are, you are hanging out with the wrong people.\n<br />5. Focus on what you can measure—Don’t be guessing. \n<br />6. Focus on the lowest hanging fruit around you—Do you create a new client or look at opportunities with existing clients?</p>", "duration": "31:02", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_153_Keep_Your_Mind_On_Your_Money_2016.12.08.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1480611600, "title": "152: How to Find a Coach", "author": "", "summary": "<p>Young Hustlers How to Find a Coach: The Karate Kid was waxing on and off, but he didn’t know why Mr. Miyagi was having him do it. He didn’t understand what his coach knew. When you find a coach, you have to listen to them even if it’s not clear why you are doing what you’re doing. Here are 5 steps to finding your coach:</p>\n\n<p>1. Find an expert in the area you’re looking to improve\n<br />2. Validate their track record. How long have they been in business? What is behind the curtain?\n<br />3. Be sure they are a fit with you so you can be excited and really be attached.\n<br />4. Follow them until you outgrow them.\n<br />5. Repeat that in different areas you want to improve.</p>\n\n<p>Never ask a question from a coach that you can find from them elsewhere. For today only, Grant is offering an incredible deal for anyone who wants to be coached by Grant himself. Learn more at www.cardoneu.com</p>", "duration": "29:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_152_How_to_Find_a_Coach_2016.12.01.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1480006800, "title": "151: Who's Got My Money?", "author": "", "summary": "<p>Grant Cardone and Jarrod Glandt share reality with you each Thursday at 12 EST.  There is no shortage of money out there.  Rich is not a fantasy—it’s a game of offense.  Make a decision to get rich, do the millionaire math, and then there are three simple steps to follow:</p>\n\n<p>Do you want money?  Who’s got it?</p>\n\n<p>1. Set a target\n<br />2. Pursue the target with a military effort\n<br />3. Shut the deal down</p>\n\n<p>Never be average—get great.  If you need skills get on Cardone University today.  To earn cash you either need knowledge that others need or you need to know how to go out and get money.  It’s best to have both.  Also the wait times at the VA are ridiculous, are veterans have to wait 112 days on average to get a simple appointment and some of them are dying before they can get in.  If a place isn’t in a hurry to serve it means either they don’t care or they aren’t being held accountable—or both.  Fire Robert McDonald head of the VA—sign the petition and share: https://www.change.org/p/barack-obama-fire-secretary-of-va-robert-a-mcdonald-immediately</p>", "duration": "46:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_151_Whos_Got_My_Money_2016.11.24.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1479402000, "title": "150: The Who, What & Why of Investing", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "39:08", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_150_Investing_2016.11.17.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1478797200, "title": "149: Biggest Closing Mistakes", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt talk about why you aren’t closing deals. You must know how to handle objections. In sales you are looking for 1 objection—that’s it. You need to have fun because the customer is already too serious. You need to feel good about yourself, and you have to go into a deal having the confidence you will close. If you don’t have the confidence, it’s because you don’t have the skills.</p>\n\n<p>Be in sales to win it.</p>\n\n<p>For every objection you hear, you need to listen and acknowledge it. Take full responsibility for it, and then isolate it: “Other than you not being interested, is there any other reason that would keep you from giving me a couple minutes of your time?”</p>\n\n<p>This Saturday the 17th Grant will be going over in detail specific objections on his live seminar.</p>\n\n<p>Time is running out to register.</p>\n\n<p>When you sign up, you’ll get for free:</p>\n\n<p>* 15 videos on Exact Handling Objections Scripts</p>\n\n<p>* 25-Minute Play by Play Breakdown of me Handling Objections on the Phone</p>\n\n<p>* 50+ Page eBook of Brand New Content I put together on Mastering Objections</p>\n\n<p>* 200+ Page PDF Rebuttal Book of Never Before Seen Closes</p>", "duration": "58:13", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_149_Biggest_Closing_Mistakes_2016.11.10.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1477584000, "title": "148: The Truth About 401ks", "author": "", "summary": "<p>401K’s are not ok. Who’s got your money? You don’t want Wall Street having it. They created the 401K and are supported by politicians. They want your money now while you are young, so they make a pitch to the middle class to get people to give every month and keep your money for the next 40 years. You don’t need to go to Wikileaks to find all scams. To invest with somebody like Grant in real estate, they won’t let you because they made laws so that you have to make 200K a year first. They will let anybody invest with Wall Street though. The 401K gives no cash flow! You’re trapped. 2.8 trillion dollars are trapped in 401K’s, and people don’t even know who they are sending their money to. Would you give a stranger on the street corner money?  It can be wiped out overnight, people lose 30% of their savings just like that. </p>\n\n<p>Don’t do 401K’s for three reasons:</p>\n\n<p>1. You lose access to your money\n<br />2. You lose control of your money\n<br />3. You lose choices with your money</p>", "duration": "36:07", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_148_The_401k_2016.10.27.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1476979200, "title": "147: How to Make a Commitment", "author": "", "summary": "<p>Do you have intention or do you just wander through life? How do you get much done? Commitment.</p>\n\n<p>How do you get rich? Commitment.</p>\n\n<p>How do you make a commitment?</p>\n\n<p>1.Clarify what the commitment is—Everyone can commit. Many are committed to making excuses. Many are committed to being fat. Some are committed to drugs while others are committed to average. Clarify what your commitment is.</p>\n\n<p>2.What do you need to give up—Commitments restrict you. When you make a commitment, you by definition say yes to one thing while saying no to other things. What things do you need to give up to make your commitment real?</p>\n\n<p>3.Reinforce it everyday—Don’t commit just once. Anything worth doing is worth doing every day.\n<br />Remember, all commitments require time and resources!</p>", "duration": "37:04", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_147_How_to_Make_a_Commitment_2016.10.20.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1476374400, "title": "146: How to Control Your Money", "author": "", "summary": "<p>Don’t go to work to work—go to work to prosper. Control with money is a good thing. You must be a control freak. Control equals income. The more control you have, the more confident you’ll be.</p>\n\n<p>The first thing to be concerned about when it comes to money is commitment. Most people don’t have enough money to begin with to even be concerned about saving it. If you don’t discipline yourself the marketplace will spank you.</p>\n\n<p>Time is money and production is senior to saving. If you only have $1,000 it will only get smaller. You have to go and get more income. The shift in thought to focus on income exclusively is a game changer. How can you control your money?</p>\n\n<p>1. You must commit to it.\n<br />2. Get more productive, because production equals new money.\n<br />3. Get obsessed with improving your skills.</p>", "duration": "36:20", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_146_Control_Your_Money_2016.10.13.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1475769600, "title": "145: Be Obsessed in Sales", "author": "", "summary": "<p>Today Grant Cardone and Jarrod Glandt talk about obsession and take callers on Young Hustlers. What’s the difference between obsession and indifference? Obsession doesn’t work 9-5, obsession doesn’t make excuses it finds a way, and obsession doesn’t see problems—it sees opportunities. Obsession can’t comprehend impossible because things are only impossible until you do it. How do you take obsession and add it to sales? Michael Bonnett is the top sales guy in Grant’s office this year, he is a pit-bull on the phone on pace for half a million this year. He’s gotten obsessed with sales, obsessed with hard questions and with follow up.</p>\n\n<p>There are too many spectators out there watching stuff on Instagram. You must get to work, get obsessed, hustle, and be all in all the time like a maniac. You won’t get rich playing Pokemon. There’s so much average and people just occupying space. The complacency is abundant. If you’re running out of juice, you lack data. You need skills and to become obsessed with being a pro. Get started by getting on Grant’s Playbook today. With the payment plan it costs less than 14 pennies a day.</p>", "duration": "50:34", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_145_Obsessed_with_Sales_2016.10.06+copy.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1475164800, "title": "144: How to Make Life at Work Easier", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt talk about how to make your life easier. To make your life easier you must know how to solve problems. There are 3 steps for problems:</p>\n\n<p>1.Identify the problem. \n<br />2.Take Responsibility for the Problem\n<br />3.Solve the Problem</p>\n\n<p>Today Grant’s problem is he needs to sell books of Be Obsessed or Be Average, so Grant committed to get creative to sell books. He has to create buzz before the release date and ensure the audience reads and reviews the book. What he did was take responsibility for all the apparent challenges which appeared to be beyond his control and used them to make an offer so compelling that people have to purchase the book. All commitments must be followed by time and money. If you won’t commit time and money to your problems, you are not taking full responsibility. Make your life easier by taking care of problems!</p>", "duration": "40:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_144_How_to_Make_Life_at_Work_Easier_2016.09.29.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1474560000, "title": "143: How to Manage Time", "author": "", "summary": "<p>Grant Cardone and Jarrod Glandt discuss how time is money. Control time or lose money. Make excuses or make money—you can’t make both. Time is the most valuable commodity you have. Get obsessed with time. If you can’t control time you’ll decrease production. Two people can be at work for 8 hours but get drastically different results.  See how much you can do in 15 minute blocks. Here are three tips:</p>\n\n<p>1.    Commit to controlling your time\n<br />2.    Accept Responsibility for it\n<br />3.    Cram more into what you do</p>\n\n<p>Cram as much as you can into your day, take responsibility for it, and stay committed to it. Get obsessed with it and pre-order today Grant’s new book Be Average or Be Obsessed. </p>\n\n<p>Get the hardcover and you can send in your receipt to obsessed@grantcardone.com to get access to 13 coaching sessions with Grant!</p>", "duration": "29:50", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_143_How_to_Manage_Time_2016.09.22.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1473955200, "title": "142: Biggest Closing Mistakes", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt talk about why you aren’t closing deals. You must know how to handle objections. In sales you are looking for 1 objection—that’s it. You need to have fun because the customer is already too serious. You need to feel good about yourself, and you have to go into a deal having the confidence you will close. If you don’t have the confidence, it’s because you don’t have the skills.</p>\n\n<p>Be in sales to win it.</p>\n\n<p>For every objection you hear, you need to listen and acknowledge it. Take full responsibility for it, and then isolate it: “Other than you not being interested, is there any other reason that would keep you from giving me a couple minutes of your time?”</p>\n\n<p>This Saturday the 17th Grant will be going over in detail specific objections on his live seminar.</p>\n\n<p>Time is running out to register.</p>\n\n<p>When you sign up, you’ll get for free:</p>\n\n<p>* 15 videos on Exact Handling Objections Scripts</p>\n\n<p>* 25-Minute Play by Play Breakdown of me Handling Objections on the Phone</p>\n\n<p>* 50+ Page eBook of Brand New Content I put together on Mastering Objections</p>\n\n<p>* 200+ Page PDF Rebuttal Book of Never Before Seen Closes</p>", "duration": "58:13", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_142_Buggest_Closing_Mistakes_2016.09.15.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1473350400, "title": "141: Why You Don't Make Sales", "author": "", "summary": "In this week’s Young Hustlers Grant Cardone goes solo with Jarrod Glandt closing a deal in California—until John Hamlin shows up in studio. Grant discusses that if you don’t like sales, it’s because you aren’t making any sales.", "duration": "50:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_141_Why_You_Dont_Make_Sales_2016.09.08.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1472745600, "title": "140: Mastering Objections", "author": "", "summary": "<p>Today Grant Cardone and Jarrod Glandt talk about objections on Young Hustlers and take callers, even offering help on the objections the callers face. Every sales person has to learn to master objections. You deal with Internal and external objections everyday.</p>\n\n<p>Just like in football, some plays are not meant to get a touchdown, they are just meant to advance the ball—and the same is true with closing. You handle objections by also anticipating what the customer is going to say next. “Whoever asks the question, controls the conversation.” Not true, “Whoever gets the answers to questions controls the conversation.”\n<br />Grant is doing a Webinar on Mastering Objections. It’s time you learn to handle objections, become a better closer, and be a top producer. Great Salespeople know the difference between an objection and a complaint.</p>", "duration": "45:28", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_140_Mastering_Objections_2016.09.01.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1472140800, "title": "139: Who's Got My Money?", "author": "", "summary": "<p>Grant Cardone and Jarrod Glandt share reality with you each Thursday at 12 EST.  There is no shortage of money out there.  Rich is not a fantasy—it’s a game of offense.  Make a decision to get rich, do the millionaire math, and then there are three simple steps to follow:</p>\n\n<p>Do you want money?  Who’s got it?</p>\n\n<p>1. Set a target\n<br />2. Pursue the target with a military effort\n<br />3. Shut the deal down</p>\n\n<p>Never be average—get great.  If you need skills get on Cardone University today.  To earn cash you either need knowledge that others need or you need to know how to go out and get money.  It’s best to have both.  Also the wait times at the VA are ridiculous, are veterans have to wait 112 days on average to get a simple appointment and some of them are dying before they can get in.  If a place isn’t in a hurry to serve it means either they don’t care or they aren’t being held accountable—or both.  Fire Robert McDonald head of the VA—sign the petition and share: https://www.change.org/p/barack-obama-fire-secretary-of-va-robert-a-mcdonald-immediately</p>", "duration": "46:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_139_Whos_Got_My_Money_2016.08.25.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1471553800, "title": "138: 5 Ways to Increase Sales Today", "author": "", "summary": "<p>Today on Young Hustlers, Jarrod Glandt gives five key sales tips to skyrocket your income:</p>\n\n<p>1. Attitude—Your attitude is everything. It can be seen everywhere in the sales cycle. It directs the flow of what you do. People will pay more for a great attitude than a great product. Attitude determines altitude.</p>\n\n<p>2. VAFU—Value added follow up. This will differentiate from everyone else. It takes time sometimes to close a sale. 80% are closed between the 5th and the 12th contact. What are you doing to be valuable to your prospect? Get creative and get people’s attention. </p>\n\n<p>3. Texting—This is a great way to get responses from people. Texts have a 98% open rate compared to 20% for email. Texting is quick and easy with low commitment.</p>\n\n<p>4. Ask for Referrals—Every single interaction is an opportunity for you to get a referral. 84% of decision makers who enter into a sales process are from referrals, and referrals close 70% faster. Salespeople that actively seek referrals make 4-5 times more than those that don’t. </p>\n\n<p>5. Role Playing and Training—All the greats take the time to practice. Nobody is born a great salesperson. You have to perfect your craft. All of Grant’s salespeople train daily, so why shouldn’t you?</p>", "duration": "36:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_138_5_Ways_to_Increase_Sales_Today_2016.08.18.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1470931200, "title": "137: How to Get the Life You Deserve", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "53:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_137_How_to_Get_the_Life_You_Deserve_2016.08.11.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1470326400, "title": "136: How to Get Super Rich", "author": "", "summary": "<p>How do you get not just rich, but super rich? If the doctor said you have a disease, maybe cancer or Zika, would you do everything in your power to beat it? Of course. Will you do everything in your power to get super rich?  If not, you will settle. You can’t get rich at a job, but that doesn’t mean you should leave your job. Most people who work for themselves don’t get rich either. Poor people are selfish. The Middle Class is selfish. They talk about what they don’t need. The most narcissistic people on planet earth are people who settle for average.  If you make 70K and don’t want anymore than why not make 140K and and give 70K away? You see how selfish it is? They aren’t concerned about helping anyone, they just want to be comfortable. You need to assault average. Take it behind the grocery store, beat it up, and crack its vertebrae. Beat up average.  \n<br />Don’t pretend to be satisfied.  Quit settling.  Quit taking Suzy Orman’s advice. You aren’t going to save anything when you make 52K, sorry it’s not going to happen. You are surrounded by average and you need to get obsessed. 3 steps for you today:</p>\n\n<p>1)You must make a decision to get rich. \n<br />2)Beat up average\n<br />3)Get your Playbook</p>\n\n<p>You won’t get rich until you decide to do so. After your decision, you need to rid yourself of everything average. Next, you need to invest in you. I can give you skills that will make you money. Get super rich.</p>", "duration": "32:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_136_How_to_Get_Super_Rich_2016.08.04.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1469736503, "title": "135: Be Obsessed in Sales", "author": "", "summary": "<p>Today Grant Cardone and Jarrod Glandt talk about obsession and take callers on Young Hustlers. What’s the difference between obsession and indifference? Obsession doesn’t work 9-5, obsession doesn’t make excuses it finds a way, and obsession doesn’t see problems—it sees opportunities.  Obsession can’t comprehend impossible because things are only impossible until you do it.  How do you take obsession and add it to sales? Michael Bonnett is the top sales guy in Grant’s office this year, he is a pit-bull on the phone on pace for half a million this year. He’s gotten obsessed with sales, obsessed with hard questions and with follow up.</p>\n\n<p>There are too many spectators out there watching stuff on Instagram. You must get to work, get obsessed, hustle, and be all in all the time like a maniac. You won’t get rich playing Pokemon. There’s so much average and people just occupying space.  The complacency is abundant. If you’re running out of juice, you lack data.  You need skills and to become obsessed with being a pro.  Get started by getting on Grant’s Playbook today. With the payment plan it costs less than 14 pennies a day.</p>", "duration": "50:34", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_135_Obsessed_with_Sales_2016.07.28.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1469128962, "title": "134: Top Traits of Young Hustlers", "author": "", "summary": "<p>Today on Young Hustlers Jarrod Glandt talks about the things you need to become to be a Young Hustler. What are the top traits of a Young Hustler?</p>\n\n<p>1.You have to want more. You either want more, the same, or less. This goes for anything in life. Get clear on why you want what you want.\n<br />2.Be curious, be conscious, be aware. Things are changing so fast you have to stay up on things.\n<br />3.Be committed to learning. There is a difference between learning and studying. You aren’t learning if you aren’t applying.\n<br />4.Take a short term hit for the long term gain. Pay the price today so you can pay any price tomorrow.\n<br />5.Being disciplined. This speaks for itself, if you aren’t disciplined you won’t get rich.</p>", "duration": "32:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_134_Top_Traits_of_Young_Hustlers_2016.07.21.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1468512000, "title": "133: How to Succeed With a Mentor", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt discuss the importance of mentors.  </p>\n\n<p>If you don’t do the research on a person you can’t trust them.  You have to really research them.  If you’re not willing to do the research, you’re not serious.  A mentor is defined as an experienced and trusted advisor. Based on the definition, you need to trust them. People have wrong expectations of what mentorship really is. It’s not an age thing.  A 60 year-old can learn something from a 14 year-old.  Maybe it’s the new Pokemon app.  The point is you shouldn’t trust someone who hasn’t done what you want to do. A mentor doesn’t have to be a face-to-face meeting. You don’t have to personally know a person for them to be your mentor. Just consume their information.  A few tips in finding a mentor:</p>\n\n<p>1. Choose carefully—Get someone who is qualified. Before you go all in with someone really learn what they are about.</p>\n\n<p>2. Do not get too many sources of data— You don’t need too many chefs in the kitchen.  Pick just a couple, or better yet, just one.</p>\n\n<p>3. Duplicate exactly what they tell you to do—Don’t be filtering what they say by what you think.  If you want to be mentored, do what they say.</p>\n\n<p>4. Stick with them until you outgrow them—Don’t give up on it until you’re ready for a new mentor to take you to new levels.  </p>\n\n<p>You either have the wrong information or you lack information. Get the information you need with www.GrantCardoneplaybook.com</p>", "duration": "54:26", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_133_How_to_Succeed_With_a_Mentor_2016.07.14.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1467907200, "title": "132: How to Get Your Money Right", "author": "", "summary": "<p>There’s a lot of uncertainty right now in the financial world. You remember 2008. Jarrod starting work for Grant in late 2009 living on an air mattress and worrying how to pay for his next trip to the supermarket. The ability to increase his income, to even control his income in uncertain times gave him great confidence. You too can learn what Jarrod did. Severe economic times call for severe measures. How can you get more money in the job you’re in right now? 5 things to get your money right:</p>\n\n<p>1. Always commit—this is basic and you have to go all-in on getting rich.\n<br />2. Income is senior, get a flow of income—don’t worry about a 2nd flow until your 1st flow is a fire hose.\n<br />3. Set Income Target 10X higher —If you make 30K, don’t just shoot for 60K, go for 300K.\n<br />4. Do the math—This is what will make it real to you. You have to find the right vehicle to do it in though because you won’t make a 100K when your boss makes 70K. Find companies that are expanding.\n<br />5. Invest in yourself—Nobody got great at anything without practicing and learning. You don’t have a million dollars because you don’t yet have the skills.</p>", "duration": "38:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_132_How_to_Get_Your_Money_Right_2016.07.07.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1467319389, "title": "131: How to Get the Life You Deserve", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "53:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_131_How_to_Get_the_Life_You_Deserve_2016.06.30.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1466697600, "title": "130: The Hardest Part About Getting Rich", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "33:49", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_130_The_Hardest_Part_About_Getting_Rich_2016.06.23.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1466112629, "title": "129: The Best Advice Ever", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt talk about how you can become a millionaire.  The reason you aren’t a millionaire yet is because of the advice you’ve received. What would do if you had unlimited wealth?  You could pay off your parents’ debt and buy your dream house, pay off all your student debt, buy some nice cars, go to Paris and eat out wherever and whenever you want—and you’d still have a bunch of dough left over.  Grant has created this kind of lifestyle for himself and you can too.  You don’t have to be one of the 76% of Americans that live paycheck to paycheck.  You don’t have money because…</p>\n\n<p>1.    The game has changed\n<br />2.    You were not taught how to get money\n<br />3.    You were not taught how to keep money\n<br />4.    You were not taught how to multiply it</p>\n\n<p>You have to want to be a millionaire, believe it’s a possibility, then get educated.  You need some muscle on your hustle.  Hustle alone will not get you rich.  You must have skills.  You can have anything you want in life if you just learn how to sell.  Keep your calendar full—no white space.  Grant did 43 Snap Chats yesterday—what are you doing to promote your brand?  You don’t start a business you are a business.  Get on Grant’s Playbook to Millions today.  http://playbooktomillions.com/</p>", "duration": "48:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_129_The_Best_Advice_Ever_2016.06.16.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1465488000, "title": "128: Getting Rich is Not a Fantasy", "author": "", "summary": "<p>On this edition of Young Hustlers Grant Cardone and Jarrod Glandt talk about the fact that getting rich is not a fantasy and take questions from callers. Money is about having freedom of choice.</p>\n\n<p>A few questions to ask yourself:</p>\n\n<p>1.What does rich mean to you? $1 million? 5 million? $100 million? You need to define what it is before you go after it. Otherwise it’s just pie in the sky.</p>\n\n<p>2.Why is getting rich important? Just enough sucks. When you feel uncertainty, that anxiousness—that doesn’t go away right away even when you start making some money. The more money you make the more confident you become. It’s important if you value freedom.</p>\n\n<p>The bottom line is if you don’t believe you can be rich you won’t be. It’s not a fantasy if you believe it’s possible. Few people know how to get money so it is a fantasy for them. The only reason to save money is to multiply it. You don’t invest 10K, you keep saving. Keep saving until you have a significant sum to invest.</p>\n\n<p>If you want detailed tactics on becoming a millionaire, check out the new product Grant put together this month called Playbook to Millions which is created to build millionaires. Getting rich is not a fantasy—last year over 500,000 families became millionaires. Over 80% of them are self-made.</p>\n\n<p>Get started on your path by going to:</p>\n\n<p>http://playbooktomillions.com/</p>", "duration": "1:02:03", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_128_Getting_Rich_is_Not_a_Fantasy_2016.06.09.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1464883200, "title": "127: Handle Your Gorilla", "author": "", "summary": "<p>In today’s Young Hustler’s Grant Cardone and Jarrod Glandt discuss what happened with the Cincinnati Zoo shooting and killing a 450 lb silverback gorilla that had a 3-year old human child in his grasp. The zoo is getting heat suggesting it did the wrong thing. Grant and Jarrod ask why is this so hard for people to handle? Why do people go into such shock when things like this happen? You need to learn how to put gorillas down in life. Employees who show up late, make mistakes, don’t hit quota, won’t take the time to train and improve themselves and then continue to lower the bar of expectation amongst the rest of your staff need to be put down (fired). What gorillas do you have that need to be put down? We all have to make tough choices sometimes—it’s not easy putting the gorilla down. Get focused on you, go to conferences, read, listen to audio and train so you don’t have time for the zoo. If you’re making money you aren’t at the zoo.</p>\n\n<p>1. Be willing to fire the customer.\n<br />2. Be willing to fire the employee.\n<br />3. Be willing to fire friends and family who aren’t supportive.\n<br />4. Be willing to take control of your financial freedom.</p>", "duration": "41:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_127_Handle_Your_Gorilla_2016.06.02.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1464278400, "title": "126: Who's Got My Money?", "author": "", "summary": "<p>Grant Cardone and Jarrod Glandt share reality with you each Thursday at 12 EST.  There is no shortage of money out there.  Rich is not a fantasy—it’s a game of offense.  Make a decision to get rich,  do the millionaire math, and then there are three simple steps to follow:</p>\n\n<p>Do you want money?  Who’s got it?</p>\n\n<p>1. Set a target\n<br />2. Pursue the target with a military effort\n<br />3. Shut the deal down</p>\n\n<p>Never be average—get great.  If you need skills get on Cardone University today.  To earn cash you either need knowledge that others need or you need to know how to go out and get money.  It’s best to have both.  Also the wait times at the VA are ridiculous, are veterans have to wait 112 days on average to get a simple appointment and some of them are dying before they can get in.  If a place isn’t in a hurry to serve it means either they don’t care or they aren’t being held accountable—or both.  Fire Robert McDonald head of the VA—sign the petition and share: https://www.change.org/p/barack-obama-fire-secretary-of-va-robert-a-mcdonald-immediately</p>", "duration": "46:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_126_Whos_Got_My_Money_2016.05.26.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1463673600, "title": "125: How to Be ON 24/7", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone and Jarrod Glandt tell you how to be ON 24/7. Grant is lit up—how can you get up? You need to stay on or be gone. You are not a candle. If you are burned out it’s probably because you lack purpose. Get on purpose and don’t worry about burn out. Bone up!</p>\n\n<p>#1 You have to be committed. Everything you do in life starts with commitment.</p>\n\n<p>#2 Social has to be a part of you. Social media doesn’t sleep. 9 to 5 Monday – Friday is middle class math. If you can’t be on you need to hire someone to be on for you. How many different ways can you talk to people? You Tube. Snap Chat, Facebook, a phone, email, Twitter—get on them all.</p>\n\n<p>#3 Get around people that inspire you. Avoid those that bring you down.</p>\n\n<p>In addition to Grant and Jarrod taking calls, the legendary Frank Kern is in studio and gives real estate advice.</p>", "duration": "49:24", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_125_How_to_be_ON_24-7_2016.05.19.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1463068800, "title": "124: Facts About Millionaires", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "47:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_124_Facts_About_Millionaires_2016.05.12.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1462464000, "title": "123: Get Ruthless or Run Over", "author": "", "summary": "On this episode of Young Hustlers Grant Cardone and Jarrod Glandt talk about the fact of life that you must get ruthless or get run over. Ruthless is having or showing no pity for others. Do I need pity? If something bad happens to Grant don’t show him pity. Why would you need to give others pity? You need to get pity-less. But you need to be 100X ruthless on yourself before being 10X ruthless on the world. Don’t ax someone right away. Handle them first. If I won’t tell a friend the truth, it’s because I haven’t handled me. People say it will hurt their feelings. Bone up—stand up to the people around you. Ruthless is aggressive. You’ve been socialized not to be. They tell you to sit at your school, you can’t be loud or noisy. You are a maniac but people try and tell you that you don’t have the permission to be who you are. The reason Donald Trump wiped out 16 other guys is because he is ruthless. Everyone takes advantage of people who aren’t ruthless. Make a list of things you can tolerate or not tolerate. Find out who is on your side. Who do you need to confront? You must communicate! Don’t put up with those who stand against you and tear you down.", "duration": "39:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_123_Get_Ruthless_or_Get_Run_Over_2016.05.06.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1461859200, "title": "122: The Watertight Pitch", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "46:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_122_The_Watertight_Pitch_2016.04.28.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1461254400, "title": "121: How I Deal With Depression", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone talks about how he deals with depression.  Do you operate in spikes?  Grant surged with highs and lows, ups and downs, and would act crazy for a little while and then have the bottom fall out.  It wasn’t OCC or ADD or whatever 1000 other mental disorders doctors claim are out there.  If you have depression you can’t drink it or sex it away.  Here’s the real deal—if you’re losing you’re going to be depressed.  If you’re bored you’re going to be depressed.  Depression is a normal response to failing.  If you knew you could run 60 mph but only run 10 mph, how do you make sense of that?  The doctors don’t tell you this, but it’s not depression you are suffering from—it’s mediocrity, it’s living below your potential.  You are on planet earth, depression will happen.  You’re depressed because you are operating at an altitude below your capacity.</p>\n\n<p>You need skills.  You don’t need sympathy, use your failure as motivation to surge.  If you have no net-worth it’s because you have no self-worth.  Invest in yourself and get on Cardone U. Don’t have white space on your calendar.  Get rid of your boredom and depression and get a full calendar.   To deal with depression, start hustling, skill up, get busy, and get winning.</p>", "duration": "49:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_121_How_I_Deal_With_Depression_2016.04.21.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1460649600, "title": "120: Young Money", "author": "", "summary": "<p>Today on Young Hustlers Grant Cardone talks about money mistakes and how to avoid them so you can get rich.  If you think you can’t get rich you’re right.  If you think you can get rich you’re right.  Grant confesses that he is greedy and selfish, but who isn’t?  If you are living paycheck to paycheck you aren’t going to change the world.  Get selfish and start making money!</p>\n\n<p>Mistakes to Avoid:</p>\n\n<p>#1 Not focusing on it—“I’m gonna help everyone” look you can’t even help yourself.  How can you help others if you can’t help yourself?   You get what you focus on.  </p>\n\n<p>#2 Blowing money when you get it—For some it doesn’t matter how much they earn they’ll spend it all.  People think they have to reward themselves. No you don’t.  Put it aside.  Be broke again.  You don’t need to try and be a baller when you are in reality a pretender.  </p>\n\n<p>#3Learn the sales game—Learn to pitch a simple glass of water.  How do you add value, how do you get attention?  Ability + skills = bank account.  Grind and hustle is not enough.  </p>\n\n<p>#4 Getting satisfied—If you get satisfied the market place will discipline you.   Pay the price today so you can pay any price tomorrow.  </p>\n\n<p>#5 Investing too soon—Wait until you have something big and go all in.  </p>\n\n<p>Can you sell a glass of water? Win $1000 and head over to www.grantcardonetv.com/perfectpitch</p>\n\n<p>Also Get your free sticker here: www.grantcardone.com/sticker</p>", "duration": "43:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_120_Young_Money_2016.04.14.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1460044800, "title": "119: Why You Are Missing Quota", "author": "", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "31:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_119_Why_You_Miss_Quota_2016.04.07.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1459440000, "title": "118: Customer Service", "author": "", "summary": "<p>On this edition of Young Hustlers Grant Cardone and Jarrod Glandt come to you from Las Vegas talking about customer service.    How do you increase customer satisfaction and customers?</p>\n\n<p>The problem with Las Vegas is that they don’t do customer service right.   They don’t treat Grant like he is a whale, even though he could be.  They treat people like whatever player they are in the moment.  Grant underplays and makes small bets even though he can make big bets.  The casinos treat him as he plays, not to what he can potentially play.  </p>\n\n<p>How are you treating your customer?  Leave everyone today with an experience they’ll tell someone about.  Whether your product is $2, $20, or $2 million you need to wow them.   The big takeaway is that the biggest companies don’t satisfy customers first, they acquire them!</p>", "duration": "31:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_118_Customer_Service.2016.03.31.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1458835200, "title": "117: Your Network is Your Net Worth", "author": "", "summary": "<p>In this edition of Young Hustlers Grant Cardone and Jarrod Glandt talk about your network.\n<br />A network is defined as a group or system of interconnected people or things. Everyone has a network because we are all connected to others on the same planet. Some have larger networks than others, but nobody is on an island alone. Even hermits have to know a few people. What is your network?</p>\n\n<p>• Immediate Family\n<br />• Friends\n<br />• Extended Family\n<br />• Co-Workers\n<br />• Social Media connections\n<br />• What you are reading\n<br />• What you are listening to</p>\n\n<p>Grant doesn’t go to 'work'. He goes to his netWORK to get his Net Worth. It’s not just about the hustle. You have to have a strategy, a target to your hustle. If your net worth isn’t growing it’s because your network isn’t growing. Your mommy keeps saying she loves you the way you are. But you don’t like where you are. You must add to you self worth in order to add to your net worth.\n<br />Analyze who your network is: Who do you need to add and who needs to remove? Make a list. Who you spend your time with on social media is a part of your network. You need to seek out the people you want to connect with. You can connect with Grant and Jarrod by listening to the podcasts, watching Periscopes, following me on Facebook and more. You don’t have to know someone personally to get in their network.</p>", "duration": "38:47", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_117_Your_Network_is_Your_Net_Worth_2016.03.24.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1458230441, "title": "116: Test Your Pitch", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "35:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_116_Test_Your_Pitch_2016.03.17.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1457629258, "title": "115: How to Get Your Head Right", "author": "Grant Cardone", "summary": "<p>Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.</p>\n\n<p>This week on Young Hustlers Jarrod Glandt talks about getting your head right. How do you get your head right? Four tips:</p>\n\n1. Prepare to bust your ass – Wealth creation will be tougher than you think. In a 100-yard dash, people go all out but let up at the end. The thing is we aren’t in a short dash, life is a marathon.  You have to go all in and you can’t let up. Be prepared for war for the long haul. Understand how hard it will be.\n<br /> \n<p>2. Be Willing to fail—Things won’t always work out. Be prepared to fail if you want to find the right thing. Make the phone call, visit the office and take a shot. Don’t play for the same piece of pie as everyone else is. Get over the rejection thing. Failure can be a good education as long as you learn from it. No decision you make locks you in forever. Take a swing. </p>\n\n<p>3. Find the right vehicle—If you are looking to do something big you’ve got to be in the right vehicle.  Know why you are going where you are going. What is your plan? There are two questions you should ask before you work at someplace: 1) How much money will I make?  2) what am I going to learn?  Get clear on what are you are doing.  You better be learning if you aren’t making money, and if you aren’t learning you better be making money.  Really you should have both. </p>\n\n<p>4. Skill up at all costs— Educate yourself. Go find YouTube videos, read blogs, books, and learn every day. If you already graduated, now it’s time to really learn something. What’s relevant today won’t be in 20 years. If you stopped learning in the year 2006 you’d be obsolete today. Take two extra hours every day to keep learning new things.  </p>\n\n<p>You’ve been served the message go to college and you’ll get a job paying 60 or 70k. It’s a lie. 50% of 25 year-olds are still living with mom and dads. You have to take the above 4 tips and never assume anyone will give you anything.  </p>\n\n<p>Get your Young Hustler hats!  www.grantcardone.com/yh</p>", "duration": "41:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_115_How_to_Get_Your_Head_Right_2016.03.10.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1457024422, "title": "114: How to Become a Millionaire by 30", "author": "Grant Cardone", "summary": "<p>[Previously Aired on May 29, 2014]  In this episode, Grant and Jarrod talk about how millennials must focus on earning more and building their incomes incrementally with a strong “Follow The Money” message. Money must NOT be a taboo topic. Millennials must place an importance on money and understand that they can have more money. It is possible. Grant banked 1 million dollars in 9 years by the time he was 30. He explains he built it incrementally and went from 3k to 4k then increased over and over again. Grant and Jarrod share their own personal stories about how they build income by applying 3 critical steps:</p>\n\n<p>1. Follow the Money: get around players who are in businesses experiencing rapid growth. If you are in an organization figure out where the money is. What departments are bringing in money? How can you get involved? Make yourself a valuable resource.\n<br />2. Don’t Show Off, Show Up: Focus on effort and productivity not cars and bottles in the VIP, watches and clothes. The biggest money makers know showing off is expensive and cuts into the bigger bottom line, wealth and true freedom.\n<br />3. The Only Reason to Save is to Invest.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "42:55", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "millionaire by 30", "follow the money", "earn more money", "Jarrod Glandt", "Warren Buffett", "millionaire secrets", "earning millions", "how to make millions", "how to build wealth", "wealth"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1456419659, "title": "113: Omnipresence", "author": "Grant Cardone", "summary": "<p>In this episode of Young Hustlers Grant Cardone and Jarrod Glandt talk about omnipresence. How do you get omnipresent?  How do you be everywhere at the same time, going wide and getting more people to know about you?  You need to commit.</p>\n\n<p>There is a lot of noise out there.  Follow Grant and Jarrod’s 3 tips:</p>\n\n<p>1.What do you want to be known for?  What is your brand?  Who are you?  Find your assets.   Don’t be jack-of-all-trades guy.  Identify your assets.  </p>\n\n<p>2.What are your outlets for distribution?  What are your channels to flow out?  You need lines to distribute your message.  Content is not king, if you have content it sits in your closet.  Push on social media, make your own platform because content needs outlets.</p>\n\n<p>3.Who do you want to know you? There are people you want to do business with now.  You have to pay bills.  Second group is everyone else.</p>\n\n<p>To be everywhere you need energy—who will be tweeting, doing facebook posts, write articles, talk on anchor, and do snapchat? Can you be in 50 places in one day as a soloproneur?</p>\n\n<p>Be sure to check out Young Hustlers every Thursday at noon EST for great content to blow you up and figure out how to get ahead of the game!</p>", "duration": "43:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_113_Omnipresence_2016.02.25.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1455814811, "title": "112: Success Tips for Young Huslters", "author": "Grant Cardone", "summary": "<p>Jarrod Glandt gives tips today for Young Hustlers. When you talk success tips you can find a list a mile long. These are just a few of Jarrod’s favorites:</p>\n\n<p>1. You are never too young (or old) to start.\n<br />2. Be consistent.\n<br />3. Learn to make cold calls, which allows you to create something from nothing.\n<br />4. Find a mentor.\n<br />5. Staying on the cutting edge of technologies.\n<br />6. Be curious.\n<br />7. Start Building a brand online\n<br />8. Invest in yourself.</p>", "duration": "28:31", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_112_Tips_for_Young_Hustlers_2016.02.18.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1455210015, "title": "111: Million Dollar Follow-Up", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "41:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_111_Million_Dollar_Follow_Up_2016.02.11.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1454605251, "title": "110: Take the Chill Out of the Cold Call", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "31:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_110_Take_the_Chill_Out_of_the_Cold_Call_2016.02.04.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1454002973, "title": "109: When to Walk Away From a Deal", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "44:30", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_109_When_to_Walk_Away_From_a_Deal_2016.01.28.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1452790808, "title": "108: Perfect Your Pitch", "author": "Grant Cardone", "summary": "<p>Most people are horrible at a quick pitch. If you don't believe me, ask someone you know to pitch you. Give them 20 seconds and see what they have to say. Oh, by the way, twenty seconds is how much time you actually have in a real pitch before you lose your chance.</p>\n\n<p>Here are five questions to ask yourself to help you create your perfect pitch:</p>\n\n<p>What is the one thing you want the prospect to remember about you? Do not try to be all things to all people. You are trying to get the pitch to stick not make a sale.</p>\n\n<p>What is your big claim of your product or service? Do not talk about your products, create a big claim for your product or service. “My product is sales training, we help companies increase sales 40% in thirty days.”</p>\n\n<p>What is your competitive advantage — what do you do better than anyone else that if you said it everyone would want it? Find that stand out thing that you do better than the rest of the world. This is called the sticky.</p>\n\n<p>Who are the decision makers and influencers of your offer?  Who is it you would need to get in front of to demonstrate and validate your offer. You need to know the types of people that influence or decide on your offer. Depending on how complex a sale you are involved with or how large a company, there could be many influencers involved. “If I could do for you 1/2 of what I have claimed are you the decision maker at your company. And who else would need to be involved?” </p>\n\n<p>How many different pitches do you need? I own five companies and there is no way I can pitch them all in 20 seconds. So I have to create a pitch for each and know who the market is. Before I move into a pitch I would need to know which pitch to drop.</p>\n\n<p>The pitch is not selling, the pitch is about getting attention and keeping your pipeline full. The prospect has a lot going on and is short on time. Don’t sell, pitch, clarify your goal before you start and know something about the target to pick your pitch, ask for the prospects full attention, make it sticky and determine the decision makers and influencers—then get it right.</p>", "duration": "44:20", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_108_Perfect_Your_Pitch_2016.01.14.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1452186039, "title": "107: How to Dominate 2016", "author": "Grant Cardone", "summary": "On this episode of Young Hustlers on Grant Cardone TV, Jarrod Glandt wants to make sure people haven’t already lost track of their targets and goals for 2016. This time of year everyone is focused on changes to be more successful but the key is to remain focused throughout the entire year. If you have the ability to produce, then you have the ability to create freedom for yourself. Everyone can dominate in 2016 if they focus on money and hustling. The only people that condemn the hustle are the people that have given up on the hustle themselves.", "duration": "", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_107_How_to_Dominate_2016.01.07.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1451581207, "title": "106: Tips from Top Producers", "author": "Grant Cardone", "summary": "<p>On the last episode of 2015, two young hustlers from Cardone Enterprises, Jarrod Glandt and Jordan Stupar, discuss their top tips. Tune-in to hear Jordan’s story about starting from being broke and heading to Miami to compete in Grant’s reality show Whatever it Takes to being one of the top producers. Jordan skilled up and took massive action and has been able to reap the benefits of his hustle.</p>\n\n<p>Here are the top tips from a top producer to anyone who wants more:\n<br />1. Duplicate\n<br />2. Learn\n<br />3. Grind/Push/Hustle\n<br />4. Go all in\n<br />5. Massive goals</p>\n\n<p>These are tips straight from the top from a young hustler who executed the Cardone plan. Watch this episode to hear more about Jordan’s journey from the bottom to the top.</p>", "duration": "37:19", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_106_Top_Tips_From_Top_Producers_2015.12.31.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1450890013, "title": "105: Million Dollar Tips", "author": "Grant Cardone", "summary": "<p>On this episode, Grant Cardone and Jarrod Glandt reveal their ultimate Million Dollar Tips for all entrepreneurs, go-getters, salespeople and hustlers who want more and set goals so high that their problems are pale in comparison.  </p>\n\n<p>2015 was a record-breaking year and the most successful at Cardone Enterprises, which means both Grant and Jarrod have gained important take-aways that come with much success.  </p>\n\n<p>Listen to their Million Dollar tips and no-nonsense lessons they learned in business this year.  For example, Grant gained insight into the power of marketing.  Jarrod learned how to lose deals this year.   Tune-in and hear what they have to say about these two take-aways and what their million dollar tips are for:\n<br />-Perfecting your elevator pitch\n<br />-Following-up\n<br />-Getting attention\n<br />-Closing deals  \n<br />-Thinking bigger\n<br />and much more.</p>", "duration": "41:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_105_Million_Dollar_Tips_2015.12.23.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1450371612, "title": "104: Tired of Missing Sales?", "author": "Grant Cardone", "summary": "<p>It is estimated that 92% of all customer interactions happen over the phone. Furthermore, it takes an average of 8 cold call attempts to reach a prospect. In this episode, Grant Cardone and Jarrod Glandt discuss the reality and frustration of missing sales.</p>\n\n<p>Selling is not easy, and it takes the right training and experience to perfect this skill-set. Shockingly, Grant Cardone makes a statement about the many who miss sales that surprises even his staff: “It’s not your fault.” Yes, he said it because he understands that most people don’t have the proper tools to sell and he admits that at one point in his life he didn’t know how to sell.</p>\n\n<p>Grant and Jarrod discuss these three reasons why you are missing sales:\n<br />1. Outdated process\n<br />2. Not properly motivated\n<br />3. Lack of proper follow-up</p>\n\n<p>Grant is always reworking his sales processes and updating and adding new content to his #1 online sales platform—Cardone University.</p>\n\n<p>Right now, Grant Cardone is giving you a special holiday gift for Cardone University and his new Cold Cold program priced at $1,500. To purchase these two it would normally be $13, 2000. Today it is on sale for $995. That’s 93% off. This is only for a limited time.</p>\n\n<p>Invest in yourself today: http://cardoneuniversity.com/holiday/</p>\n\n<p>Also check out our ridiculous holiday sale: http://www.grantcardone.com/holiday/\n<br />We are practically giving away stuff to help make you successful. No excuses.</p>", "duration": "43:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_104_Tired_of_Missing_Sales_2015.12.17.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1449766818, "title": "103: Control Your Pitch", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "41:08", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_103_Control_Your_Pitch_2015.12.10.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1449162000, "title": "102: How to Achieve Financial Freedom", "author": "Grant Cardone", "summary": "<p>Four Things to Create Freedom:\n<br />1. Make the decision to get wealthy\n<br />2. Set targets and create a plan\n<br />3. Become a professional\n<br />4. Become relentless</p>\n\n<p>Todays guest, Lee Haight (@hailmagnate), had his life changed by The 10X Rule. He had the hunger of a salesman since he was a kid, but after reading The 10X Rule his life was launched into true freedom—true success.</p>\n\n<p>Watch or listen to the full episode to hear the discussion between Jarrod and Lee, plus all of the wisdom on how to create true freedom.</p>", "duration": "29:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_102_How_to_Achieve_Financial_Freedom_2015.12.03.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1447952437, "title": "101: Hustling 101", "author": "Grant Cardone", "summary": "<p>For the 101st episode, Jarrod talks about Hustling 101 and discusses his three fundamentals to hustling:\n<br />1.        Success is hard\n<br />2.       Find the right vehicle to pour your horsepower in to.  \n<br />3.       Develop skills that you can use\n<br /> \n<br />Creating a life that you always dreamed of could be the hardest thing you ever do, but achieving your goal and doing so earlier in life is worth the extra hustle.   </p>\n\n<p>Jarrod also shares his list of practices he ALWAYS exercises that keep his head in the game: \n<br />1.       Show-up early\n<br />2.       Stay late\n<br />3.       Agree with customer\n<br />4.       Go for production over perfection \n<br />5.       Learn and grow\n<br />6.       Stay focused on goals\n<br />7.       Use two forms of communication \n<br />8.       Have a great attitude\n<br />9.       Surround yourself with people who keep you up \n<br />10.      Be will to do what it takes to be the best</p>", "duration": "40:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_101_Hustling_101_2015.11.19.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1447347605, "title": "100: The 100th Episode with Special Guest Lewis Howes", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt bring you the tools you need to succeed in the 21st Century. Plenty of you want true freedom, prefer entrepreneurship to 9-to-5 and are hungry for a mentor who gives you the raw and real deal. Grant doesn’t care what your age is, he knows you’re a Young Hustler. Every Thursday at 12 PM Grant and Jarrod bring you sales, business and success tips and insights to succeed in any economic climate.", "duration": "42:53", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_100_The_100th_Episode_2015.11.12.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1446742837, "title": "099: How to Build Discipline", "author": "Grant Cardone", "summary": "<p>On today’s episode, Jarrod Glandt discusses the importance of building discipline. Synonymous with restraint and self-control, discipline is a must for any young hustler. What things do we need to be disciplined about? Jarrod mentions how we make decisions every day about the following aspects of our lives that require discipline: </p>\n\n<p>1.  Attitude\n<br />2.       Diet/Exercise\n<br />3.       Friends\n<br />4.       Choices\n<br />5.       Actions \n<br />6.       Personal Development\n<br />7.       Thoughts/Words\n<br />8.       Dress/Attire </p>\n\n<p>In addition, he suggests three ways to build more discipline: \n<br />1.       Be Aware\n<br />2.       Be Consistent\n<br />3.       Be Relentless</p>", "duration": "27:14", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_099_How_to_Build_Discipline_2015.11.15.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1446134412, "title": "098: How to Avoid Being Broke", "author": "Grant Cardone", "summary": "<p>In today’s episode of “Young Hustlers” Jarrod Glandt discusses how people can avoid being broke, why they may be broke and how to end the cycle. Following the GOP debate, Jarrod points out that regardless of who is elected, it’s important for people to make their own economy and income. He reminds us that only we are in charge of our own lives, so forget about excuses and get out there and create opportunities, wealth, happiness and everything you possibly can. Time is money and just working hard isn’t enough anymore.</p>\n\n<p>Watch Jarrod discuss his three tips avoid being broke:\n<br />1. Budget your time\n<br />2. Develop yourself\n<br />3. Surround yourself with people you can learn from</p>", "duration": "29:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_098_How_To_Avoid_Being_Broke_2015.10.29.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1445529643, "title": "097: How to Improve Your Pitch - Part 2", "author": "Grant Cardone", "summary": "<p>In today’s episode of “Young Hustlers” Jarrod talks about the most important technique in sales and business—the pitch. There is an art to the ultra-important pitch and through years of personal experience, training a team of professionals and closing mega deals, Jarrod discusses these three tips to improve your pitch and message: </p>\n\n<p>1. Keep it concise \n<br />2. Clearly communicate offer\n<br />3. Be prepared to handle objections </p>\n\n<p>Also, Jarrod takes calls from viewers who want his personal help with their own pitches. Watch him upgrade these pitches from average to amazing.</p>", "duration": "40:54", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_097_How_To_Improve_Your_Pitch_Pt2_2015.10.22.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1444924831, "title": "096: How to Get Out of Debt", "author": "Grant Cardone", "summary": "<p>In today’s episode of “Young Hustlers” Grant Cardone and Jarrod Glandt discuss a new Bank of America/USA TODAY survey that reveals how Millenials are eager to get out of debt. According to the results, 65% report anxiety about money and note that it effects their emotional well–being.  While debt may be a taboo topic for many, Grant reveals just how much debt he currently has and why he isn’t concerned about it.  </p>\n\n<p>According to these hustlers, it’s a simple fix—in order to get out of debt, you need to increase your income and not get bogged down by it. Income solves all. </p>\n\n<p>This episode discusses these simple tips to get yourself in a better financial space and reduce your debt:</p>\n\n<p>1) Make a conscious decision to INCREASE income\n<br />2) Promote and sell yourself (in that order) \n<br />3) Reinvest the money </p>\n\n<p>Also, Grant mentioned during the show a new value package called \"How to Make Millions in Business. This bundle includes Grant’s new e-book, never-before seen videos, books and access to Grant and Fran Tarkenton’s webinar (plus much more). There is brand new content being released exclusively through this promotion.   </p>\n\n<p>Go to: http://makemillionsinbusiness.com/</p>", "duration": "49:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_096_How_to_Get_Out_of_Debt_2015.10.15.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1444320054, "title": "095: The Biggest Mistake You Can Make", "author": "Grant Cardone", "summary": "<p>In this timely episode of Power Players, Jarrod discusses what the biggest mistake is that all people make each and every day:  Wasting Time.</p>\n\n<p>There is no doubt that old famous cliché is completely true:  Time IS Money.  So why do we waste it?</p>\n\n<p>In order to make your days productive and successful, it’s essential to get to where you are going in the shortest time possible and make the most of every minute.</p>\n\n<p>In order to save time and ultimately money, follow these tips:</p>\n\n<p>Take finances seriously –even at a young age\n<br />Learn how to produce income\n<br />Focus your energy and effort on things that move you forward.\n<br />Jarrod offers insight into his personal world and how he advanced his career by utilizing his time properly.   He also talks to viewers about mistakes they make with their time.</p>\n\n<p>We want to hear from you!  How do you successfully manage your time?</p>\n\n<p>Also, Jarrod mentioned the following on the show and we have received tons of inquiries.  Here are the links:</p>\n\n<p>Master the Cold Call Video Training Course</p>\n\n<p>Pre-Order Special</p>\n\n<p>Limited time offer ONLY $600. Will retail for $1900.</p>\n\n<p>As a salesperson you know the cold call is necessary and unavoidable. If you want to grow in business—getting more clients and more closes—you will have to get to the right person, get their attention, and then convince them to take action.</p>\n\n<p>http://www.grantcardone.com/product/coldcall/</p>\n\n<p>Kick Start Your Small Business Interactive Webinar with Grant Cardone and Fran Tarkenton</p>\n\n<p>If you are thinking about starting a business, just started a new business, or want to grow your business.....Don't miss this LIVE Video Webcast where two completely self made legends show YOU how to take your small business from survive to thrive!</p>\n\n<p>Grant Cardone, New York Times bestselling author and the world’s leading international sales trainer will show you how to work to prosper, never make excuses, be open to failing and concentrate on massive goals every single day.</p>\n\n<p>Fran Tarkenton, an NFL Hall of Fame Quarterback with over 50 years of business experience and 20 successful companies under his belt, will be covering his building blocks for entrepreneurial success, shows you how culture trumps everything, and how to maximize The Power of Failure.</p>\n\n<p>Click here to reserve your spot:</p>\n\n<p>http://kickstartyoursmallbusiness.com/</p>", "duration": "29:10", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_095_The_Biggest_Mistake_You_Can_Make_2015.10.08.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1443715221, "title": "094: Improve Your Pitch", "author": "Grant Cardone", "summary": "<p>A strong thirty-second pitch is invaluable in business and having the most effective, clear and communicative points can make or break your career. The most seasoned sales professionals are always re-strategizing their pitches to see what is most effective.</p>\n\n<p>In this episode of Young Hustlers, Jarrod Glandt tackles the important task of perfecting the pitch and works with live guests to craft their best selling points up-front.</p>\n\n<p>Here are the three things Jarrod and his team do on every call that have dramatically increased the confidence of our sales team and ultimately our conversion rates.</p>\n\n<p>3 Ways to Improve Your Pitch:\n<br />1.) Trial close frequently\n<br />2.) Ask the Hard Questions\n<br />3.) Drop the Price Up-Front</p>", "duration": "38:49", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_094_How_To_Improve_Your_Pitch_2015.10.01.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1443110434, "title": "093: Success Hacks", "author": "Grant Cardone", "summary": "<p>Today Grant and Jarrod are talking Success Hacks.</p>\n\n<p>Grant asks, “Do you even want to be successful? Do you want to hack the system? Do you want to know the shortcuts?”</p>\n\n<p>Have you ever wondered: How do you get hired immediately? How do you get viewed with intensity and urgency? How do you get bonuses as fast as possible?</p>\n\n<p>3 Hacks That Will Accelerate Your Success:\n<br />1. The Secret Weapon of the Weekend\n<br />2. Connect with Power\n<br />3. Commit to Greatness; Be Great</p>\n\n<p>Success leaves clues; you just have to know how to find the gold.</p>\n\n<p>Find @CalebMaddix on Twitter.</p>", "duration": "51:52", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_093_Success_Hacks_2015.09.24.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1442505602, "title": "092: Top Traits for Career Success", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>Let’s collaborate. Let’s get some of the best tips you know, the best tips you’ve heard, and let’s share them with everyone.</p>\n\n<p>Maybe you’ve experienced good results in your career, but knew you weren’t conscious of all of the things that would bring about that success at the time. Whenever I was around Grant I was a sponge and then when I wasn’t at the office I was on the Internet trying to find any little gem I could.</p>\n\n<p>11 Top Traits of the Successful:</p>\n\n<p>Never think in terms of a sale, think in terms of building a business.\n<br />Listen more than you speak.\n<br />Invest in things that increase your income and avoid things that give zero return.\n<br />Never give up on unsold work opportunities. Follow up is gold.\n<br />Invest in education, training and development. – SecretsToClosingTheSale.com\n<br />Hold yourself to a higher standard than anyone else.\n<br />Don’t stay busy stay productive.\n<br />Be willing to show up early and stay late.\n<br />Understand that logic is a dream killer. Be irrational.\n<br />View failure not as a setback but as an investment.\n<br />Take responsibility for all results.\n<br />… Watch the show to hear this bonus tip!</p>\n\n<p>Listen to the full episode to hear all of Jarrod’s insights on each of these 11 traits that will make you become more successful than you could ever dream.</p>", "duration": "35:24", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_092_Top_Traits_for_Career_Success_2015.09.17.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1441900850, "title": "091: How to Use Technology to 10X Your Business", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>The purpose of this episode is to learn about technology that allows you to go further, get to more people and build a financial reality that you’ve only dreamt of.</p>\n\n<p>The tech space changes tremendously quickly, that’s why today we’re reviewing an article by Ken Krogue; on Forbes he wrote a Latest Research article.</p>\n\n<p>15 Hottest Sales Acceleration Technologies by Ken Krogue:</p>\n\n<p>Contract Technology\n<br />Data Visualization\n<br />Business Intelligence\n<br />Gamification\n<br />Presentation Technology, including Slide and Screen Share\n<br />Predictive Analytic Tools and Technology\n<br />Sales Intelligence Tools\n<br />Email (designed specifically for the sales function)\n<br />Fax\n<br />Sales Communication tools\n<br />Chat\n<br />Texting\n<br />Video technology\n<br />Voice technology\n<br />Social selling technology\n<br />You Need to Be Aware of These In Your Business:\n<br />1. Investing in technology; learning what’s out there\n<br />2. Commit to mastering one before you add another\n<br />3. At the end of the day PEOPLE are the ones that make transactions</p>\n\n<p>Travis Truett started a company called Ambition. They literally took the Fantasy Football model and applied it to performance management, analytics, and making the workplace more fun. “Life is too short for work to suck.” – Travis Truett</p>\n\n<p>Watch the full episode to find out all about Travis Truett and his company that will revolutionize the way you work!</p>", "duration": "31:18", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_091_How_to_Use_Technology_to_10X_Your_Business_2015.09.10.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1441296025, "title": "090: Secrets to Being a Baller", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>The term “baller” is automatically associated with money. But to Jarrod a baller is someone with money and business so big no one can touch it. Having big money, big faith, big health… all of these things make a baller.</p>\n\n<p>Think about all of the people who have everything going for them; actors, doctors, lawyers, etc—you don’t see all the work it took them to get there. You want the sexy thing, but you aren’t willing to do the sexy things to get there.</p>\n\n<p>3 Tips to Becoming a Baller\n<br />1. There’s no such thing as an overnight baller\n<br />2. Your work ethic should make you puke\n<br />3. All ballers have one thing in common: they’re closers</p>\n\n<p>When the game is on the line, you pass to the baller—because they can close, finish, make the goal on any challenge they face.</p>\n\n<p>• Follow Dre Baldwin @DreAllDay\n<br />• Watch Dre Baldwin on YouTube</p>\n\n<p>He converted his first video from VHS to digital and put it up on this new website called YouTube. For six years he has posted a new video every single day, he has over 4,000 videos available!</p>\n\n<p>Watch the full episode to hear the discussion between Jarrod and Dre! You can also listen to it on podcast in the links below.</p>", "duration": "32:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_090_Secrets_to_Being_a_Baller_2015.09.03.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1440691212, "title": "089: Secrets to Closing the Sale", "author": "Grant Cardone", "summary": "<p>Grant Cardone and Jarrod Glandt go over the massive topic of closing the sale. You can pitch your product, advertise and spend money on marketing, but there comes a point when the close has to happen. If it doesn’t, the deal isn’t done.</p>\n\n<p>Grant personally delivered over 4.5-hours of content on this important topic in a webinar that you can OWN FOREVER. Watch it again and again to get every bit of information from it!</p>\n\n<p>Sign up NOW at http://secretstoclosingthesale.com/</p>\n\n<p>Jarrod and Grant address bad advice from other sources, such as:\n<br />• Trying to close the wrong person\n<br />• Closing too soon\n<br />• Don’t twist their arm\n<br />• Waiting too long to close</p>\n\n<p>These are ALL WRONG. Don’t ignore your lines of communication. If you do, you’re abandoning your dreams. Don’t abandon your kids, your parents, your spouse, none of it. Close as soon as you meet the customer, close before you leave. But make sure to know when you need to sell, when you need to listen, and precisely when you need to go for the close.</p>\n\n<p>Grant shares a personal story where he got loose, messed up, and lost a $400k deal just because of a very basic mistake. He reminds you to stay on top of your game.</p>\n\n<p>Secrets to Closing the Sale, sign up now! http://secretstoclosingthesale.com/</p>", "duration": "53:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_089_Secrets_To_Closing_The_Sale_2015.08.27.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1440086431, "title": "088: Why You Suck at Your Job", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal.\n<br />Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>Find a way to shorten the on-ramp to your dreams.</p>\n\n<p>Today we’re talking about why you suck at your job. Most people think, “I’m okay at my job,” but the reality is you suck at your job and likely fall into one of these categories.</p>\n\n<p>Groups of Workers That Suck at Their Job:\n<br />1. You Suck: You’re underperforming, missing your targets; constantly making excuses, constantly changing jobs\n<br />2. Average Zone: People who are in the middle, average levels of activity\n<br />3. Top Producer: Constantly operating at less than your potential, but higher than those around you, so you get comfortable</p>\n\n<p>The One Group That Doesn’t Suck:\n<br />4. The Unicorns: You have an insatiable appetite for success. You understand your potential and you are in an all out sprint, all the time.</p>\n\n<p>Steve Jobs, Bob Duggan, Grant Cardone… they are unicorns. When these people tell others their dreams, those who hear them think they are crazy. That’s what you want.</p>\n\n<p>Jarrod realizes he is in the “Suck” category because he knows he has a higher potential than what he works to every day. He knows he wants to be on like a light bulb, pushing all the time, and learning everything he can from Grant Cardone.</p>\n\n<p>How do you go from $0.80/share to $80/share?</p>\n\n<p>Bob Duggan says, “You have to work backwards from where you want to be. You have to break everything down into little chunks. And then focus attention and intention into a little chunk.”</p>\n\n<p>When someone asks you what your goals are, you must not hesitate with your answer.</p>\n\n<p>Tips to Not Suck:\n<br />1. Understand that everyone sucks, except the unicorns\n<br />2. Write down your dream income and act like you earn it today\n<br />3. Work like you have your dream job\n<br />4. You have to sit down and have that uncomfortable conversation with yourself</p>", "duration": "31:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_088_Why_You_Suck_at_Your_Job_2015.08.20.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1439481636, "title": "087: Present Price with Confidence", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal.</p>\n\n<p>Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>Today’s show is about handling price with confidence. Even when price isn’t an issue there are companies out there with people on the phone who aren’t properly trained.</p>\n\n<p>Are price objections something that come up a lot for you? What’s the goal of the call? You shouldn’t be handling price. You should be initiating price and controlling the dialogue.</p>\n\n<p>Do you want more money in your life? You’re going to have to confront your boss for a raise or handle the sale of your home. You’re going to have to handle price objections.</p>\n\n<p>Prices are a myth.</p>\n\n<p>Takeaways:\n<br />1. Are you talking to a decision maker?\n<br />2. Are you talking to someone qualified with the money to buy?\n<br />3. Do you have a product that people want and will solve their problems?</p>\n\n<p>Do you want to lower your price or raise your confidence?</p>\n\n<p>Watch the full episode or listen to the podcast to hear the BOMBS Grant and Jarrod are dropping on how to handle price!</p>", "duration": "40:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_087_Present_Price_with_Confidence_2015.08.13.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1439388027, "title": "086: Jarrod Glandt Interviews Jack Murray and Aaron Witnish", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal.</p>\n\n<p>You have to get out there. You have to bash stereotypes.</p>\n\n<p>Today I’m talking with Aaron Witnish and Jack Murray. They are the Aussie Closers.</p>\n\n<p>They train business owners in the premium-based businesses.</p>\n\n<p>Jack talks about getting into the environment and being around the right mentors to get on the fast track to success. Aaron mentions starting out at the same office, having a few beers with Jack and then building a relationship that lead to them starting their own entrepreneurial journey.</p>\n\n<p>Listen to the full episode or the podcast to get their full insights and tips!</p>", "duration": "17:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_086_Jarrod_Glandt_Interviews_Jack_Murray_and_Aaron_Witnish_2015.08.12.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1438876810, "title": "085: How to Not Get Fired", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal.</p>\n\n<p>Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>If you’re relying on yourself, your family is relying on you and you want to make sure you can pay your bills.</p>\n\n<p>Why Employers Fire Millennials:\n<br />1. Employers don’t want to be babysitters\n<br />2. The anti-work attitude is not appreciated\n<br />3. Millennials happiness is not the employer’s responsibility.</p>\n\n<p>Whether you’re a millennial or not, this list is applicable to you.</p>\n\n<p>How to Not Get Fired:\n<br />1. Make it your mission to obliterate stereotypes about Millennials\n<br />2. Be hungry to make a difference in your position\n<br />3. Do the things that others refuse to do</p>\n\n<p>The reality is that it is hard work to get a job. Stereotypes exist but you don’t have to live under them or fulfill them. Do everything you can to prove that those are incorrect—don’t be a victim to them.</p>\n\n<p>Listen to the full episode on podcast or video to hear all of the in-depth tips.</p>", "duration": "28:32", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_085_How_to_Not_Get_Fired_2015.08.06.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1438272047, "title": "084: How to Increase Your Income", "author": "Grant Cardone", "summary": "<p>Every Thursday Grant Cardone and his protege Jarrod Glandt take on Millennials. They have been labeled as lazy, unmotivated, and entitled. We know they are not. Plenty of them want true freedom—financial freedom—and prefer entrepreneurship to the 9-to-5 grind. They are hungry for mentors who give them the real deal.</p>\n\n<p>Are you constantly trapped by the mentality, “money, money, money, success, success, success,” and then everything else around you starts eroding?</p>\n\n<p>Once you start setting big goals you can get blindsided by the average mentality. It’s easy to get overly mechanical and lose site of the goal.</p>\n\n<p>Lies of Society\n<br />1. Don’t stand out\n<br />2. Be seen and not hear\n<br />3. Don’t make me ask you again\n<br />4. You are not special\n<br />5. Seek balance in your life\n<br />6. It’s the journey, not the destination\n<br />7. Big expectations lead to big disappointments\n<br />8. Set reasonable goals\n<br />9. Successful people are unhappy\n<br />10. Be grateful you have more than most</p>\n\n<p>Why is it important to stand out?</p>\n\n<p>How to Create Your Super Life\n<br />1. Professional Career\n<br />2. Family Life\n<br />3. Income\n<br />4. Financial Wealth\n<br />5. Physical Life\n<br />6. Spiritual Life\n<br />7. Recreational Life</p>\n\n<p>You can get the webcast from July 29th at an exclusive Young Hustlers rate. Just enter Promo Code: SUPERLIFE49</p>\n\n<p>Watch or listen to the full show for all of the insights Jarrod shares from last night’s webcast.</p>", "duration": "33:47", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_084_How_to_Increase_Your_Income_2015.07.30.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1437667230, "title": "083: Rags to Riches", "author": "Grant Cardone", "summary": "<p>Originally aired on April 24, 2014</p>\n\n<p>In this weeks episode Jarrod and Grant discuss the ways in which an individuals background does not dictate the amount of wealth and achievement they have in their lives. Regardless of social standing, education, rich family, or poor family, Grant and Jarrod give you the tools to breakout, step into your success and achieve financial freedom.</p>", "duration": "52:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_083_Rags_to_Riches_rerun_2015.07.23.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1437062406, "title": "082: 10X Everything - Part 2", "author": "Grant Cardone", "summary": "There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.", "duration": "37:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_082_10XEveryting_Part2_2015.07.16.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1436457622, "title": "081: 10X Everything - Part 1", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate.</p>\n\n<p>Sometimes it’s crazy, but it’s never lazy.</p>\n\n<p>Are you getting noticed? Do people know you?</p>\n\n<p>“If they don’t know you, they can’t pay you.” – GC</p>\n\n<p>The folks at Meerkat have reached at Grant to pilot their new Cameo feature. It is live for you to test and share your streams, flowing power to your fans and prospects alike.</p>\n\n<p>Grant will be doing a 3-4 hour webcast at the end of the month on how to 10X Your Life. You pay only $49, you get a 4-page exercise that will by itself rock your life, you get the eBook, AND get access to the LIVE event plus 24/7 access after the live show.</p>\n\n<p>The 10X Lifestyle is available to everyone.</p>\n\n<p>How to Get Known, the Right Way\n<br />1. The hustle vs The Up-and-Down\n<br />2. Driven vs the Passenger</p>\n\n<p>THE PAYOFF HAS TO BE MASSIVE.</p>\n\n<p>Mindset, defined as, “the established set of attitudes held by someone about something.”</p>\n\n<p>What’s the difference between someone who is highly successful and someone who just wants it?</p>\n\n<p>“Everybody wants to be the boss, and nobody wants to pay the cost.” – GC</p>\n\n<p>Listen to the full episode and listen to the podcast over and over to get all of the amazing information from these Young Hustlers.</p>", "duration": "47:54", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_081_10XEveryting_Part1_2015.07.09.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1435852803, "title": "080: How to Achieve Freedom", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate.</p>\n\n<p>Freedom to Jarrod Glandt is the ability to produce something. Something that people will actually pay for. What will you take to the marketplace that people will buy? Find that and multiple it.</p>\n\n<p>Four Things to Create Freedom:\n<br />1. Make the decision to get wealthy\n<br />2. Set targets and create a plan\n<br />3. Become a professional\n<br />4. Become relentless</p>\n\n<p>Todays guest, Lee Haight (@hailmagnate), had his life changed by The 10X Rule. He had the hunger of a salesman since he was a kid, but after reading The 10X Rule his life was launched into true freedom—true success.</p>\n\n<p>Watch or listen to the full episode to hear the discussion between Jarrod and Lee, plus all of the wisdom on how to create true freedom.</p>", "duration": "29:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_080_How_to_Achieve_Freedom_2015.07.02.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1435248052, "title": "079: How to Get a Raise", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate.</p>\n\n<p>Some stats on raises in America:\n<br />• 90% of Americans think that they deserve a raise\n<br />• 54% don’t ask for one\n<br />• 32% would rather clean their while house\n<br />• 6% would rather be audited by the IRS</p>\n\n<p>The way to ask for a raise is first you must know you deserve it. Not because you have been there for a long time, not because you do a good job, not because others in your position make more. While these are good reasons when you go saying you deserve something if everyone at your office got a raise because of this the company would be broke. The executive making the decision then thinks about this never ending lineup of people that will want a raise every six to twelve months.</p>\n\n<p>The 4 Steps to Asking for a Raise:\n<br />1. Get your bosses attention.\n<br />2. Clarify at the beginning what the meeting is about.\n<br />3. Make it very clear you’re not looking for a handout.\n<br />4. How could it be possible to reach a specific goal?</p>\n\n<p>The script on How to Get a Raise:\n<br />“I don’t want a handout, nor do I want you to feel like you need to pay me more because I have been here for 2 years, or because I do a good job, or because I never call in sick–those are things you deserve as an employer.</p>\n\n<p>I want to know what can I do to earn another $12,000 a year. This would represent a 24% increase in my pay, from 50k to 62k and make a major difference in how I take care of my family and prepare for my future.</p>\n\n<p>Again I don’t expect you to give it to me, I want to know how I can earn it.</p>\n\n<p>While it represents another $1k a month to your payroll, it’s another $6.25 per hour to me and I assure you I will use it for the good of my family. In fact, I am planning on using this money to start a college fund for my son.</p>\n\n<p>What can I do so you can make sense of this?”</p>\n\n<p>If you do this right you might just get your raise. Be presentable, hold a smile, be confident but not entitled, and learn how to ask and make sense of what you want.</p>\n\n<p>This is why everyone must learn to sell, negotiate and make sense of your proposal and you can improve your condition in life. If you never learn how to do this you will never be paid what you are worth. The facts of economics are most people are underpaid their entire life only because they either don’t offer enough value or don’t get the proper attention of those that.</p>\n\n<p>Don’t Say:\n<br />• Man I’ve been here a long time.\n<br />• I do a good job.\n<br />• I’m never sick.\n<br />• If I can’t do this I’m going to leave.</p>\n\n<p>“No data. No dollas.” – Jarrod Glandt</p>\n\n<p>Watch the full episode or listen to the podcast to hear all of the amazing insights they have to offer about getting a raise at work.</p>", "duration": "28:18", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_079_How_to_get_a_Raise_2015.06.25.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1434643219, "title": "078: Mystery Shopper", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. </p>\n\n<p>This week, and once a month, these Young Hustlers do a Mystery Shopper episode. They call companies and have a report card and give their take on how a company handles incoming phone calls.</p>\n\n<p>Grant is looking for a Public Relations department in Miami. He doesn’t have much luck with his first few attempts. They treated him, the caller, like a nuisance and seem inconvenienced by receiving a phone call.</p>\n\n<p>Steps to a Successful Incoming Call\n<br />1. Build report.\n<br />2. Qualify the caller.\n<br />3. Name and number.\n<br />4. Appointment.</p>\n\n<p>Watch and listen to the full episode to hear all of the tips and hear all of the calls made on this episode of Young Hustlers.</p>", "duration": "36:42", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_078_Mystery_Shopper_2015.06.18.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1434038414, "title": "077: Buying vs Renting for Millennials", "author": "Grant Cardone", "summary": "<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal.</p>\n\n<p>Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>Take the time to do the math. Is it more beneficial to rent or to buy?</p>\n\n<p>You need to listen to the Godfather of Business.</p>\n\n<p>Renting fears:\n<br />• Could be paying down debt\n<br />• Wasting their money\n<br />• No write off</p>\n\n<p>Renting vs Buying Young Hustlers</p>\n\n<p>The home is no longer a primary investment for people. You need to be nimble. You need to be able to go where the opportunities are. We aren’t in a time of picket fences and living in one town your whole life.</p>\n\n<p>The government wants you fixated in a place so they can depend on you.</p>\n\n<p>Listen to the full episode to hear the rest of their awesome tips on renting versus buying.</p>", "duration": "40:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_077_Buying_vs_Renting_2015.06.11.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1433437249, "title": "076: Be the Boss", "author": "Grant Cardone", "summary": "<p>Millennials have been labeled as lazy, unmotivated, and entitled. We know they are not. Plenty of them want true freedom—financial freedom—and prefer entrepreneurship to the 9-to-5 grind. They are hungry for mentors who give them the real deal.</p>\n\n<p>Grant Cardone is the real deal.</p>\n\n<p>Are you the boss?</p>\n\n<p>Steps to Becoming the Boss:\n<br />1. List of where you are the boss already\n<br />2. Start acting like the boss\n<br />3. Make investments</p>\n\n<p>You gotta sign the check to be the boss. You gotta put your money at risk, hire people, baby sit them, hire people to babysit them and be their boss. Otherwise, you ain’t the boss.</p>\n\n<p>• Make the decision\n<br />• Follow through\n<br />• Handle conflict\n<br />• Be unpopular</p>\n\n<p>To take the boss test:\n<br />1. Investments this month\n<br />2. Books read\n<br />3. Who have you helped?\n<br />4. Confronted</p>\n\n<p>Watch the full episode and listen to the podcast to hear all of their advice.</p>", "duration": "50:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_076_Be_the_Boss_2015.06.04.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1432832455, "title": "075: How to Stand Out", "author": "Grant Cardone", "summary": "<p>Grant Cardone and Jarrod Glandt offer Millennials tips for getting attention in business.</p>\n\n<p>Great news! Businesses are hiring. This means you must get attention and set yourself apart in the marketplace. For people with jobs this means you must promote your value within your organization. Grant and Jarrod begin the show explaining how money follows attention and why you must have a ‘whatever it takes’ attitude and do what others refuse to do. Some examples Jarrod shares include arrive early and stay late, think like the owner and bring ideas that meets the business’ objectives and purpose. Specifically Grant offers these 3 Steps to Get Attention</p>\n\n<p>1.   Make yourself known.\n<br />2.        Deliver what is needed.\n<br />3.        Improve yourself every day.</p>\n\n<p>Grant and Jarrod take callers, with questions about standing out despite being young, how to get attention to expand their business and how to advance to the next level.</p>", "duration": "39:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_075_How_to_Stand_Out_2015.05.28.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1432227602, "title": "074: How to Build Your Brand for Success", "author": "Grant Cardone", "summary": "There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.", "duration": "1:00:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_074_How_to_Build_Your_Brand_For_Success_2015.05.21.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1431622809, "title": "073: Multiple Flows of Income", "author": "Grant Cardone", "summary": "<p>On this weeks episode Grant and Jarrod discuss creating multiple flows of income and why it is crucial to never turn your back on the primary flow until the other flows are so strong that nothing can possibly destroy or erode them.</p>\n\n<p>Warning: Even once the other (newer) flows are strong enough I would still suggest you never ignore the primary flow as it made the other flows possible. This mistake is made by almost everyone seeking to create multiple streams of income.</p>", "duration": "34:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_073_Multiple_Flows_of_Income_2015.05.14.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1431018001, "title": "072: How to Be Obsessed and Productive", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled.</p>\n\n<p>Every Thursday, Grant Cardone and Jarrod Glandt attack the issues that face millennial entrepreneurs, businesspeople, Generation Y, 30-somethings, and anyone else who has been told by older generations that they are failures.</p>\n\n<p>Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>• Obsession is defined as, “the domination of ones thoughts or feelings by a persistent idea, image, or desire.”</p>\n\n<p>Are you obsessed?</p>\n\n<p>Grant is going to give you a simple way to turn your obsessions into productivity.</p>\n\n<p>• Make a list with two columns: Obsession & Payoff</p>\n\n<p>How can you focus your obsession? Were your obsessions ever destructive to your life? Learn how to turn them around.</p>\n\n<p>Watch or listen to the full episode to hear the tips while Grant and Jarrod take calls and give priceless advice.</p>\n\n<p>There are 80 million Millennials out there and no, not all are lazy and entitled.</p>\n\n<p>Every Thursday, Grant Cardone and Jarrod Glandt attack the issues that face millennial entrepreneurs, businesspeople, Generation Y, 30-somethings, and anyone else who has been told by older generations that they are failures.</p>\n\n<p>Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.</p>\n\n<p>Obsession is defined as, “the domination of ones thoughts or feelings by a persistent idea, image, or desire.”</p>\n\n<p>Are you obsessed?</p>\n\n<p>Grant is going to give you a simple way to turn your obsessions into productivity.</p>\n\n<p>• Make a list with two columns: Obsession & Payoff</p>\n\n<p>How can you focus your obsession? Were your obsessions ever destructive to your life? Learn how to turn them around.</p>\n\n<p>Watch or listen to the full episode to hear the tips while Grant and Jarrod take calls and give priceless advice.</p>", "duration": "45:26", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_072_How_to_Be_Obsessed_and_Productive.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1430413217, "title": "071: How to Handle Customer Complaints", "author": "Grant Cardone", "summary": "<p>Grant and Jarrod speak to the 80-million millennials who have been told over and over that they are lazy and entitled. Millennials are a driving force in the business world, and they need to know how to get true freedom—financial freedom.</p>\n\n<p>You are going to get haters. If you put yourself out there, people will complain about what you are doing.</p>\n\n<p>Some people are upset about How to Make Millions on the Phone. If you want the 3 hour and 27 minute version with no pitches, no commercials, just go watch the edited version of the webcast.</p>\n\n<p>What happens when you get legitimate complaints?</p>\n\n<p>Grant admits that he was wrong for changing his mind about the criteria to get a flight on his jet and that he got greedy at the end.</p>\n\n<p>He also points out that the eBook provided for the $49 webcast is filled with $1700 of content that his company sells on a daily basis.</p>\n\n<p>People innately want to be liked, Grant included, but you can’t please everyone. The massive number of people who attended is far larger than the number of complaints, but it’s easy to focus on the negative feedback from the customers.</p>\n\n<p>If you’re still trying to be liked by everyone, you’re never going to get to the top of your mountain. When people complain about you, they are saying more about themselves than you. You need to address them, but don’t let it distract you from your goals.</p>", "duration": "43:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_071_How_to_Handle_Customer_Complaints_2015.04.30.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1430240417, "title": "070: Steps to Becoming a Millionaire", "author": "Grant Cardone", "summary": "<p>This is a special edition of Young Hustlers, live on a Tuesday, going out just before How to Make Millions on the Phone, which airs tonight at 5 PM EST.</p>\n\n<p>There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate.</p>\n\n<p>Is making a million dollars even real? If you don’t believe it’ll happen to you—it won’t. Did your parents tell you don’t do drugs, don’t drive drunk, etc?… But did they ever tell you to not be broke?</p>\n\n<p>Every day Jarrod writes down: “I am a multi-millionaire.” If 10-million people gave you $0.10 you would be a millionaire.</p>\n\n<p>7 Steps to Becoming a Millionaire:\n<br />1. Need to a million-dollar decision.\n<br />2. Follow the money.\n<br />3. Keep your eyes on the prize.\n<br />4. You have to do the math. Break it down.\n<br />5. Call 5 people every day that could change your life.\n<br />6. Get support. Surround yourself with like-minded people.\n<br />7. Be great, because nothing else pays… much.</p>", "duration": "38:13", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_070_Steps_to_Become_a_Millionaire_2015.04.28.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1429808429, "title": "069: How to Make a Cold Call", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9-to-5 grind and are hungry for mentors.</p>\n\n<p>Grant Cardone believes in Millennials. This show is for those of you who have not yet condemned the hustle.</p>\n\n<p>Jarrod reminds us that it’s best to learn from people who have lived through the struggle, but you can’t get much from someone that doesn’t grab your attention. How do you stay interesting? How do you set hooks to keep people coming to you or your product?</p>\n\n<p>At Grant’s first job he knocked on doors in El Paso, Albuquerque, San Antonio and Fort Lauderdale. He had been using a phone to setup these appointments and realized flying in, renting a car and going door-to-door was less time effective than simply closing the prospects by phone.</p>\n\n<p>Visiting a prospect costs up to 8X more than closing them over the phone.</p>\n\n<p>“Always leave a voicemail from the phone number you want to be reached at. The voicemail will not be returned, but you must always leave one.” – GC</p>\n\n<p>You can make more money on a telephone than any other way.</p>\n\n<p>Three Tips:\n<br />1. Words matter\n<br />2. Time is going to kill you\n<br />3. Voice, inflection and tone</p>\n\n<p>Cold calls will make or break you in business. If you are going to become a millionaire, guaranteed you will have to use a phone to get there.</p>\n\n<p>Check out Alexa, a Grant-fan: http://www.alexasmakinwaves.com/</p>\n\n<p>“You can’t buy your way to success, you have to work your way there.” – GC</p>\n\n<p>Listen to the full episode to hear the tips on phones, plus direct responses to callers asking Grant and Jarrod for advice.</p>", "duration": "43:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_069_How_to_Make_a_Cold_Call_2015.04.23.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1429203640, "title": "068: How to Make Millions On the Phone", "author": "Grant Cardone", "summary": "There are 80 million millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.", "duration": "1:02:04", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_068_How_to_Make_Money_Over_the_Phone_2015.04.16.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1428598846, "title": "067: How to Buy Time", "author": "Grant Cardone", "summary": "<p>Grant Cardone and Jarrod Glandt tackle the issues for the under 35 crowd with tips and insights they need to help them succeed in any economic climate. With 80 million Millennials out there, all of them aren’t as lazy and entitled as the media makes them out to be. There are plenty who want true freedom, prefer entrepreneurship to the 9-to-5 grind and are hungry for mentors who give them the real deal.</p>\n\n<p>Today they talk about time, and the fact that people blame it instead of taking responsibility. Are you a Young Hustler? Then stop saying, “I don’t have time.” It’s easy to blame something that’s made up. Grant is convinced that time is a made up concept that is loaded into our consciousness.</p>\n\n<p>If you think time is made up, we want to see your comments below.</p>\n\n<p>Tips on Buying Time:\n<br />1. Quit blaming time.\n<br />2. Stop going to places that only yield one thing—Multitask.\n<br />3. Quit doing things that don’t pay you.\n<br />4. Follow the money.\n<br />5. Over commit. Put as much as you can into your schedule.</p>\n\n<p>You need a reason. You need to take the time you have, whether it’s 1 hour, 12 hours, or an entire month.</p>\n\n<p>“When you blame, you become a victim.” – GC</p>\n\n<p>People get conditioned to think of time in simple forms of subtraction and addition. If you hire people to work for you on a project, you effectively multiply your time.</p>\n\n<p>While they are filming the show, they are also recording a podcast and streaming on Periscope—they are multiplying their time. 21- out of 28-million entrepreneurs don’t have employees. They are scared to spend money to multiply their time.</p>\n\n<p>What are you willing to give up? Make a list of things throughout the day, and remove all of the things that aren’t making you money, getting you more exposure, or growing your business.</p>\n\n<p>Hire someone to wash your car, mow your lawn, do your laundry—so you have more time to go out and make money.</p>", "duration": "32:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_067_How_to_Buy_Time_2015.04.09.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1427994039, "title": "066: Why You Hate Your Job", "author": "Grant Cardone", "summary": "<p>[Previously Aired on April 8, 2014] The high cost of job dissatisfaction. A Gallup poll says 52% of full-time workers are disengaged, Costing US companies from $450 billion to $550 billion every year. America, stopped looking to your job for fulfillment and started looking at it as the unpleasant means to an end. 52% of all full-time workers in the U.S. are not involved in their work, not particularly enthusiastic about it and are committed only as much as they have to be. 18% of those folks are “actively disengaged” and have checked out to the point that they’re actually a hindrance to the company.\n<br />TRAGEDY IN AMERICA</p>\n\n<p>This Cost U.S. companies $450 billion to $550 billion every year.</p>\n\n<p>What does it cost you?\n<br />1) Self esteem\n<br />2) Energy\n<br />3) Life satisfaction</p>\n\n<p>How to Find the right job for you:\n<br />What makes you happy?\n<br />What are you meant to do?\n<br />What are you passionate about?\n<br />What is keeping your from being more engaged?\n<br />Who talked you against the job you have?\n<br />How good are you at your job?</p>", "duration": "51:46", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_066_2015.4.02_why_you_hate_your_job.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1427389216, "title": "065: Mystery Shopper", "author": "Grant Cardone", "summary": "<p>There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and Jarrod Glandt share the tips and insights to help you succeed in any economic climate and counteract the negative media environment.</p>\n\n<p>This week Grant and Jarrod address the abysmal situation of people answering the phones at companies and not knowing what to say.</p>\n\n<p>“If you can steal it from him, it’s because he left his door open.” – GC \n<br />How to Handle the Phone:\n<br />1. Opening\n<br />2. Qualify the Customer\n<br />3. Get a Full Name, Phone Number, Write it Down\n<br />4. Sell an Appointment</p>\n\n<p>If you want to be a killer in the marketplace you need to give up $20 to make $200. Stop doing your laundry, washing your car, cleaning your own place—hire someone else to do it so you can go make more money.</p>\n\n<p>Every day you need to look at: How big is the opportunity? Not: What did I get?</p>\n\n<p>You need to practice one thing that you get great at. Don’t get confused listening to or reading many different kinds of tactics—pick one type, stick with it, and ride it to it’s full potential. Focus on getting ONE extra deal a week. That gives you 48 to 52 extra deals in a year. That would increase your income to massive levels.</p>\n\n<p>You can’t take:\n<br />• My inspiration\n<br />• My motivation\n<br />• My drive\n<br />• My genius</p>", "duration": "31:59", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_065_Mystery_Shopper_2015.03.26.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1426784452, "title": "064: How to Train for Success", "author": "Grant Cardone", "summary": "<p>Grant and Jarrod recently visited Fort Benning in Georgia. They trained with the troops and then Grant spoke to a group, helping them obtain the tools they need to succeed. Soldiers for Life is a group helping soldiers make the transition from their life in the military to the civilian world—and will be working with Grant Cardone to bring success training to troops.</p>\n\n<p>Troops live a life of strength. They aren’t focused on sympathy and feeling sad about pain, they take it as a badge of honor.</p>\n\n<p>“For the young hustle to turn into something rich, you gotta train, you gotta prepare, you gotta bleed.” – GC</p>\n\n<p>Grant and Jarrod are going to apply military discipline to develop their sales training success to even greater levels. There are too many Jacks, too many fakers out there without raw data to prove their training works.</p>\n\n<p>“The one thing that will guarantee you fail with training, is that you don’t do it enough.” – JG</p>\n\n<p>To Succeed at Training:\n<br />1. Every Day\n<br />2. Basics\n<br />3. Advanced Skills\n<br />4. Roleplay\n<br />5. Tested and Held Accountable</p>\n\n<p>“The more you sweat in training the less you bleed in battle.” – Military Motto</p>\n\n<p>CardoneUniversity.com Basics:\n<br />1. Make an opening script. Drill it until it’s proven to not work.\n<br />2. Biggest problems to customers saying yes.\n<br />3. Throughout the day, immediate correction.</p>\n\n<p>“Nobody wants to go to the gym. Everybody wants to look good.” – GC</p>", "duration": "1:00:41", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_064_How-to-Train-for-Success_2015.03.19.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1426179600, "title": "063: How to Become a Millionaire by 30", "author": "Grant Cardone", "summary": "<p>[Previously Aired on May 29, 2014]  In this episode, Grant and Jarrod talk about how millennials must focus on earning more and building their incomes incrementally with a strong “Follow The Money” message. Money must NOT be a taboo topic. Millennials must place an importance on money and understand that they can have more money. It is possible. Grant banked 1 million dollars in 9 years by the time he was 30. He explains he built it incrementally and went from 3k to 4k then increased over and over again. Grant and Jarrod share their own personal stories about how they build income by applying 3 critical steps:</p>\n\n<p>1. Follow the Money: get around players who are in businesses experiencing rapid growth. If you are in an organization figure out where the money is. What departments are bringing in money? How can you get involved? Make yourself a valuable resource.\n<br />2. Don’t Show Off, Show Up: Focus on effort and productivity not cars and bottles in the VIP, watches and clothes. The biggest money makers know showing off is expensive and cuts into the bigger bottom line, wealth and true freedom.\n<br />3. The Only Reason to Save is to Invest.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "43:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "millionaire by 30", "follow the money", "earn more money", "Jarrod Glandt", "Warren Buffett", "millionaire secrets", "earning millions", "how to make millions", "how to build wealth", "wealth"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1425578400, "title": "062: The Money Pitch", "author": "Grant Cardone", "summary": "Millennials could be a dominant force in the marketplace, but they are constantly fed false data that keeps them down. They are told they are lazy, entitled and will never amount to the greatness of the generations before them. Grant Cardone and Jarrod Glandt are here to prove otherwise.\n\nThey don’t just talk the game—they live it. And every Thursday at 1 PM EST they share free tips on varying topics about entrepreneurship, finances, investing, business practices, and more. Today Grant talks about the taboo topic of how to become a millionaire and addresses the issue of what kind of pitch you have.\n\nSupposed Emerging Affluent Traits:\n• 68% are female\n• Median household income of $125k\n• 48% use a financial advisor\n• Average age is 40 years old\n\nYou need to have the hustle, but you need to have a plan—hustling with no direction does you no good.\n\nFigure out a timeframe and make a plan backwards. If you have 10 years and you want a million dollars, you need to net $100,000 per year. If you want to go to Las Vegas, you won’t get there until you get on a road that leads to Nevada.\n\nHow to Become a Millionaire:\n1. Decide you’re going to become a\n2. Have a path, do the math\n3. Figure your pitch out\n\nEvery pitch should start with, “Why did you agree to meet with me?” so that you know what you’re shooting at. Don’t go in guns blazing with no target.\n\nIt takes guts, courage and discipline to make money. Stop worrying about passive income and get your pitch down and make money first.", "duration": "28:28", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_062_The_Money_Pitch_2015.03.05.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1424973600, "title": "061: Mystery Shopper", "author": "Grant Cardone", "summary": "There are 80 million Millennials out there and no, not all are lazy and entitled. There are plenty who want true freedom, prefer entrepreneurship to the 9 to 5 grind and are hungry for mentors who give them the real deal. Grant Cardone and his millennial protégé, Jarrod Glandt target the under 35 crowd with the tips and insights they need to succeed in any economic climate. Between the loose laid back banter and the frequent references to Jay Z, Kanye, Led Zeppelin music and other pop culture millennial viewers consider Grant their “millennial mentor” and can’t get enough of Grant and Jarrod’s straight up no BS advice.\n\nSomewhere in your career you’re going to have to take a phone call. You’re going to have to ask for an appointment and make a first impression. Don’t lose the sale. Each month we do a Mystery Shopper show where we call companies and build a report card for their methodology.\n\nIn this episode Grant and Jarrod call:\n• A Printer Company\n• A Recruiting Company\n• A Massage Chair Company\n\nReport Card Criteria:\n1. Introduction\n2. Have a track to run on\n3. Qualify the caller\n4. Setup an appointment", "duration": "53:15", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_061_2015.02.26_Mystery_Shopper.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1424368800, "title": "060: 50 Shades of Green", "author": "Grant Cardone", "summary": "Young Hustlers addresses the Millennial myths put out by the media telling you that you won’t be successful, you’re stuck behind the curve, and you cannot break free. You can be a millionaire by the time you are 30. And if you are already 30, you can fix the problems that kept you from becoming one.\n\nToday Jarrod talks about dominating your money. Millennials are lined up to be the first generation to not be better off than the previous generation. That doesn’t have to be our fate.\n\n“Are you money dominant or money submissive?”", "duration": "37:48", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_060_2015.02.19_50_Shades_Of_Green.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1423764000, "title": "059: Why Millennials Are Broke", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt address Millennials and all of the bullshit information that’s being passed down to you. They found an article, originally posted on Inc.com that is literally titled, “5 Reasons You Shouldn’t Get To Work Early.” They discuss how ridiculous this is and talk about the four reasons why you are broke and how you can fix them.\n\n“You are never paid what you’re worth.” – GC\n\nFrom the Article:\n5 Reasons You Shouldn’t Get To Work Early\n1. Nobody likes a “thirsty” employee\n2. You’re alienating colleagues\n3. You seem like a pushover\n4. You’re not management material\n5. You’ll be taken for granted\n\nThe above list is complete bullshit.\n\nFrom Grant:\n4 Reasons Why You’re Broke:\n1. You’re only making enough money to live.\n2. You don’t have any emergency funds.\n3. You have no money to invest.\n4. You have no choices because you have no money.\n\n“Money is the currency of choice.” – GC\n\nChocolates last 10 minutes, roses last a few weeks, a teddy bear just gets in the way. Go to GrantCardone.com or WITNation.com and use the code: 50LOVE to get 50% OFF of the ENTIRE STORE.\n\n“You don’t have a debt problem. You don’t have a spending problem. You have an income problem.” – GC\n\nDon’t be mediocre in a bunch of different fields. You need to become great at one, build it up, understand it completely, and then take a step into another field.\n\nWhen you are in your 20s, get a job that makes you money, whatever it is. It doesn’t matter what it is. Make a decision and go at it full force. Don’t wait to figure it out, or question if it’s right for you.\n\n“Move fast. Don’t drag ass.” – Jarrod Glandt", "duration": "54:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_059_2015.02.12_Why_Millennials_Are_Broke.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1423159200, "title": "058: Problem with Your Pitch", "author": "Grant Cardone", "summary": "Jarrod Glandt is taking the solo reins again this week with the Pitch. Don’t believe the misinformation that the big media outlets are putting out for Millennials. For example, Bloomberg business just put an article out about Millennials living with their parents—they blame it on student loan debt. Jarrod thinks that’s a load of bull.\n\nAs a Millennial our problem is the inability to pitch yourself, your product, or your business. If you aren’t making enough money, it doesn’t matter where you live or what kind of debt you have. If you fix your pitch, you can get the job you want, the life you want and build your personal wealth.\n\nPitch 3-Point Format:\n1. Get someone’s attention, get it fast\n2. Be concise\n3. Prepare with training and practice\n\nWhen Jarrod came to Grant Cardone at 26-years old, he knew nothing about sales, but he knew a lot about persistence. Grant was forgiven and allowed him a space to prosper, but it took a lot of work, a lot of practice and was a huge risk.\n\n“Your success dulls every day that you do not sharpen it.” – Jarrod Glandt", "duration": "29:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_058_2015.02.05-problem-with-your-pitch.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1422554400, "title": "057: Why Millennials Must Take Risk", "author": "Grant Cardone", "summary": "For the first time ever Jarrod Glandt is hosting Young Hustlers solo! That’s right, he’s taking the reins and addressing the topic of risk—and how it’s your biggest opportunity!\n\nGetting your piece of the ‘American Pie’ by taking more risk.\n\nFor some reason Millennials are failing to launch. The truth is, nothing you ever really want is something you get without taking some risks. And if you crash and burn, how bad is it really?\n\nWe also recognize Heath Powell and Todd Straugh and discuss the huge personal risks they took to join the Grant Cardone sales team. They showed an extreme amount of courage and commitment and they just got promoted to management yesterday after showing that courage every day at the office and on the road.\n\nRisk:\n1. When to take it\n2. Why you take it", "duration": "31:49", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_057_2015.01.29-why-millennials-must-take-risk.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1421964677, "title": "056: Do You Still Need Sales People?", "author": "Grant Cardone", "summary": "Are sales people still relevant, valuable, and worth keeping commissions for? Brian de Haaff, CEO of AHA! said, “At Aha! we purposefully don’t have a sales team nor do we pay commissions on new customers. That’s because we believe it drives the wrong behavior and outcomes.”Grant points out that it’s bad sales people that you should be avoiding, not all salespeople. Bad salespeople have to rely on ineffective tactics, which puts a negative light on sales. You don’t need to lie when you sell, check out 7 Top Sales Secrets and find out how to close sales the right way.", "duration": "37:06", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_056_2015.01.21-do-you-still-need-sales-people.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnation", "witn", "young hustlers", "jarrod glandt", "grant cardone", "millennials", "gen y", "business", "salespeople", "success", "money"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1421356997, "title": "055: How To Hit Your Goals", "author": "Grant Cardone", "summary": "<p>For the Millenials who are sick and tired of getting advice from their father's golf buddies. No generation is different from any other. You need to get your information from people who are willing to do Whatever It Takes to get things done, not from those who have given up on their dreams.</p>\n<p>Engage in these shows by commenting and calling in. The comments are gone through by Grant and Jarrod to build content for future episodes.</p>\n<p>Most people have adopted goals—goals of previous peers or generations.</p>\n<p>Grant and Jarrod want to help you get your focus, reestablish your motivation which comes from having goals.</p>\n<p>3 Things To Set Your Goals:\n<br />1.        What is important to you?\n<br />2.        Prioritize your goals.\n<br />3.        Make sure these goals are yours and not someone else’s.</p>", "duration": "31:54", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_055_2015.1.15-howtohityourgoals.mp3", "type": "episode", "tags": ["whatever it takes network", "whatever it takes", "witnetwork", "witn", "young hustlers", "grant Cardone", "jarrod glandt", "millennial", "millennials", "business", "goals", "setting goals", "success", "generation y", "10x", "new years resolutions", "resolutions", "smart goals", "goal setting"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1415862000, "title": "046: Mystery Shopper", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt call unsuspecting businesses to show how they candle customers. Poor customer service is a huge issue in today’s marketplace. People don’t know how to sell and service customers. Good service is what’s expected, great service is when you personalize it. This key insight is practiced by so few. Those who go above and beyond beat out competition ever time. Grant and Jarrod call a business that sells specialty gift items (chap sticks, memo pads, pens). Jarrod pretends he’s planning his booth event at an upcoming convention and wants to price out some product. Find out how the salesperson handles the call and why 20 second into the conversation, Grant is ready to jump through the phone. Grant and Jarrod run into automated recorded messages and are put on hold too long. Their reactions are hysterical. You laugh and learn the following tips in this episode of Young Hustlers, Mystery Shopper. Mystery Shopper: Smart Sales Basics 1.       Answer the phone with enthusiasm. 2.    Ask key questions. 3.   Aim to serve and provide information. 4.        Know your inventory. Grant and Jarrod also speak to a woman at a call center and a Miami based real estate agent who blows off answering questions about a multimillion-dollar property. You can practically see the smoke coming out of Grant’s ears. Tune in!", "duration": "32:16", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_046_2014.13.11-mystery-shopper.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1415257200, "title": "045: Things You Have to Know to Be Successful", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt offer millennials success strategies each week. On this weeks episode of Young Hustlers Grant and Jarrod focus on a list of 10 things one needs to master in order to be successful. They share the list of these skills and then ask callers to repeat them all back in order then admit which they need help with. It leads to great conversation and excellent tips. Grant starts the show off laying into Tim Ferris’ 4 Hour Workweek. Grant feels there are no shortcuts and nothing great comes without hard work and sacrifice. The Big 10 for Success 1.        Commit to success. 2.   Great attitude. 3.      Strong networker. 4.    Know how to sell. 5. Know how to negotiate. 6.  Know how to close. 7.   Follow up. 8.   Market yourself (Get Attention) 9.      Hire great people. 10.  Leadership Grant and Jarrod weigh in on how important it is to agree and get agreement and callers ask for insights on negotiation and sales. Grant’s dropping gems in this episode so check it out.", "duration": "50:11", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_045_2014.06.12-things-you-need-to-know-to-be-successful.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1414652400, "title": "044: The Art of The Pitch", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt offer tips on how people can pitch themselves in business so they get attention and more deals. Inspired by the 2014 World Series and the amazing performance by pitcher Madison Bumgarner, Grant wants to make sure you get your business pitch strong. Can you capture someone’s attention and tell them who you are, what you do and what you offer them within seconds? To get ahead of the pack you must know how to master your pitch. In this episode of Young Hustlers Grant and Jarrod take callers and challenge them to give them their best pitch. Grant’s 5 Tips for The Perfect Pitch 1.  Clarify your goal. 2.   Ask for attention. 3. Make it sticky. 4.        Get to the decision maker. 5.   Practice! According to Grant a good strong, clear introduction is very important. He also tells people to speak clearly. When you get in front of someone you must be ready. You must practice and prepare. Grant and Jarrod take callers, listen to their pitches and critique them making for an interactive learn by example show. You’ll come away with tips and insights to help you get your pitch on point.", "duration": "32:55", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_044_2014.30.10-the-art-of-the-pitch.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1414047600, "title": "043: How to Brand Yourself", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt offer business insights to help millennial thrive in the competitive marketplace. Grant and Jarrod begin the episode announcing that when it comes to branding and getting attention for yourself and your business there are NO shortcuts. You must be fully committed. These days people Google you. What do you want them to see when the find you online? Who are you? What are people saying about you? Who do you want to be? What do you want to be known for? These are the key questions one must ask when creating a brand identity. Grant and Jarrod take callers and offer great insights to people in business looking to crank up even more. They ask callers if they can explain who they are in 12 words. This episode is the longest in Young Hustler history as it's a topic Grant gets fired up about. Tune in for the steps to take when building a brand which include: Steps to Build Your Personal Brand: 1.     Define your purpose. 2. Be everywhere! 3.       24/7 No breaks! 4. Connect with the connected.", "duration": "1:00:37", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_043_2014.23.10-how-to-brand-yourself.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1413442800, "title": "042: Understanding The Four Quadrants", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt offer tips to better the careers and financial futures of Gen Y. This episode looks at The Four Cash Flow Quadrants as explained by Robert Kiyosaki American investor, businessman and author of the Rich Dad Poor Dad book series. The quadrants include employee, self employed, business owner and investor. According to Grant one is navigating every section all the time. Most people are either employees or self-employed. Yet, a small population are business owners and investors and this is where 95% of the wealth resides. Which one do you want to be? Grant and Jarrod take callers answer their questions where the following key tips are offered. Advice for Millennals: 1.        Always promote yourself. Don’t wait. 2. Know your money down to the penny. 3.   Write your goals down. 4.       Use fear as proof you’re going in the right direction", "duration": "45:18", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_042_2014.16.10-understanding-the-four-quadrants.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1412838000, "title": "041: The Best Financial Investment for Millennials", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt encourage millennials to invest in themselves and increase their income. What are Millennials doing with their money? Reports say they are conservative savers and this can hurt them. Grant and Jarrod explain that it is vital that millennials stash away money so they can then invest it in something that will generate additional income. Grant explains the difference between baby money and baller money, at least $100,000 that can be used for investment. He explains when millennials have 5, 10, 15, 30, $40,000 they should focus on investing in themselves so they can get around big thinkers and ideas that will generate more income. Millennial Money Tips Include: 1.    Invest in Yourself! 2.  Focus on growing your income. 3.        Do not overspend. 4.    Save more to invest with. Grant and Jarrod explain that everyone is looking for the shortcut and there isn’t one. Spend energy in making yourself known in the marketplace and advise a caller to do this exact thing. Other callers get advice from Grant and Jarrod. Tune in to get the sound advice you need to make the most of your millennial money.", "duration": "34:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_041_2014.09.10-best-financial-investment-millennials.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1412233200, "title": "040: How to Stand Out", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt offer Millennials tips for getting attention in business. Great news! Businesses are hiring. This means you must get attention and set yourself apart in the marketplace. For people with jobs this means you must promote your value within your organization. Grant and Jarrod begin the show explaining how money follows attention and why you must have a ‘whatever it takes’ attitude and do what others refuse to do. Some examples Jarrod shares include arrive early and stay late, think like the owner and bring ideas that meets the business’ objectives and purpose. Specifically Grant offers these 3 Steps to Get Attention 1.  Make yourself known. 2. Deliver what is needed. 3.      Improve yourself every day. Grant and Jarrod take callers, with questions about standing out despite being young, how to get attention to expand their business and how to advance to the next level.", "duration": "39:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_040_2014.03.10-how-to-stand-out.mp3", "type": "episode", "tags": ["promotions", "work", "jobs", "moving up", "money", "millionaire"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1411628400, "title": "039: 3 Undeniable Rules For Success", "author": "Grant Cardone", "summary": "Grant Cardone and Jarrod Glandt share their 3 undeniable rules for success. Grant and Jarrod explain why you need rules. People often say setting rules is bad and you should live in the moment and do what feels right. Grant and Jarrod agree that, “if you don’t have some always, you’ll end up with nevers.” This means that you must have some rules and some codes for how you choose to live life. You must think about where you are going and what you want. Then establish some rules, some “always” to keep you on the path to get there. They explain each of the 3 undeniable rules for success: 1.      Show Up! 2.     Be Consistent. 3.       Be Ok With Failure Grant and Jarrod also offer some great responses to the prospect that tells you to “stop calling.” Tune in, check out what they are and guaranteed you’ll change your game.", "duration": "25:29", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_039_2014.24.09-3-undeniable-rules-for-success.mp3", "type": "episode", "tags": ["consistency", "failure", "success", "tips", "follow up"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1411023600, "title": "038: Personal Financial Freedom", "author": "Grant Cardone", "summary": "Grant Cardone offers 4 things millennials must do to create financial freedom. Jarrod is on vacation with his girlfriend and Grant starts the show with statistics on salaries in America urging millennials to think about what they are doing to earn money. He explains that there are specific things people must do and continue to do in order to achieve financial freedom. Millennials are burdened with debt, unemployment and lower levels of personal income than the last two generations at the same age. Grant gives all millennials permission to get rich and give the 4 ways to make it happen. 4 Ways To Get Rich 1.  Decide you will be rich. 2.     Focus on it every day. 3.       Follow the money. 4.    Stay disciplined with resources (time, money and energy) Grant takes calls and invites Video Producer Robert Syslo on the show to discuss how he is increasing his income despite being a “creative” type. Rob, 26 offers great insights for other millennials and shares how his thinking shifted since working for Grant Cardone.", "duration": "34:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_038_2014.17.09-personal-financial-freedom.mp3", "type": "episode", "tags": ["finance", "freedom", "money", "become rich"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1409209200, "title": "035: Startups", "author": "Grant Cardone", "summary": "Grant Cardone offers solid tips and advice on start ups. Grant and Jarrod start off the show explaining that every day we start up. Every time you enter a new phase in business of life, it’s a start up. Start up doesn’t only mean working independently. Maybe you are starting up a new client relationship, a new week, a new month, moving to a new place? The key is not to get freaked out and stuck in start up mode. A startup is defined as a company, a partnership or temporary organization designed to search for a repeatable and scalable business model. This means the goal is to grow, expand and achieve success. However, there will be start ups along the way every time you do something new. Grant encourages everyone to look at all the ways they start up on a daily basis. Then advance forward by following these steps. 1.     Start 2.        Sell and Get Money 3.   Reinvest Back Into Business 4.  Market Your Business 5. Start Over Again at New Condition Grant also reveals them mistakes he made with start ups 1.    Not starting to market 2.       Going through repeated start up modes 3.        Staying in start up mode too long 4.    Not changing for the condition 5.       Not reinvesting 6.      Staying small Grant and Jarrod offer callers incredible advice urging them to think of starting up like a car. Turn the ignition and hit the gas! GO! Then accelerate. Always ask why you are doing what you are doing. Why it is important? Why do I want it? During the show other brands and topics are discussed include; tiredofmissingsales.com, airsign.com G&E Show, 10X Rule mp3, Microsoft, Google.", "duration": "45:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_035_2014.28.08-start-ups.mp3", "type": "episode", "tags": ["Start Up", "Acceleration", "tiredofmissingsales.com", "airsign.com G&E Show", "10X Rule mp3", "Microsoft", "Google"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1408604400, "title": "034: Don’t Be Stupid", "author": "Grant Cardone", "summary": "<p>Learn how millennials can make money after college or without college in sales.</p>\n\n<p>This week’s Young Hustlers begins with Grant Cardone sharing a story of how he was doing a real estate deal and was impressed by the service the rep was providing. He was 28, and not making enough money. Grant offered him the opportunity to go work for him where he would make three times his $25,000 salary helping Grant handle his real estate transactions. The guy didn’t want to move. He didn’t want to follow the money. This leads to the topic… “Don’t be stupid.”</p>\n\n<p>Millennials are graduating college more than any other generation. They are in greater debt post-college and they can’t get jobs. Why? Don’t be stupid!</p>\n\n<p>1. Follow the money\n<br />2. Be willing to be uncomfortable\n<br />3. Do what’s difficult\n<br />4. Cut off the negative influences\n<br />5. See opportunities and take action</p>\n\n<p>Grant and Jarrod explain that getting an education is a good thing but there are other options to consider. Grant suggests graduating high school, working for two years then attending college. He also says that everyone should work while in college. Employers want to know you have work experience.</p>\n\n<p>Finally both Jarrod and Grant dispel common false beliefs that many have about sales and explain that one can make six figures in sales without college degrees. If you can hustle and sell you can earn big! Tune and for their take on this very important point.</p>\n\n<p>Young Hustlers also features a few “Mystery Shop” calls to demonstrate the mistakes salespeople are making and missed opportunities. “Don’t Be Stupid!”</p>", "duration": "45:43", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": null, "type": "episode", "tags": ["Hublot", "Zeal", "Opus 1 Wine", "Caymus Wine", "Brandon Steiner", "Mystery Shopper", "Cardone University", "Google", "Crossfit"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1406844024, "title": "033: How to Use YouTube to Grow Your Business", "author": "Grant Cardone", "summary": "<p>Grant Cardone Sales Expert and YouTube partner shares How to strategies for Using YouTube To Grow Your Business.</p>\n\n<p>Cardone had 38,000 views just yesterday, 500,000 views in the last 30 days so he knows what he is talking about with 7.5 million total views Cardone shares how he has used YouTube to grow his own business. Giving example of how you can grow your YouTube following to expand your business significantly.</p>\n\n<p>Grant discusses the different types of categories of content a business must satisfy:\n<br />Promotional, Educational, Entertainment, Instructional, Motivational.</p>\n\n<p>Grant also shares details about his early start on YouTube and how he built his channel to the following it has today. He also offers clear examples of how YouTube introduced him to people worldwide leading to business growth and expansion. The day before this show aired Grant’s You Tube had 35,000+ views and 200,000 minutes viewed. According to Grant businesses who are not posting videos on You Tube are missing out.</p>\n\n<p>Grant and Jarrod also share some key YouTube Stats:\n<br />4 Billion Views Per Day</p>\n\n<p>Monthly visits by demographic includes:\n<br />49% baby boomers\n<br />58% gen X\n<br />70% gen Y\n<br />83% gen Z</p>\n\n<p>One piece of advice is to think quantity not quality, offer variety, be dependable and have longevity.</p>\n\n<p>According to Forbes, 87% of Chief Marketing Officers said content marketing initiatives exceed return on investment expectations.</p>\n\n<p>If you business is not taking advantage of YouTube it should be and Grant explains why. He offers the example of what Real Estate professionals should be doing on You Tube. He explains money follows attention and You Tube is a great tool to gain more eyes given the average person watches 4 videos per day.</p>\n\n<p>Celebrities, notable people and businesses mentioned in this episode include: Justin Bieber, Orlando Bloom, Tom Hopkins, Jeffrey Gitomer, Gary Vaynerchuck, Whatever it Takes Digital Network</p>\n\n<p>We want to hear from you!\n<br />Did this episode give you any insight or some ideas you can apply to your business and life? What is your next step? Comment below. We read them all.</p>", "duration": "55:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_033_2014.31.07-how-to-grow-your-business-with-youtube.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1406233267, "title": "032: How to Close More Deals on the Phone", "author": "Grant Cardone", "summary": "<p>Grant Cardone, NY Times bestselling author, self made multimillionaire entrepreneur, international sales master and motivator in business and life, along with his Vice President of Sales and protégé Gland offers insights and advice each week on Young Hustlers, a webcast that helps Millennials ages 18-33, to better their careers, businesses and finances so they can create true freedom in their lives.</p>\n\n<p>In this episode, Grant and Jarrod break down Grant’s “Boiler Room” You Tube video where Grant jumps in on his salesperson Todd’s sales call. Grant starts the show asking viewers to rate their level of phone skills on a scale of 1-10. Grant tells salespeople that the phone is the most important tool for successful sales people to use but they must learn how.</p>\n\n<p>Jarrod and Grant offer the 5 parts to a successful sales call which include:</p>\n\n<p>1. Talking\n<br />2. Listening\n<br />3. Asking Questions\n<br />4. Selling\n<br />5. Closing</p>\n\n<p>Jarrod and Grant open the phone lines to sales professionals and test their phone skills on air making for a funny and informative example of the kind of push back a salesperson can get from prospects. They offer the phrase “I don’t have any more money to give you,” as the go to phrase to use when negotiating price.</p>", "duration": "48:19", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_032_2014.24.07-How-to-close-more-deals-on-the-phone.mp3", "type": "episode", "tags": ["sales", "grant", "cardone", "calling", "talking", "phone", "cold-call", "boiler room", "jarrod", "glant"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1405627200, "title": "031: How to Build Confidence!", "author": "Grant Cardone", "summary": "<p>According to Grant and Jarrod, millennials are often criticized for being entitled, lazy and self absorbed. Despite these negative stereotypes it is important millennials push ahead and strive for the success they want. Confidence plays a huge role in this. The following tips to build confidence are discussed in this episode along with great callers with BIG energy, hilarious freestyle rapping from Grant and featured music and mentions of Drake, Lil’ Wayne and Kanye West.</p>\n\n<p>Why is it so important to have confidence?</p>\n\n<p>Here is how to build it and why:</p>\n\n<p>1. Be professional in your dress and language. How you carry yourself counts!\n<br />2. Be the first one there\n<br />3. Have a great attitude\n<br />4. Gain knowledge\n<br />5. Work extra and go in on off days.\n<br />6. Be consistent.\n<br />7. Bring In Revenue</p>\n\n<p>Grant Cardone, NY Times bestselling author, self made multimillionaire entrepreneur, international sales master and motivator in business and life, along with his Vice President of Sales and protégé Gland offers insights and advice each week on Young Hustlers, a webcast that helps Millennials ages 18-33, to better their careers, businesses and finances so they can create true freedom in their lives.</p>", "duration": "35:21", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_031_2014.17.07-How-to-Build-Confidence.mp3", "type": "episode", "tags": ["Lil’ Wayne", "Kanye West", "Drake", "Swagger Supermarket", "Uptown Featuring Drake and Lil’ Wayne", "confidence boosters", "freestyle rap"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1404993600, "title": "030: How to Nuture and Convert Leads", "author": "Grant Cardone", "summary": "<p>Grant Cardone, NY Times bestselling author, self made multimillionaire entrepreneur, international sales master and motivator in business and life, along with his Vice President of Sales and protégé Gland offers insights and advice each week on Young Hustlers, a webcast that helps Millennials ages 18-33, to better their careers, businesses and finances so they can create true freedom in their lives.</p>\n\n<p>In this episode, Grant and Jarrod talk revisit the subject of follow up. The show starts off with Grant in rare form and his banter with Jarrod is hysterical. The message is clear. If you don’t follow up you will not get what you want. It’s that simple. They discuss how many people fear the follow up and in business and life you must ask for what it is you want again and again. Jarrod and Grant explore the definition of follow up as continuous action applied to achieve a desired end result. Grant urges everyone to get their head right about follow up. He offers a great insight on why the close has got to be top of mind right from the start. According to Grant and Jarrod follow up requires:</p>\n\n<p>1. Commitment\n<br />2. Creativity\n<br />3. Clear expectation</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video then share it to help others train their “manners muscle.”</p>", "duration": "48:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_030_2014.10.07-How-to-Nurture-and-Convert-Leads.mp3", "type": "episode", "tags": ["Tim Ferris", "The Dealer Playbook", "Jeffrey Gitomer", "Tom Hopkins", "sales masters", "follow up in sales", "Sell or Be Sold", "Sales Seminars", "TedX", "Ted Talks", "Nova Southeastern", "Business School Lecture", "Harvard Business", "Top MLM’s", "Multi Level Marketing", "Networking"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1404370800, "title": "029: What Wealthy People Do to Create Freedom", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod talk about creating freedom and how millennials MUST make creating wealth for themselves top priority and focus in their lives. Student loans and post college debt is enormous. Millennials are forced to return back to their parents, postpone home purchases and getting married and starting families. Grant breaks down his prediction of the economy over the next 20 years and how millennials will suffer if they do not take massive action to achieve wealth. Grant refers to college as yet another middle class trap and encourages millennals to have a defined purpose and goal before taking on such enormous debt. Grant also advises millennials to leave behind the limited thinkers holding them back in life and find people who are achieving success to be around. Jarrod stresses the importance of work ethic urging millennials to understand that it takes incredibly hard work and dedication to achieve financial freedom. They share a list from an article siting the things rich people do include:</p>\n\n<p>1. Keep goals in sight.\n<br />2. Know what needs to be done and do it.\n<br />3. No time for TV\n<br />4. Read and learn.\n<br />5. Listen to audiobooks.\n<br />6. Go above and beyond at work.\n<br />7. Not hoping for luck or lottery.\n<br />8. Active and physically fit.\n<br />9. Healthy smiles.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video then share it to help others train their “manners muscle.”</p>", "duration": "28:21", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_029_2014.03.07-what_wealthy_people_do_to_create_freedom.mp3", "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "entitlement", "earn more money", "Jarrod Glandt", "manners", "business advice", "business tips", "Entrepreneur Magazine", "Elite Daily", "College debt", "Visa", "bank loans", "bank of America", "wells fargo", "Fox News", "CNN", "Yahoo Finance"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1403812816, "title": "028: Why Manners Equal Money in Sales and in Business", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod talk about manners and how important it is in business to mine money and mind your manners. Grant and Jarrod believe that having good manners is a great way to differentiate oneself in business and that one will never be faulted for having great manners. Grant refers to an article he wrote for entrepreneur.com and elitedaily.com with 12 manners to adopt immediately in business and life. They include:</p>\n\n<p>1. Use a surname with Mr., Sir, Ms., Miss or Mrs\n<br />2. Use “yes, sir” and “no, sir.”\n<br />3. Say, “It’s my pleasure.”\n<br />4. Offer, “thank you for your time.”\n<br />5. Don’t interrupt.\n<br />6. Provide a full acknowledgement.\n<br />7. Be present.\n<br />8. Say thank you. Then add thank you and thank you again!\n<br />9. Don’t leave out “Excuse me.”\n<br />10. Hold the door open.\n<br />11. Try saying, “I’ll be happy to find the answer for you.”\n<br />12. Add, “It’s an honor to work with you.”</p>\n\n<p>Grant reveals which of the 12 he struggles with and what went on at his own company that inspired this topic. Jarrod explains that millennials get a bad rap for not being well mannered and encourages his generation to set themselves apart by using these 12 examples of good manners then add more to see a difference in how people treat you.</p>", "duration": "28:21", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_028_2014.26.06-why_manners_equal_money_in_sales_and_in_business.mp3", "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "entitlement", "earn more money", "Jarrod Glandt", "manners", "business advice", "business tips", "Entrepreneur Magazine", "Elite Daily", "using surnames", "sales techniques", "professional behavior", "professional presence"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1394739177, "title": "027: How To Get Promoted", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod give the 8 reasons you may not be getting ahead and how to successfully get that raise or promotion you desire. Having the awareness of these tips will help propel you into the marketplace. Rather than remaining stationary and stuck in the same rotation you must take personal responsibility to develop the self confidence and mental attitude to know your self worth, know your value and take actions that are relative to increasing your compensation. This is not something you cannot fake, you must believe and understand – sell yourself first.</p>\n\n<p>The 8 Reasons you are not getting that promotion:\n<br />1 – You are not confident you can do the job at the next level\n<br />2 – You do not have a company owner mindset\n<br />3 – You think too small and have no strategic vision\n<br />4 – You embarrass or surprise or correct your boss in public\n<br />5 – You get defensive when you receive constructive feedback\n<br />6 – You do not have a solid strong relationship with your boss\n<br />7 – You are not speaking to your work\n<br />8 – You complain, gossip, or have a bad attitude. Even if on occasion</p>\n\n<p>Source: http://www.fasttrackpromotion.com/get…</p>\n\n<p>Grant and Jarrod analyze this list in detail and give effective strategies to handle these 8 reasons. The first is to communicate you are money motivated, another is to be a problem solver. To find problems and build value to a company increases your worth exponentially. Do more than that is expected of you at all times, be noted for your hustle. If no one has commented on your hustle in the last hour, you need to step up. Grant and Jarrod also recognize the importance of finding the other avenues of revenue within the company. This shows enthusiasm, interest in progress of the company, and states you are motivated to increase your wealth and position.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "42:08", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_027_2014.19.06-how-to-get-promoted.mp3", "type": "episode", "tags": ["grant", "cardone", "success", "tips", "wealth", "career", "how", "to", "make", "money", "promotions", "grow", "business", "raise", "gossip", "positive", "job", "work", "get", "promoted", "fast", "confidence", "mindset"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1402556400, "title": "026: How to Follow Up Without Looking Like Following Up", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod reveal the greatest shortage hindering millennials from great success, the ability to follow up with persistence until a deal is secured. According to Jarrod Glandt, “the single scarcity in your space will also equal opportunity.” They explain how being told not to be pushy or to pester is wrong and instead must be as persistent as a child who wants candy or a toy. Grant and Jarrod share these 4 important tips with regards to follow up with deeper insights on each.</p>\n\n<p>1. Follow up until somebody dies: Follow up immediately and combine, phone call, emails, text message and another in person visit.</p>\n\n<p>2. Be so frequent people think you’re a freak: When you believe persistence is achieved. Believe in what you’re offering and offer it over and over. Make it your obligation to make people understand the value in what you have.</p>\n\n<p>3. Get Creative! Creativity follows commitment. When following up frequently you have to think of other ways to engage. Be so creative they don’t even think they’re being sold. Have an arsenal of useful information and share it to help them make a decision.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "47:53", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_026_2014.12.06-how_to_follow_up_without_looking_like_following_up.mp3", "type": "episode", "tags": ["Grant Cardone", "Jarrod Glandt", "millennials", "success", "money", "persistence", "job market", "purpose", "goals", "prospecting", "handling", "clients", "closing", "deals", "follow up", "earn", "more", "Gen-Y", "strategies", "career"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1401951600, "title": "025: How to Stay Focused at Work", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod give the 10 Signs of Trouble in the workplace, warning signs to millennials and to managers and HR professionals. Having the ability to self motivate and remain engaged and excited about the work you do is KEY to determining your level of success at any organization. Jarrod reminds Young Hustlers to reconnect to their goals and bigger purpose when they find themselves lagging at work. A survey showed that over 60% of millennials said they would rather make 40k at a job they love than 100K at a job they were bored with. Grant says that people are only bored with their jobs when they lack the desire to do more to earn more.</p>\n\n<p>Grant Cardone and Jarrod Glandt offer 10 signs of trouble peopel or employees that you may not want to hire or keep around you. entitlement, gossip, complaining, know-it-all, independence without concern for the group, excuses, no enthusiasm, unwillingness to help others, liar, no initiative.</p>\n\n<p>If you're a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "36:12", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_025_2014.05.06-how_to_stay_focused_at_work.mp3", "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "entitlement", "job market", "purpose", "goals", "staying focused", "earn more money", "Jarrod Glandt", "workplace warning signs", "bad employees"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1401390000, "title": "024: How to Become a Millionaire by 30", "author": "Grant Cardone", "summary": "<p>In this episode, Grant and Jarrod talk about how millennials must focus on earning more and building their incomes incrementally with a strong “Follow The Money” message. Money must NOT be a taboo topic. Millennials must place an importance on money and understand that they can have more money. It is possible. Grant banked 1 million dollars in 9 years by the time he was 30. He explains he built it incrementally and went from 3k to 4k then increased over and over again. Grant and Jarrod share their own personal stories about how they build income by applying 3 critical steps:</p>\n\n<p>1. Follow the Money: get around players who are in businesses experiencing rapid growth. If you are in an organization figure out where the money is. What departments are bringing in money? How can you get involved? Make yourself a valuable resource.\n<br />2. Don’t Show Off, Show Up: Focus on effort and productivity not cars and bottles in the VIP, watches and clothes. The biggest money makers know showing off is expensive and cuts into the bigger bottom line, wealth and true freedom.\n<br />3. The Only Reason to Save is to Invest.</p>\n\n<p>If you’re a millennial ages 18-33 or a parent of one, watch this video to learn from two people who were broke and are building wealth for themselves so you too can get the life you deserve.</p>", "duration": "43:57", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_024_2014.29.05-how_to_be_a_millionaire_by_30.mp3", "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "money", "millionaire by 30", "follow the money", "earn more money", "Jarrod Glandt", "Warren Buffett", "millionaire secrets", "earning millions", "how to make millions", "how to build wealth", "wealth"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1400788800, "title": "023: How to Get A Job After College", "author": "Grant Cardone", "summary": "Grant Cardone, NY Times bestselling author, self made multimillionaire entrepreneur, international sales master and motivator in business and life, along with his Vice President of Sales and protégé Gland offers insights and advice each week on Young Hustlers, a webcast that helps Millennials ages 18-33, to better their careers, businesses and finances so they can create true freedom in their lives. In this episode, Grant and Jarrod offer tips for graduating millennials who will begin their job search. They advise millennials to make a list of people, not companies, but people that they want to work for and then research how to get to them. They then must do whatever it takes to make that connection. Grant and Jarrod also explain that although companies are hiring, traditional salaried positions will not provide the income necessary to pay down college loans and provide enough cash flow allowing for true freedom. Jarrod shares the top 5 majors getting jobs in this economy but stresses the importance of understanding what you're interested in an good at to earn a living. Grant explains that the traditional method of job searching must be abandoned in favor of a more direct approach that gets you to decision makers truly in the position to hire you. More insights on job hunting, business mistakes, and tips are given in this weeks episode. Important Links & Resources For More Information Grant's Twitter: https://twitter.com/GrantCardone Jarrod's Twitter: https://twitter.com/JarrodGlandt Grant's Facebook: https://www.facebook.com/cardonesuccess Main Website: http://www.grantcardone.com Sign up for your free weekly strategy from Grant: http://www.grantcardone.com/cardone-success/ Interested in having Grant speak at your organization? Email: Contact@grantcardone.com Links & Info: Forbes Magazine: http://www.forbes.com/search/?q=degrees+that+get+you+hired We want to hear from you!Did this episode give you any insight or some ideas you can apply to your business and life? What is your next step? Comment below. We read them all. If you have a topic you would like for Grant and Jarrod to explore, send an email to contact@grantcardone.com We welcome your ideas! Young Hustlers airs weekly at 1PM EST on: http://young-hustlers.com/ The Show Hotline direct to Grant Cardone and Jarrod Glandt is: 305-865-8668", "duration": "40:58", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_023_2014.22.05-how_to_get_a_job_after_college.mp3", "type": "episode", "tags": ["Grant Cardone", "millennials", "success", "social media", "Enterprise Car Rental", "college graduation", "job hunting", "education", "business tips", "getting hired", "first job", "career advice", "millennials and jobs", "after college", "money", "college debt"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1400137200, "title": "022: Should You Move for Opportunity?", "author": "Grant Cardone", "summary": "<p>According to Chris Christopher, director of consumer economics for IHS Global Insight Inc. in Lexington, Massachusetts, quoted in Bloomberg Businessweek “the decline in mobility among young adults “is economically significant…it is a lot more expensive to get started, to move, to find a job. In terms of social mobility, job mobility, overall geographic mobility, they are not doing as well as their parents and grandparents.” Jarrod and Grant discuss the importance of needing to follow the money and the opportunity, to not be held back by old thinking, staying in one location and growing your business there is acceptable, but thats just average you have to push beyond and go where the opportunities are. There is no limitation to any individual. If you are unhappy with your situation you can move beyond it. Kenneth Johnson, senior demographer at the Carsey Institute at the University of New Hampshire in Durham, said that “migration is a key advantage of the American system historically…”the ability of growing areas to attract migrants from a large national labor pool has historically helped the U.S. adapt to changing economic conditions.”</p>\n\n<p>If you are being held back by fear or distraction a millennial has to take the appropriate steps to move beyond this, it is vital to their success to break out and seize opportunities available to them. Bloomberg states that “economists and demographers say a combination of relatively low-paying opportunities, the burden of student loans and an aversion to taking risks explains the reluctance to relocate”. Even if this is a concern Jarrod and Grant emphasize that nothing should be a reason hold you back. If you have an opportunity to increase your revenue know your purpose, take responsibility and take action. Otherwise as William Frey a senior fellow at the Brookings Institution in Washington who specializes in migration issues, quoted by Bloomberg “they remain stuck in place and the recent slowdown is really an interaction of demographics and a continued housing- and labor-market freeze. Millennials are mired down, very cautious about buying a home or moving to new areas.” Grant often discusses the importance of no matter how you feel, where you are you must show up. If something is holding you back identify it and push beyond it, it is the obligation you owe to yourself and to your success.</p>", "duration": "35:51", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_022_2014.15.05-should_you_move_for_opportunity.mp3", "type": "episode", "tags": ["Grant Cardone", "GrantCardone", "Success Tips", "New York Times Best Seller", "wealth", "career", "finance", "business", "money", "revenue", "increase wealth", "how to make money", "how to grow your business", "college debt", "millenials"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1399532400, "title": "021: How to Follow Up", "author": "Grant Cardone", "summary": "In today's episode Grant and Jarrod discuss the important of follow up in business, why its effective and how to do it.", "duration": "40:46", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_021_2014.08.05-follow_up.mp3", "type": "episode", "tags": ["Grant Cardone", "GrantCardone", "Success Tips", "New York Times Best Seller", "wealth", "career", "finance", "business", "money", "revenue", "increase wealth", "how to make money", "how to grow your business", "college debt", "millenials"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1398927600, "title": "020: The Millionaire Formula", "author": "Grant Cardone", "summary": "I wanted to be Millionaire when I was 10 years old --- That desire to have money has never not been there since I was introduced to a quarter...and what I could do with it...", "duration": "56:28", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_020_2014.01.05-the_millionaire_formula.mp3", "type": "episode", "tags": ["Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching", "Social Media", "Social Media Marketing"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1398369600, "title": "019: Rags to Riches", "author": "Grant Cardone", "summary": "In this weeks episode Jarrod and Grant discuss the ways in which an individuals background does not dictate the amount of wealth and achievement they have in their lives. Regardless of social standing, education, rich family, or poor family, Grant and Jarrod give you the tools to breakout, step into your success and achieve financial freedom.", "duration": "53:00", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_019_2014.25.04-rages_to_riches.mp3", "type": "episode", "tags": ["Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching", "Social Media", "Social Media Marketing"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1397764800, "title": "018: Social Media Mistakes", "author": "Grant Cardone", "summary": "Grant Cardone discusses mistake people and companies make with social media - Facebook, twitter and Youtube are discussed on Young Hustlers where Jarrod Glandt and Grant Cardone take callers and discuss the dumbest things people do on social.", "duration": "39:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_018_2014.15.04-social_media_mistakes.mp3", "type": "episode", "tags": ["Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching", "Social Media", "Social Media Marketing"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1397113200, "title": "017: Are Millennials Really Different", "author": "Grant Cardone", "summary": "<p>Are Millennials Different? Lazy, Entitled, Cant communicate, Job hoppers, Not Loyal, Poor work ethic.</p>\n\n<p>But Are they actually any different Different Than Other Generations? Derek Irvine writes in Millennials aren’t Entitled They’re Just Misunderstood. Tired of hearing the myths about Millennials in the workplace (entitled, need constant praise and reassurance, difficult to manage)?</p>\n\n<p>Harvard Business Review:\n<br />Millennials are entitled, disloyal, and lazy. And they expect things to come easily to them.\n<br />These are common beliefs that many managers hold.</p>\n\n<p>Harvard Business Review says. it turns out, aren’t nearly as entitled as we make them out to be.\n<br />In fact, “most are ambitious, and look to make a big impact in their careers right from the start. ”\n<br />But managers can sometimes misconstrue this as entitlement.</p>\n\n<p>CRASHING MYTHS\n<br />23% of all millionaires are Millennials\n<br />bout 5m millionaires\n<br />Gen X only 4 million\n<br />Disloyalty.</p>\n\n<p>EVERY generation when they were young and new in the workplace.</p>\n\n<p>Boomer managers said that about me as a young Gen X employee.\n<br />How HARD WERE YOU TO MANAGE AT 25</p>\n\n<p>TECHNOLOGY\n<br />Millennial employees have never lived a day without technology</p>\n\n<p>It is up to managers to KEEP up not misunderstood young people.\n<br />This isn’t generational behavior, it’s stage of life behavior\n<br />Take Away\n<br />They aren’t different\n<br />They need leadership\n<br />They need inspiration\n<br />All NEW employees will seek recognition and feedback.</p>", "duration": "48:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_017_2014.10.04-are_millennials_really_different.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1396987200, "title": "016: Why You Hate Your Job", "author": "Grant Cardone", "summary": "<p>The high cost of job dissatisfaction. A Gallup poll says 52% of full-time workers are disengaged, Costing US companies from $450 billion to $550 billion every year. America, stopped looking to your job for fulfillment and started looking at it as the unpleasant means to an end. 52% of all full-time workers in the U.S. are not involved in their work, not particularly enthusiastic about it and are committed only as much as they have to be. 18% of those folks are “actively disengaged” and have checked out to the point that they’re actually a hindrance to the company.\n<br />TRAGEDY IN AMERICA</p>\n\n<p>This Cost U.S. companies $450 billion to $550 billion every year.</p>\n\n<p>What does it cost you?\n<br />1) Self esteem\n<br />2) Energy\n<br />3) Life satisfaction</p>\n\n<p>How to Find the right job for you:\n<br />What makes you happy?\n<br />What are you meant to do?\n<br />What are you passionate about?\n<br />What is keeping your from being more engaged?\n<br />Who talked you against the job you have?\n<br />How good are you at your job?</p>\n\n<p>26.2%, workers ages 25 to 34 already have an unemployment rate that’s higher than in Canada, the U.K., France, Japan, Australia, Russia and Germany. Labor Department says it’s also the only group in the U.S. that saw its average wages decrease over the same span. 52% dissatisfied with their job and disengaged. One job is available in the U.S. for every three people who apply.</p>\n\n<p>The domestic economy has regained just 5.7 million of the 8.7 million jobs shed during the Great Recession. Worse, roughly 65% of those jobs are of the low-wage variety, though nearly 60% of all jobs lost during the slump paid middle-income wages or better, according to the National Employment Law Project.</p>\n\n<p>The most common job in America since the recession is in retail sales. Those workers number 4.3 million (greater than the population of Kentucky) and make only $25,000 a year, well below the more than $45,000 national median wage. While college students are still far better off than their less educated peers, art school students and MBAs alike are being crushed by student debt.</p>\n\n<p>Deeply indebted doctorate recipients are seeking food stamps in increasing numbers. Roughly 284,000 college graduates are making minimum wage.</p>\n\n<p>Key Reasons for Job Dissatisfaction and Poor Employee Performance</p>\n\n<p>by Rose Johnson , Demand Media</p>\n\n<p>Many employees feel dissatisfied with their jobs at one point or another. Some employees leave their jobs for better opportunities, while others choose to stay. Employees with low job satisfaction can negatively affect a company because they typically lack motivation, perform poorly and possess negative attitudes. These symptoms can directly affect a company’s bottom line. Managers should understand the reasons employees are unhappy at work. Understanding the causes can help managers find the right solutions.</p>\n\n<p>1) Underpaid\n<br />2) Limited Career Growth and Advancement\n<br />3) Lack of Interest\n<br />4) Poor Management</p>", "duration": "51:45", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_016_2014.4.04-why_you_hate_your_job.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1395432000, "title": "015: Why Millennials Should Never Trust Anyone", "author": "Grant Cardone", "summary": "<p>The new Pew survey of millennials presents a portrait of young people that is both depressing and optimistic. Millennials, young adults between 18 and 33, are low on social trust: Just 19 percent believe that “most people can be trusted,” compared to 40 percent of Baby Boomers and 31 percent of Generation X.</p>\n\n<p>Why are young people less trusting than their elders? The Pew study offers several hypotheses:</p>\n\n<p>Racial diversity. Minorities have historically been less trusting than whites. The millennial generation is far more diverse than their elders — 43 percent are minorities. Internet usage: Millennials are strongly connected to online communities and friends. The average millennial has 250 Facebook friends. Strong Internet connections may lead to closed social networks and a wariness to put too much trust in people who are not part of your network. Pessimism for the future. However, the Pew study finds that millennials are upbeat about the country’s future and their own prospects for financial success. But we should reconsider these conclusions. My research strongly suggests that economic pessimism, not racial diversity or the Internet, is the key to explaining lower trust.</p>\n\n<p>The first two explanations seem plausible, but they gather little support from the data. The Pew data are not publicly available, but Pew’s surveys use the same trust question as the General Social Survey (GSS): “Generally speaking, do you believe that most people can be trusted or can’t you be too careful in dealing with people?” In the 2012 GSS, 19 percent of millennials expressed trust in others, the same as the Pew survey.</p>\n\n<p>The main reason to discount racial diversity is that it cannot account for the generational decline in trust among whites. Minorities have always been less trusting than whites — not just in the United States, but virtually everywhere the question has been asked. But unlike among whites, the trend among minorities has been fairly stable over time: minority young people are slightly more mistrusting than their minority elders, but the difference is small (5 percent). Although the increasing share of young people who are racial minorities may lower trust overall, it does not explain the key trend: why each successive generation of whites has become less trusting — with white millennials almost as mistrusting as minorities of any age. Roughly 22 percent of white millennials trust others, compared to 16 percent of black/non-white millennials.</p>\n\n<p>There is also little reason to blame the Internet for lowering trust. I have shown (gated) that there is no relationship between Internet use and trust. And the logic behind this linkage is suspect. Most of our interactions on the Internet are with people we know. Generalized trust is all about having faith in strangers — and there is no clear way to go from one form of trust to the other.</p>\n\n<p>This leaves economic pessimism. Although Pew noted that young people are fairly optimistic about their future, the key question is not whether you believe that you will succeed in life. Through thick and thin, Americans have been optimistic about their own abilities to overcome obstacles to success. What matters most are relative expectations.</p>\n\n<p>Here, the pessimism of millennials stands out: relative to Baby Boomers, millennials are more likely to say that their generation is worse off than their parents. Millennials also worry that “today’s young adults face greater economic challenges than their parents’ generation faced when they were starting out,” as stated in the Pew report. And fewer millennials now consider themselves to be middle class (42 percent to 53 percent in 2008). More millennials now see themselves as lower or lower-middle class now than in 2008 (46 percent compared to 25 percent).</p>", "duration": "52:41", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_015_2014.20.03-why_millennials_should_never_trust_anyone.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1394740800, "title": "014: Multiple Flows of Income", "author": "Grant Cardone", "summary": "<p>On this weeks episode Grant and Jarrod discuss creating multiple flows of income and why it is crucial to never turn your back on the primary flow until the other flows are so strong that nothing can possibly destroy or erode them.</p>\n\n<p>Warning: Even once the other (newer) flows are strong enough I would still suggest you never ignore the primary flow as it made the other flows possible. This mistake is made by almost everyone seeking to create multiple streams of income.</p>", "duration": "35:02", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_014_2014.13.03-multiple_flows_of_income.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1394481628, "title": "013: New World Order", "author": "Grant Cardone", "summary": "<p>What Millennials Can Teach Boomers About Financial Planning . Northwestern Mutual Contributor, Northwestern Mutual . Auto leasing just hit all time HIGH!</p>\n\n<p>By Sonya Stinson</p>\n\n<p>At first glance, it’s hard to see what Generation Y—a.k.a. the Millennials—can teach Baby Boomers about financial planning? Many of the youngest Millennials are buried in a TRILLION dollars of student</p>\n\n<p>2) haven’t moved away from home\n<br />3) Cant get a job\n<br />4) and probably the most disparage generation in the history of the human race!</p>\n\n<p>Opinion</p>\n\n<p>Wait a minute</p>\n\n<p>1) Leasing hit all time high! Smart\n<br />2) Home purchase down by millineals! Smart\n<br />3) Investments in 401K down — Smart</p>\n\n<p>They aren’t buying their mom and dads BS planning</p>\n\n<p>4) Use Credit Cards with CautionAccording to credit score provider FICO, Millennials were more likely not to have a credit card than any other age group. In 2012, 16 percent of 18- to 29-year-olds did not have credit cards, compared to 8 percent or lower for the older age groups.\n<br />5) 50% don’t trust govt programs going forward</p>\n\n<p>In Northwestern Mutual’s 2013 Planning and Progress Study, nearly a quarter (24 percent) of Gen Y respondents identified themselves as “highly disciplined” financial planners.</p>", "duration": "43:52", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_013_2014.27.03-new_world_order.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1394434800, "title": "012: How Millennials Can Get Rich", "author": "Grant Cardone", "summary": "NY Times bestselling author Grant Cardone discusses the top money mistakes millennials make. Viewers and listeners share the mistakes they’ve made with money. Grant Cardone and Jarrod Glandt begin the show explaining the there are many money mistakes millennials may make. Jarrod admits that he once bought 25 strangers at a bar shots of Patron tequila. Grant explains that it is important for people not to put their attention on the wrong things. He urges millennials to think about the life they want and then work to build wealth to achieve true financial freedom. Grant and Jarrod discuss these money mistakes: 1.      Settling, not striving. The wealthy never get enough wealth and never seek comfort. They seek freedom and abundance and always strive for more. 2.      Diversification. Andrew Carnegie said, “the way to get rich is put all your eggs in one basket and then watch that basket.” 3.  Depending on one income flow. 4.        Comparing yourself to others. 5.        Seduced by the hottest, newest, thing. Avoid investing in any companies that can be displaced by new technological developments. 6.     Naïve and too trusting. 7.      Saving to save. To create wealth you must move surplus money into investments that will create more income producing activities. 8.     Being a premature baller. On the other end of the saver is the spender, the one who is trying to impress others with their cars, clothes and watches.", "duration": "42:36", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_012_2014.10.03-how-millennials-can-get-rich.mp3", "type": "episode", "tags": ["Brazilian Blow Out", "Las Vegas Weekend", "Italy Trip", "Diversification", "Investing", "Andrew Carnegie", "Passive Income", "Multiple Income Flows", "Saving Money", "Patron Tequila"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1393484400, "title": "011: Marijuana and The More Formula", "author": "Grant Cardone", "summary": "", "duration": "44:03", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_011_2014.27.02-marijuana_and_the_more_formula.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1393437658, "title": "010: Multiple Flows of Income", "author": "Grant Cardone", "summary": "", "duration": "34:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_010_2014.26.02-multiple_flows_of_income.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1392274800, "title": "009: How to Hustle Smart", "author": "Grant Cardone", "summary": "", "duration": "36:11", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_009_2014.13.02-how_to_hustle_smart.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1391709636, "title": "008: Millennials Break Out", "author": "Grant Cardone", "summary": "", "duration": "46:56", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_008_2014.6.02-millennials_break_out.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1391065200, "title": "007: Millennials and Obama CareMillennials, Gen Y and Obama Care on Young Hustlers", "author": "Grant Cardone", "summary": "", "duration": "40:17", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_007_2014.30.01-millennials_gen_y_and_obama_care_on_young_hustlers.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1389682800, "title": "006: Are You a Young Hustler?", "author": "Grant Cardone", "summary": "", "duration": "38:23", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_006_2014.14.01-are_you_a_young_hustler.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1386226800, "title": "005: Get in the Jet Stream", "author": "Grant Cardone", "summary": "", "duration": "27:27", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_005_2013.5.12-get_in_the_jet_stream.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1384239600, "title": "004: How to Get Rid of Debt", "author": "Grant Cardone", "summary": "", "duration": "22:33", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_004_2013.12.11-how_to_get_rid_of_debt.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1383847258, "title": "003: What to do when You're the Youngest Person in the Room", "author": "Grant Cardone", "summary": "", "duration": "26:39", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_003_2013.7.11-what_to_do_when_you_are_the_youngest_person_in_the_room.mp3", "type": "episode", "tags": []}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1383202800, "title": "002: The Sales Pitch", "author": "Grant Cardone", "summary": "", "duration": "26:22", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_002_2013.31.10-the_sales_pitch.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}, {"seriesId": 860180416, "seriesTitle": "Young Hustlers", "pubDate": 1382684400, "title": "001: Pilot", "author": "Grant Cardone", "summary": "", "duration": "18:38", "imageUrlLg": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/600x600bb.jpg", "imageUrlSm": "http://is2.mzstatic.com/image/thumb/Music71/v4/26/cf/2b/26cf2b28-bbd6-a3a9-b5ac-369a13e58430/source/60x60bb.jpg", "audioUrl": "http://www.podtrac.com/pts/redirect.mp3/podcasts.grantcardone.com/younghustlers/YH_001_2013.25.10-pilot_episode.mp3", "type": "episode", "tags": ["Middle Class", "Sales Tips", "Job Tips", "Free Sales Tips", "Sales Motivation", "Sales Coaching", "Closing Sales", "Sales", "Closing", "Success", "Business Coaching"]}]}